{
	"Changes":[
		{
			"LogName":"Abigail",
			"Action":"EditData",
			"Target":"Characters/Dialogue/Abigail",
			"Entries":{	
  "Introduction": "Oh, that's right... I heard someone new was moving onto that old farm.#$e#It's kind of a shame, really. I always enjoyed exploring those overgrown fields by myself.$9",
  "Resort_Entering": "I hope a mermaid visits the beach.",
  "Resort_Leaving": "I'm gonna ask Willy if we can take the scenic route back.",
  "Resort_Leaving_2": "Maybe we'll see a sea monster on the way back.",
  "Resort_Shore": "The beach is okay, but it gets boring pretty quick. I'd rather check out that dark jungle, or the volcano!",
  "Resort_Shore_2": "Hmm, you think I could sneak my guinea pig onto the island?#$e#Nah, David's probably not much of a swimmer anyways.$1",
  "Resort_Umbrella": "My skin gets burnt really easily. So I'm just gonna stay under this umbrella for a while.#$e#I like it in the shade. Too much sun makes me dizzy.",
  "Resort_Umbrella_2": "Hey @, want to build a sand castle with me?#$e#Actually, a sand dungeon might be cooler!$1",
  "Resort_Umbrella_3": "Hey @, you think you could build a raft?#$e#I saw a few cool islands on the way here I want to visit.",
  "Resort_Wander": "An island this big has got to be hiding some buried treasure.#$e#Quick, get me a shovel!#$e#Relax, I'm just kidding.$1",
  "Resort_Bar": "Gus made me a dark purple refresher, to match my hair. It tastes great!$1",
  "Resort": "Bummer... Willy says we have to stay on the beach...$2#$b#And I brought my sword and everything...$2",
  "danceRejection": "That's flattering... but I'm gonna have to say no. Sorry.",
  "divorced": "What are you doing here? Just leave me alone!$5",
  "dumped_Girls": "Don't talk to me!$5",
  "secondChance_Girls": "*sigh*... I can't stay mad at you anymore, @. Let's just move on with our lives.$2",
  "breakUp": "Oh... I... I understand. You see me as just a friend...$2#$b#I guess we weren't really a good match...$2",

  "Event_VideoGame_Yes": "Great! I'm sure you'll be able to beat this level with ease.$h",
  "Event_VideoGame_No": "Oh? *sigh*... I guess I'll never get past this level, then...$s",
  "Event_Grave1": "See? You understand why I'm out here, then.#$b#I've lived in the valley my whole life, but I've never really done anything memorable. I want to go on an adventure!$8",
  "Event_Grave2": "Sure. I don't want to kill anything, either. I just want to do a little exploring without risking my neck!#$b#I've lived in the valley my whole life, but I've never really done anything memorable. I want to go on an adventure!$8",
  "Event_Grave3": "Oh, it's because I'm a girl... isn't it? Ugh...$u^Why? I'm just as strong as you!$a#$b#I'm not some fragile princess.. I can take care of myself!$a#$b#I've lived in the valley my whole life, but I've never really done anything memorable. I want to go on an adventure!$8",
  "Event_Grave4": "Really? That's surprising.$8#$b#I've lived in the valley my whole life, but I've never really done anything memorable. I want to go on an adventure!$8",
  "Event_Rain_1": "I see...$8",
  "Event_Rain_2": "Yeah... I guess you would be the type to enjoy this somber ambience.",
  "Event_Rain_3": "...That's true.$8",
  "Event_Tragic_1": "Yeah... I guess my own life is okay...$s",
  "Event_Tragic_2": "...!$h",
  "Event_Tragic_3": "I would feel better if I could believe that...#$b#But I don't.$s",
  "Event_Cave2_1": "@... *sniffle*$2",
  "Event_Cave2_2": "@... I-I'm alright... *sniffle*$2",
  "Event_Cave_1": "*sniffle* *hic* O-Okay......$4#$b#%Abigail relaxes a little bit at your reassurance.",
  "Event_Cave_2": "I guess so... *hic*#$b#*sniffle*... M-Maybe I don't have to be a big girl right now...$4",
  "Event_Cave_3": "*sniffle* Sh-shut up, dork! *giggle*... *hic*...$4.#$b#%...Abigail playfully knocks your shoulder, and wipes at her tears.",



  "Mon": "Oh, hey. Taking a break from work?",
  "Mon2": "Oh, hi!#$e#Do you ever hang out at the cemetery? It's a peaceful place to spend some time alone.",
  "Mon8": "...Oh, @! Hi.$1#$e#Want to hang out for a while? Here! Let me read your palm. *giggle*#$e#...So, this fate line means 'prone to changes in life from external forces'...$9#$b#I sure BET you're prone to changes! *giggle*$1",


  "Tue": "Ugh... I'm not in a good mood right now.$2#$e#I said I'm not in a good mood... what do you want?$5",
  "Tue2": "...*sigh*...$2#$e#I know my parents mean well, but they're so uptight! Weren't they ever young?",
  "Tue6": "I wonder what Mom was like when she was my age.#$e#...Well, I can't imagine she was that much like me.$1",


  "Wed": "Hey. Sorry in advance if I say anything rude. I didn't get much sleep last night.#$e#What do you want?",
  "Wed2": "Oh, hi @. Taking a break from your work?#$e#Me too. Oh! Nothing physical... just some online classes I'm taking.",
  "Wed6": "It's cool that all my classes are online this spring. I've never liked classrooms.#$e#If I get ONE more teacher that thinks it's funny to say \"I don't know, caaaan you?\" when I ask to go to the bathroom, I'm gonna pee on their desk like a dog.$3",


  "Thu": "#$1 Abigail1#Oh no, I think my Dad's going to cook dinner tonight...$2#$e#I don't feel like doing anything today...$3",
  "Thu4": "I'm craving something sweet... Hmm, maybe chocolate?$9#$e#I tend to snack when I'm bored.$1",


  "Fri": "Wow, I just realized it's Friday.$3#$e#Sometimes I totally lose track of time.",
  "Fri2": "We're all going to hang out in the saloon this evening. It's kind of like a friday tradition, I guess.",
  "Fri6": "The birds were happily chirping today. They're too simple to understand the future.#$e#It's better to be like them, isn't it?",


  "Sat": "The fresh mountain air is nice on a day like this.$1#$e#I wonder if the frogs will make an appearance soon.",
  "Sat6": "Hey, @. Wanna come along next time Sebastian and I go searching for frogs?#$e#Sometimes Sam joins us too, but he's such a little baby about it. He gets spooked any time one hops towards him...$9#$b#You're braver than that, right?",


  "Sun": "Oh man... I've been pushing off my homework all weekend. Looks like I'll be pulling another all-nighter...$2",
  "Sun2": "I wonder what would happen if I spent all night in the graveyard?#$q 17/18 Sun_old#@, What do you think happens to us after we die?#$r 17 0 Sun_17#I have no idea.#$r 18 40 Sun_18#We come back as spooky ghosts.#$r 17 0 Sun_17#We go to Heaven.#$r 18 0 Sun_17#Our energy bodies enter the astral plane.#$r 17 30 Sun_nothing#Nothing. We just cease to exist.",
  "Sun_old": "$p 17#I guess you think nothing would happen, right?$3|Maybe a wicked ghost would appear!",
  "Sun_17": "Hmm, interesting...",
  "Sun_18": "Well that's an interesting theory!$1",
  "Sun_nothing": "You know, that wouldn't be so bad.$8",
  "Sun8": "Sometimes, I have to sneak out of my room in the dead of the night to go wash bedsheets or pants down in the river.#$e#I still havent run across any spooky ghosts, though...$2",


  "4": "Oh, hi.",
  "spring_12": "I'm definitely going to enter the egg hunt tomorrow. Are you?",
  "spring_23": "Well, tomorrow is the flower dance. Dancing is alright, but they make me wear this stupid white dress...$2",

//--------------

  "summer_Mon": "My pet guinea pig, David, just hates this weather.#$b#I can't say I disagree with the little guy.$1",
  "summer_Mon4": "Oof, I think you might want to consider a shower soon, @. This heat makes any smells...$1#$b#Well, let's just say they get a LOT more obvious.$4#$e#If that old farmhouse of yours doesn't have a working shower, you can use the bathhouse up north.",
  "summer_Mon6": "Extra-hot weather? Bleh. Disgusting. The absolute worst.$5#$e#...Extra-hot Spicy Eel at the Saloon tonight, on the other hand..?#$b#Now we're talking!$1",


  "summer_Tue": "The air is so thick with honey and nectar all summer. I almost feel dizzy.$3",
  "summer_Tue8": "Nngh... I don't know if it's the heat that's making my stomach upset, or if I overdid it again last night at the Saloon...$3#$e#I'm just gonna blame it on the weather. *gurgle*$1",


  "summer_Wed": "I would love to live in an old farmhouse like you.#$b#The creak of a floorboard, the slow plumes of dust whispering through the rafters... There's something special about an old building, isn't there?",
  "summer_Wed4": "Do you ever get scared living alone in that creaky old house?#$b#Pshhhh, not me! I would never.#$b#Heh heh... ha...$9",
  "summer_Wed8": "Hiya, @!$1#$e#If you ever get lonely in that spooky old house, let me know.#$b#I'm always down to have a sleepover!$1",


  "summer_Thu": "If I knew how to use a sword I would be exploring those caves by the mountain lake right now. It's probably nice and cool in there.",
  "summer_Thu6": "Hey, @! You've fought monsters before, right? Do you think you could show me some sword stances?#$b#All the ones I've seen before wouldn't really work with a diaper on...$9",
  "summer_Thu10": "Sometimes, when it's too hot, I go for a swim in that little cave-pool down in the mines.#$b#Smuggling a waterlogged diaper back up afterwards is really hard, though...$9#$e#What, you think I'm gonna take it off? Psh, fat chance!$1#$b#Getting your diaper all big and heavy is part of the fun!$4",


  "summer_Fri": "I kind of wish I had a cat. Unfortunately, my Dad is allergic to pretty much everything.",
  "summer_Fri6": "Dad searched the whole shop top-to-bottom for spoiled produce again this morning.#$e#...It drives him crazy when he can't find anything.$4#$b#%Abigail flashes a cheeky grin.",


  "summer_Sat": "I'm looking forward to fall... the cool mountain breeze, the swirling red petals, the smell of mushrooms... *sigh*",
  "summer_Sat6": "Uuuuu... I don't feel like doing anything... Summer is no fun! It's just hot and sticky and boring.$2",


  "summer_Sun": "Do you ever get an urge to go exploring, @?#$q 25/26 summer_Sun_old#Okay... pretend you just won a free vacation. Where would you go?#$r 25 0 Sun_25#The beach#$r 26 30 Sun_26#In a dark cave#$r 26 30 Sun_26#The old, gnarled forest#$r 25 0 Sun_25#Joja Mega-Mall",
  "summer_Sun_old": "$p 25#I do... but you probably wouldn't like the places I'm thinking about...|Maybe we'll be neighbors someday. I think we both have similar, weird tastes.$1",
  "Sun_25": "Huh. I think that would get old fast.",
  "Sun_26": "Yea! That sounds wonderful.$1",
  "summer_Sun8": "Every now and then, I try knocking on the door of that big spooky tower.#$b#It's shut tight and nobody answers me... but I can see smoke coming out of the chimney!$9#$e#If my throwing arm were better, I'd chuck a dirty diaper up into the flue. See if THAT would get their attention.$1",


  "summer_1": "Summer's here. It's really not my favorite season.$6#$e#The air is so muggy I feel like I'm floating in soup.$2",
  "summer_6": "I went to the beach last night, after dark... Sometimes you can see strange lights bobbing over the sea.#$e#Or maybe that was just a dream I had... It doesn't feel real anymore.",
  "summer_10": "Everyone's excited for the Luau tomorrow. Maybe a little nervous, too, considering the Governor will be here.",
  "summer_27": "You can't miss tomorrow's festival. It's one of the most beautiful wonders of the valley.",

//---------

  "fall_Mon": "I need to stretch my legs and get some fresh air today.",
  "fall_Mon4": "I need to stretch my legs and get some fresh air today.#$e#Oh, don't worry. It's a very loose definition of fresh!$1#$b#You can stick around if you wanna.",
  "fall_Mon8": "Y'know, after seeing how you've handled it... I could totally see myself living on a farm someday.#$e#Loads of ways to get strong for monster-fighting, plenty of fresh air...#$b#...A plausible excuse for any weird smells... *chuckle*$4",


  "fall_Tue": "$d joja#I try to help out in the shop on most days. Business has been pretty bad since the Joja Mart opened, though.|Ever since Joja Mart shut down we've been doing great at the shop!$1",
  "fall_Tue4": "I may fight with my parents a lot, but I know they're just looking out for me. They're... doing what they think is best.$2#$b#I dunno why I'm saying this to you. Don't tell anyone.$9",


  "fall_Wed": "I can't wait to see some pumpkins this year.$1#$e#The spirit's eve festival happens at the end of the season. It's pretty low-key compared to what you'd see in Zuzu City, but for a small town like this it's a lot of fun.",
  "fall_Wed2": "Are you growing pumpkins on your farm this year?#$e#Save one for me!$1",
  "fall_Wed6": "Pumpkins are the best part of the spooky season.$1#$e#You can make them into a jack-o-lantern, you can smash them into a big ol' mound of veggie-gore, you can bake them into a super delicious pie...$4#$e#...Oh, yeah, they're a great source of fiber too.$1",


  "fall_Thu": "#$1 AbigailHAND#Last night I dreamt that my left hand had turned into a gigantic %noun. Does that mean anything?#$e#%Abigail doesn't seem to be interested in talking right now.",
  "fall_Thu6": "I had a nightmare last night... Probably shouldn't have binged all those scary movies.$2#$e#I think I would've wet the bed if that dream had gone on any longer...$9",
  "fall_Thu10": "I had an interesting dream last night, with you in it.#$e#It was a good dream.$1",

  "fall_Fri": "I wish the season lasted a little longer.$2#$b#When the wind really picks up, I almost feel like a kid again.",
  "fall_Fri4": "I wish the season lasted a little longer.$8#$e#When the wind really picks up, I almost feel like a kid again...#$b#...Even more so when you're upwind, diaper boy! *giggle*$1^...Even more so when you're upwind, diaper girl! *giggle*$1",
  "fall_Fri10": "The mountain caves are so creepy this time of year.#$b#Whenever a strong wind blows down the tunnels and ventilation shafts, it sounds like spooky ghosts are wailing.$4",


  "fall_Sat": "$d cc#I can't believe you fixed up that old Community Center all by yourself. I'm really impressed.|Hey, do you have any scarecrows on your farm?",
  "fall_Sat6": "Hmm, maybe I could dress up as a scarecrow for Spirit's Eve...$9#$e#If I played my cards right, I could blend in with the props and scare people.#$e#It'd take way too much patience, though. I could never sit still long enough to be convincing.$1",


  "fall_Sun": "Hmm... what should I do tonight?#$q 27/28 fall_Sun_old#I was thinking about dyeing my hair again... what do you think?#$r 27 10 Sun_27#Dye it black.#$r 27 10 Sun_27#Why not blonde?#$r 27 20 Sun_WildColor#How about bubblegum pink?#$r 28 0 Sun_28#I like your hair just the way it is!",
  "fall_Sun_old": "$p 27#I was going to dye my hair but then I decided against it.|Yes? What is it?",
  "Sun_27": "I guess that's a pretty safe choice, huh?#$e#I'll think about it.",
  "Sun_28": "Of course that's what you'd say.$3",
  "Sun_WildColor": "You're always good for a laugh.$1",
  "fall_Sun6": "I'm gonna try and catch a horror marathon tonight after my parents fall asleep.$9#$e#I stocked up on snacks, and I also sorta-kinda nicked a couple of these from Jojamart... Here, take one!$1#$b#::120:give:Joja diaper:1::",


  "fall_1": "Ah... Fall's here!$1#$e#I was getting so tired of summer.",
  "fall_26": "Will I see you tomorrow at the Spirit's Eve festival? Look for me in the haunted maze.$1",

//--------------

  "winter_Mon": "It's just too cold to go outside much.#$e#But I do enjoy building a snowgoon.$1",
  "winter_Mon4": "Y'know, it's fun to play in the snow sometimes...#$e#Just be careful about putting any in your mouth, @.$1",


  "winter_Tue": "Doesn't a steaming hot cup of cocoa sound good right now?",
  "winter_Tue4": "It's so cold, I wish we had a hot cup of cocoa to share...$1",
  "winter_Tue8": "It's so cold... We should make hot cocoa!#$e#...If I don't get some soon, I might just have to make a different kind of 'hot chocolate' to warm myself up.$4",


  "winter_Wed": "Hi. Is it boring to be a farmer during the winter?",
  "winter_Wed2": "Hi. If you're ever bored, you can always hang out in my room.#$e#As long as I'm not changing, of course!",
  "winter_Wed6": "It's so hard being sneaky all the time at home whenever winter comes around...$8#$e#I have to keep my window shut all the time for David's sake.$9#$b#Poor little guy... Guinea pigs handle cold weather even worse than I do.$1",


  "winter_Thu": "Another year is almost over.#$e#It goes by so fast, doesn't it?$2",
  "winter_Thu8": "Another year is almost over...#$e#I don't know if either of us grew up very much, though... Maybe next year?$1",


  "winter_Fri": "One thing I've learned living here... everyone stares at you if you look different.",
  "winter_Fri6": "I'm a little scared of trying to change my hair again...$8#$e#Everyone stares at it when it's like this... That makes it easier for me to keep certain other things secret.",

  "winter_Sat": "It's the weekend!#$e#Hmm... Maybe I'll stay up extra late playing video games tonight...",
  "winter_Sat6": "I still haven't beaten Journey of the Prairie King yet.#$e#I keep having... distractions... every time I manage to get a good run going.$4",


  "winter_Sun": "Oh, hello.#$q 29/30 winter_Sun_old#I made these two drawings. What do you think?#$r 29 20 Sun_29#I like the jungle island and the tiger.#$r 30 5 Sun_30#I like the orc with the battleaxe.#$r 29 -50 Sun_Bad#I don't like either of them.",
  "winter_Sun_old": "$p 29#Remember those drawings I showed you a while ago? I accidentally threw them away.$2|Remember that drawing I showed you with the orc? I entered it into an online contest and won 50g!$1",
  "Sun_29": "Oh yeah? I guess that makes sense.",
  "Sun_30": "I'm glad. It's embarrassing to share your art with others. But I think you and I are on the same page.",
  "Sun_Bad": "Rude! Why would you hurt my feelings like that? You're so insensitive!$2",
  "winter_Sun10": "I haven't drawn anything in a while. Maybe I should pick that back up?#$e#It's really hard for me to sit still when I'm drawing, though...$9#$e#I'd have to do it without a diaper on, the crinkling noise distracts me.$3#$b#...But that means taking so many breaks... *sigh*$2",


  "winter_1": "Well, fall is over...$2#$e#But I like winter, too!$1",
  "winter_7": "I wanna make a snowgoon tomorrow.",
  "winter_24": "I'm going to eat so much cranberry sauce tomorrow.$1",
			},
		},

		{
			"LogName":"Abigail Marriage",
			"Action":"EditData",
			"Target":"Characters/Dialogue/MarriageDialogueAbigail",
			"Entries":{

  "Indoor_Day_0": "Morning, sunshine! I wanted to snuggle up in bed a little while longer, but the bathroom was calling me.#$e#Hey, don't give me that look! I still go on the toilet just as much as I go in my diapers!$1#$e#...Okay, okay! Sometimes I do both at once...$4#$b#That's called efficiency, babe. You wouldn't get it! *giggle*$1",
  "Indoor_Day_1": "Hey, @. Heading out into the wild? I got you something...[286 287 205 243 732]#$e#Use that if you get into a tough spot out there.#$e#::125:give:space diaper:3::",
  "Indoor_Day_2": "Heading to the mines? If you find something tasty, remember to bring me a piece!$1#$b#And if you find any discarded diapers down there... I don't know anything about those.#$e#%Abigail smiles at you, feigning innocence.",
  "Indoor_Day_3": "I still can't get over how I can wear diapers so openly here.#$e#It's different than being all sneaky with them... But not a bad kind of different.",
  "Indoor_Day_4": "%You spot Abigail absent-mindedly nibbling on a small chunk of amethyst from her rock collection.#$b#%Before she hurts her teeth, you hand her one of those rubbery little chewy-necklaces she sometimes wears.#$b#Oh... whoops. Thanks @!$1",
//--ADD COOLDOWN TRIGGER TO THIS LINE
  "Indoor_Day_Abigail": "%Abigail is dancing around to energetic music while she cleans the floor, belting lyrics into the mop handle like it's a microphone.#$e#%You briefly get lost in the performance...#$b#%...Until Abby pushes way too hard on a long scream, which makes her bend double and push out a big messy blowout.#$b#...Aw, no! Come on!! I was almost done here!!$7 [TRIGGER]",


  "Indoor_Night_0": "Hey, babe. Tired from a hard day's work?#$b#Here, I got you this special \"muscle relaxant\"... Maybe it'll help.[351]$1#$e#%Abigail is trying very hard not to giggle.",
  "Indoor_Night_1": "Hey. Bedtime soon?#$b#It's harder to sleep without you there next to me.$2#$e#And I get cold, too! You leak in bed so much that I can't use my old electric blanket!$1#$b#...But that's fine, you're a better heater than that old thing ever was.$4",
  "Indoor_Night_2": "I felt like making some soup for dinner. I hope it's not too disgusting. [199 218 219 727 730]$1",
  "Indoor_Night_3": "Sometimes I get this overwhelming urge to climb up onto the roof with a nice warm blanket and just... watch the moon drift across the sky all night.#$b#I know, I know... The roof probably isn't built to handle our weight...$9#$e#Think of it this way, though! We'd still have \"toilets\" up there at least! *giggle*$1",
  "Indoor_Night_4": "Hey, @? If you ever have a nightmare, just think about me!#$b#I'll come to slay all your dream-monsters!$1#$e#...S-sometimes I gotta do the same with you...$9#$b#...But it works every time!$4",
//---ADD ACCIDENT TRIGGER TO THIS LINE:
  "Indoor_Night_Abigail": "*yawn* I'm ready to call it a night pretty soon.$1#$b#How about you? Need to do anything in particular before you're ready for bed?$4#$e#$y 'Abigail gives you a teasing grin._...Could you give me a change?_Of course, babe.*::123:change:space diaper:1::_I gotta go to the potty..._Oh? Well then, let me help you with that!$4*%Abigail catches you in a tight embrace and presses down on your stomach.[TRIGGER]*There! All better now, cutie? Heehee!$1_Nope, I'm all good too!_I'm sure you are, cutie.$1*Just don't stay up too late, or you'll miss out on all the cuddles.$4'",


  "Rainy_Day_0": "*sigh* I wish we'd get some thick fog here in the valley for once...$9#$b#I would love to lurk around in the swirling, hazy mists, and pop out at random unsuspecting passersby.",
  "Rainy_Day_1": "I don't bother with umbrellas when the weather gets like this.#$b#It's more fun to dance around in the rain!$1",
  "Rainy_Day_2": "The gloom... the rain... this is the perfect kind of weather.$4",
//---ADD COOLDOWN TRIGGERS TO THIS LINE:
  "Rainy_Day_3": "Oh, wow. Do you see that? There's something weird in the rain.#$e#%You try to see what she's pointing at, barely noticing Abby's face scrunching up in the window's reflection before her diaper suddenly bulges out noisily.#$b#*giggle* Gotcha! Sorry-not-sorry!$1 [TRIGGER]",
//---ADD COOLDOWN TRIGGER TO THIS LINE
  "Rainy_Day_4": "*sigh* It's so peaceful when it pours like this...$4#$b#%You look out at the storm together. Abby blushes when the muffled patter of raindrops gets suspiciously louder. [TRIGGER]",
  "Rainy_Day_Abigail": "Good morning, sleepyhead!$1#$b#$y 'I'm grabbing something to drink with breakfast. Want anything?_Milk, please!_Hehe. How did I know? Here you are, cutie.[184]$1*Personally, I prefer chocolate milk though._Coffee._Awh, is somebody grumpy? Don't worry, I'd already made a pot for myself.[395]$1*Be warned, though... I take mine pretty strong, so it's probably gonna go right through you.$4_Tea would be nice._Yeah, it's good weather for a warm drink.[614]*Well, it's definitely not Mom's, but I hope I still did alright with it.$1'",

  "Rainy_Night_0": "I was just gazing out into the rainswept woods... I swear I saw something darker than black shifting around the trees.$6#$b#%Abigail pulls her blankie tighter around herself for safety.",
  "Rainy_Night_1": "It's a good night to see a ghost...$4#$e#%Abigail squirms in her cute cotton pajamas for a while as she looks out the window before she realizes just how badly she needs to go potty and runs to the bathroom.#$b#%...Your face heats up when you imagine how much easier it'd be for her to fail those close calls, if you could just get her into wearing onesies...",
  "Rainy_Night_2": "Looks like you got pretty soggy out there today. Bet you could use a change.#$e#...Oh? What are you blushing for, @?#$b#Why, I was only talking about your rain-soaked clothes! What else could I possibly have meant, hmm? *giggle*$4",
//---ADD COOLDOWN TRIGGERS TO THIS LINE:
  "Rainy_Night_3": "%Abigail tugs at your sleeve.#$b#...Hey, @? ...Could you leave the lights on tonight?$8#$b#I, um... kind of played that scary game again... the one with the creepy, dark, endless house...$2#$e#%Abigail follows closely behind you as you flick on all of the night-lights. She only lets out a sigh of relief once the whole house is softly alight with a soft lavender glow.#$b#T-thanks, babe.$4",
  "Rainy_Night_4": "It's the perfect weather to watch some scary movies with you...#$b#We could cuddle up under the blankets together!$4#$e#I'm gonna$1",
  "Rainy_Night_Abigail": "...$9#$b#%Abigail is intently chewing on her little silicone pendant.#$e#%She's very adamant about the fact that it was made for grown-ups -- but you still think it's basically just a pacifier with extra steps.#$b#%Or maybe she's teething? If that's the case, maybe gemstones really will be part of her diet..!#$e#Wha' arw'-- *pleh* --...What are you thinking about over there, @?$1",

  "patio_Abigail": "%Abigail is lost in her music.",
  "spouseRoom_Abigail": "#$c .5#I got up a little before you and fed David Jr. He's very active this morning.#$e#I hope you don't mind the guinea pig smell.#$e#%You don't think guinea pigs tend to have a \"smell\" to them.#$b#%...But you know from experience that purple-haired girls named Abigail usually do.",

  "Outdoor_0": "It's awesome to be able to explore around the farm any time I want. Now I don't have to be so sneaky with stashing changes around!#$e#...Sometimes I still stumble across one of my old used diapers lying half-buried in the dirt. *chuckle*$1",
  "Outdoor_1": "Hmm. I can't tell if that's a manure-stink that I'm picking up on you or if you're the true culprit.#$e#Well... either way, I'm sure you did a very good job! *giggle*$1#$b#%Abby gives you a patronizing little head-pat.",
  "Outdoor_2": "%Abigail is intensely focused on scratching something into the mucky ground with a big long stick.#$b#I got bored of staying inside, but I don't wanna go into town today...$9#$b#So, I'm drawing a Mud-@!#$e#%You suppose you can see the resemblance... but she got your nose all wrong.",
  "Outdoor_3": "Sometimes I see bones out in the woods beyond the farm.#$b#...I can't always tell what kind of animal they belong to, though.$3#$e#...There's nothing quite like a good ominous skeleton! *giggle*$1",
//---ADD COOLDOWN TRIGGERS TO THIS LINE:
  "Outdoor_4": "*rumble* Huh. I thought I'd just eaten recently...#$b#Aw, man, I always forget to put some snacks in my pocket...$2#$e#*grumble* *gurgle* A-ah! W-Wait!$7#$b#%Abigail bends over and clutches her stomach with a gasp. You hear a loud bubbly \"Blort!\" under her jeans.#$b#A-Ah...$1#$b#That was... not a hungry rumble...$4 [TRIGGER]",
  "Outdoor_Abigail": "$c 0.5#I saw a weird bug out here! I wanted to show you, but it skittered away too quick...#%Abigail is huddled up and crying on the ground. Her jeans are totally soaked through.#$b#A h-huge s-spider dropped on me... *sniffle*$2#$e#%You kneel down and give her a gentle hug until she stops trembling, telling her she was so brave for facing the big scary spider.#$b#%Eventually, Abigail sniffles and climbs up to her feet with an embarassingly loud squelch. She briefly glances down at her soaked jeans, appearantly deciding to deal with that later.#$b#Yeah... I-I'm okay...$8#$b#Um... *exhale* Thanks for that, @. I... I think I'll be alright now.",


  "funLeave_Abigail": "I'm going in to town today. I need to stretch these legs a bit.#$b#I think we know what happens when you don't exercise a muscle. *wink*",
  "funReturn_Abigail": "Aww, did you miss me while I was gone?#$b#Hmmm... Well, maaaaybe....$9#$b#Alright, yes, I missed you too.$1#$b#%Abigail flicks your nose playfully.#$b#The real question is, did your diaper miss me?$1",


  "OneKid_3": "I don't know how we're gonna potty train our kid if we can't even potty train you.$9#$e#Joking, joking. I have full faith... in %kid1.$1#$e#...Yeah, yeah, and you're perfect just the way you are too, ya big dork.$4#$e#Love you, babe.#$b#%Abigail sticks her tongue out at you playfully.",
  "TwoKids_0": "If you told my Dad I was gonna be the \"most mature\" person in the household when I got married, he'd call you a liar.#$b#But I say that winner by technicality is still winning!$1",
  "TwoKids_2": "I took the kids out for a little fresh air this morning.#$b#Probably should've woken you up to join us... The house could use a moment to vent out every now and then.$1#$b#%Abigail gives you a cheeky smile",
  "TwoKids_3": "%kid2 takes after my rebellious nature so much. Now I know how Mom felt.$1#$e#Every time I have to put on my \"mom voice\", it makes me feel like I'm in some kinda mirror-world.$9#$b#...It really does make me wonder what she was like before I came along.$1",


  "Good_1": "%Abigail is packing cave supplies.#$b#Flashlight, check. Rope... check. Diapers? Plenty. Now, the snacks...#$e#%You watch as Abigail carefully takes a bar of chocolate laxatives, swaps the wrapper, and sets it in the pack with a couple of regular chocolate bars.#$b#There! ...It's more fun when you don't know it's coming 'til it's too late. *giggle*$1",
  "Good_2": "I tuned in to Welwick's show this morning. My horoscope today is great!#$e#One of the commercials made my head feel kinda funny though...$2#$b#I guess I must've dozed off for a moment while it was airing. I woke up with a soggy diaper right as it ended!$1#$e#I didn't even get to see what they were selling.$9#$b#Oh well... Guess I'll just have to catch it next time.$1",
  "Good_3": "I can't even remember the last time I dyed my hair. Maybe it's been permanently stained like this...#$e#That's the reason why I don't wear blue jeans anymore. *giggle*$1",
  "Good_4": "Hey, @, need a diaper change?#$e#%...You notice Abigail is eyeing the diaper pail, with devious intent written all over her face...#$b#Does it have to be a clean change? *giggle*$1#$e#Hey, c'mon. What's the matter? Recycling is \"good for the planet\", isn't that right?$4",
  "Good_5": "I was just admiring the mermaid's pendant you gave me... I'll proudly wear this to my grave.$4",
  "Good_6": "Be careful out there, monsters are lurking around every corner...#$b#It's a good thing you're strong enough to handle them.#$e#...All of them except for... the snuggle monster! *cackle*$1#$b#%Abigail tackles you into a big crinkly hug.",
  "Good_7": "Psst, hey, @...$9#$b#...@!#$b#%Abigail leans in close, like she's about to tell you a big secret.#$b#You're my favorite.$4",


  "Neutral_0": "I hope you'll still like me when I'm old and wrinkly.$8#$b#At least we might still be young at heart, if that time ever comes to pass!$1",
  "Neutral_1": "That lullaby you sometimes hum to yourself got stuck in my head again...$1#$b#Maybe I should learn it on the flute someday?",
  "Neutral_6": "I wonder how the old shop is doing? I should visit my parents again soon.#$b#...Probably buy some new underpants too.$1#$e#Hey, I wonder... Do you think I could stretch a pair of big girl undies OVER my diaper? *giggle*$1",
  "Neutral_7": "That spooky shrine your Grandpa left behind is so cool. I bet it's super-duper haunted!$1#$b#Oh, gosh... hopefully his ghost hasn't been watching us too closely if it is.$4",
  "Neutral_8": "I swear I just cleaned out the diaper pail the other day! How is it this full again?$9#$e#%Abigail stops, looks at you, then down at her own hips, before she laughs a musical little laugh.#$b#...Okay, nevermind, I do know how.$1#$b#...It's still unfair, though!$1",
  "Neutral_9": "Bluhh. I feel so lazy today, I might just binge some video games...#$b#It's nice being able to skip all the potty breaks, at least.",

  "Bad_7": "I used to be something special to you. Your best friend, your partner in crime... Now you only seem to put up with me for the hot dinners and changes.$s",
  "Bad_8": "I just don't get why you've been giving me the cold shoulder lately...$3#$b#Be a big boy and use your words, @.$2^Be a big girl and use your words, @.$2",
  "Bad_9": "This tension that's built up between us is gonna fester if we don't talk about it.$3#$b#It's like a dirty diaper... If you keep ignoring it, it's gonna blow up.$3",


//------SPRING--------

  "spring_1": "So... any big plans for the new year?#$b#Hmm, I'm guessing 'graduate from potty-training' is a poor bet? *giggle*$1",

  "spring_2": "Blegh. Spring is the second worst season. It's like the Monday of the year.$5#$b#It's not spooky, there's hardly anything fun... The quiet months make me feel all antsy and restless.$3#$e#...I wanna go vandalize Mayor Lewis's stupid truck.$3",

  "spring_4": "Oh, it's time for my annual check-up today... probably gonna get another embarassing lecture on my weak pelvic floor muscles...$2#$e#I mean... I won't lie, total incontinence could be a cute look on me...$9#$b#...But I wanna prove Dr. Harvey wrong for as long as I can first! This is a matter of spite!$3#$e#%There's a fiery determination in Abby's eyes.",

  "spring_12": "Hey, the egg festival is tomorrow! Sorry, but I won't go easy on you just because we're married!$1#$e#I plan on winning that egg hunt. So, go ahead, just try to beat me!#$b#%Abigail flashes you her sharpest smile.",

  "spring_23": "The flower dance is tomorrow...#$b#It's probably a good thing nobody makes you dress up for these.$1#$b#Those suits usually have pretty snug inseams. I don't think there'd be much room for a diaper. *giggle*$1^White dresses are... hard to clean, if something happened. *giggle*$1",

  "spring_25": "Oh right, it's Dad's birthday tomorrow...#$e#I guess I'll probably pick him a couple daffodils on my way to the store, and wish him a happy birthday.#$b#He's... kinda hard to shop for.$9",

//------SUMMER--------

  "summer_1": "Yuck, it's summer. The actual worst time of year.$5#$b#At least in Spring I'm just bored. Now I'm boiling in my skin too.$9",

//---ADD COOLDOWN TRIGGERS TO THIS LINE:
  "summer_4": "Hehe. Hiii, @.$1#$b#%Abigail seems a bit... floppy?#$e#I didn't sleep too well last night, and when I got up, the heat went right to my head.$4#$b#...Don't worryyy, I'm drinkin' lotsa water! See??$1#$b#%Abigail pulls down her jeans, and proudly demonstrates just how \"well hydrated\" she is right into her diaper. [TRIGGER]#$e#%...After changing Abby's flooded pampers, you drape a cold washcloth around her neck and tell her she needs to go cool off.#$b#...Mmm, fine... But only cause I wanna!$4",

  "summer_7": "*giggle* I just remembered today was the anniversary of the Bathhouse Incident.$1#$e#The swimsuit may be long gone, but somehow my locker STILL smells like poop.$1#$b#It probably needs industrial-strength cleaning supplies or something at this point.#$e#...Maybe a necromancer.$1",

  "summer_12": "Um... sorry about the smell. I was sweating all night in the heat...$2#$e#Okay, okay! I also soiled my pajamas too... and it might've been a little bit on purpose...$9#$e#The sweat's worse though. I don't have a tolerance for it.$2",

  "summer_18": "Ugh, how much more summer can there be? I feel all itchy and restless.$2#$e#...I don't know if I need to go break something, or if this is just some kinda full-body heat rash.$3",

//---ADD COOLDOWN TRIGGER TO THIS LINE:
  "summer_23": "%Abigail seems to have given up on pants today; only a plain white diaper hangs around her hips, very swollen and saturated.#$b#Bluhhh. I don't feel like being a big girl today... It's like, a MILLION degrees out there.$2 [TRIGGER]#$e#%You insist on giving your wife a much-needed diaper change and some water before she's allowed to continue melting into the ground.",

  "summer_28": "%Abigail is pacing back and forth, and bouncing on her feet occasionally.#$b#It's almost time! Ugh, I'm so ready for this summer to finally be over!$1",

//-------FALL-------

  "fall_1": "*sniff* Ahhh, fall! The scent is unmistakable! Mushrooms, rotting leaves, pumpkin... Isn't it lovely?$1#$e#Mmm, I really wanna add another smell to that list... but I'll be a good role model and use the toilet.#$b#C'mon, @, I don't have the time for a big messy clean-up, there's fall activities to do!!!$1",

  "fall_2": "Aaagh, I'm so, so, SO excited! The pumpkins, the crunchy leaves, the Spirit's Eve decorations...$1#$b#The spooky movies... *giggle*$4#$e#%Abigail blushes hard, but her face is beaming with unrestrained joy.",

  "fall_8": "I'm in a really great mood today.#$b#I even got up a little early to bake you something special.[220 608 611]$4#$e#...Don't think I'm going TOTALLY soft on you though, alright?#$b#Last I checked, my attitude is still there - and I don’t plan on changing that.$1",

  "fall_16": "It's been a weird autumn...#$b#My favorite kind! *chuckle*$1",

  "fall_26": "Spirit's Eve is tomorrow!!!$1#$e#Don't feel bad if the maze is too scary for you. We wouldn't want you having an accident, would we? ...Well, maybe we would. *giggle*$1",

  "fall_28": "Fall's almost over...$2#$e#Hey, I taped a bunch of brand-new horror movies, can we watch them in bed tonight? Might as well send the season off on a high note.#$e#Hehe, yes!! You're the best! I'll make sure we have some towels laid out. *giggle*$1#$b#::120:give:space diaper:1::",


//-------WINTER--------

  "winter_1": "Mmh, I forgot how cozy it was to curl up in bed for the first snow of the year.$4#$b#Maybe I won't let you climb out of bed quite so easily tomorrow.$1#$e#%Abigail flashes a dangerous grin at you.",

  "winter_2": "Brr... I like winter, but I'm not built for cold weather.$8#$e#Oh, it's not a big deal. That just means I have a reason to warm up.$1#$e#%You hear a muffled hissing noise...#$b#%Abigail is furiously blushing through a mischievous grin.",

  "winter_7": "Hey, if you see my mom today, tell her happy birthday!#$e#Ungh... I'll have to see her tomorrow instead...#$b#I think I ate something bad on Friday, 'cuz my stomach is staging a full mutiny on me today. *gurgle*$2#$b#I've barely made it to the toilet twice since bedtime last night already... and didn't even try to make it once... *blush*$9#$e#*sigh* She'd probably believe me if I \"borrowed\" \"your\" diapers as a \"one-time precaution\" for this food poisoning... but I don't wanna lie to Mom on her birthday.$2",

  "winter_15": "Oh, hey! The night market's in town!#$b#I love the deep-sea tours, it's so creepy and quiet down there.$4#$e#...Just try not to stink up the cabin too bad if you go too, alright? It'll be a loooong, awkward ride back up. *chuckle*$1#$e#::125:give:space diaper:2::",

  "winter_24": "Happy Winter Star's Eve, @!$4#$e#Oh right! I was at Robin's place yesterday, she asked me to give this to you.[220]#$b#I maaaay have stolen a bite. *giggle*$1",

  "winter_28": "The year is almost over. I'm kinda dreading the slow, sunny months.$9#$b#...But I'll be sharing them with you. So, it won't be that bad.$4",


//5% chance each day.

//---ADD WET ACCIDENT TRIGGER TO THIS LINE:
  "spring_Abigail": "*sigh* Bored, bored, bored...$6#$b#%...Abigail looks your way, and smiles dangerously.#$e#%Before you have time to escape, she catches you in a hold and tickles your tummy mercilessly. [TRIGGER]#$b#%...Your bladder gives up long before she does.#$e#*giggle* Not so bored now.",

//---ADD COOLDOWN TRIGGERS TO THIS LINE:
  "summer_Abigail": "I think there's a stinkbug in the house. They come out this time of year...$3#$e#%You briefly search for the elusive insect, but then Abigail giggles and tugs out her waistband. You're hit by the stench.#$b#Gotcha! The stinkbug is me! *giggle*$1 [TRIGGER]",

  "fall_Abigail": "I went out for a walk in the woods before sunrise.#$e#It was all hazy and eerie... I heard so many cool weird creepy noises out there!#$b#I got that fluttery feeling in my guts every time it happened, like right before you go down a big rollercoaster... It was the best.$4",

//---ADD COOLDOWN TRIGGERS TO THIS LINE:
  "winter_Abigail": "%Abigail clings onto you.#$b#Gimme a hug, @. I'm cold.$4#$b#$y '...I'm not letting go until you do it._(Give her a gentle hug)_Mmm. You're like a space-heater, @.$4*...Must be your super-speedy metabolism at work again.$1_(Squeeze her in a big tight bear-hug)_%Abigail gasps in surprise as soon as her feet come off the ground. Then, you hear a loud squelchy explosion and a long muffled hiss.*Those... were underpants, @.$4*Ah, whatever, you made your choice, now you're the one who's gotta put up with me being all stinky -- 'cuz this pair's not coming off while it's warm!$1 [TRIGGER]'",
			},
		},

		{
			"LogName":"Abigail Mines Dialogue",
			"Action":"EditData",
			"Target":"Strings/Characters",
			"Entries":{
  "AbigailInMineFlute": "%Abigail is lost in her music...#$b#%...Maybe a bit too lost. Pee-yew!",
  "AbigailInMineFirst": "Hey, @. Surprised? ...I finally found the courage to come down here.#$b#I felt scared at first, but I pushed through!#$b#I feel much more confident now. This is actually really fun!$1",
  "AbigailInMine0": "%Abigail looks to be taking a short rest in this safe-zone.#$b#%...Her thumb has found its way into her mouth in her sleep, and her backside is quite visibly cushioned... by more than just padding.#$e#%You decide not to wake her up yet. She looks like she's having a good dream.",
  "AbigailInMine1": "Eep!$7#$b#Hahah! You scared me! I didn't expect to see another person down here!$1#$e#You're lucky I just went potty a couple floors ago, you big meanie.#$b#I would've made you change me if you'd done that when I still had a full tank!$1",
  "AbigailInMine2": "Hi, @! I managed to sneak down this far without running into any monsters.",
  "AbigailInMine3": "Hey! It's a relief to see you down here...#$e#Oh, do you need a change? I think I might be almost out.$9#$b#...Unless you'd take fill-me-downs? *giggle*$1",
  "AbigailInMine4": "Hey! Exploring the mines on a rainy day, huh? Me too!$1",
			},
		},


		{
			"LogName":"Abigail 2 heart cutscene",
			"Action":"EditData",
			"Target":"Data/Events/SeedShop",
			"Entries":{
  "1/f Abigail 500/p Abigail/d Sat": "none/-9999 -4/farmer 14 14 0 Abigail 3 6 2/skippable/showFrame Abigail 20/specificTemporarySprite abbyvideoscreen/viewport 9 4 true/pause 1000/playSound Cowboy_gunshot/pause 150/emote Abigail 52/pause 800/playSound Cowboy_gunshot/pause 150/playSound Cowboy_gunshot/pause 150/playSound Cowboy_gunshot/temporarySprite 2 4 27 8 50/shake Abigail 500/pause 150/playSound Cowboy_gunshot/pause 150/temporarySprite 4 4 27 8 50 true/playSound Cowboy_gunshot/pause 450/playSound Cowboy_monsterDie/pause 550/playSound Cowboy_gunshot/shake Abigail 400/textAboveHead Abigail \"C-C'mon... Just a bit longer..!\"/pause 150/playSound Cowboy_gunshot/pause 150/playSound Cowboy_monsterDie/pause 300/playsound Cowboy_gunshot/pause 500/playsound Cowboy_gunshot/pause 1750/shake Abigail 400/pause 200/emote Abigail 16/showframe Abigail 21/pause 80/showframe Abigail 22/pause 100/shake Abigail 1250/playsound wateringCan/pause 250/playsound slosh/pause 400/playsound wateringCan/pause 750/playSound cowboy_dead/pause 1500/textAboveHead Abigail \"...Ugh, really?! Stupid game...\"/pause 3500/emote Abigail 40/pause 550/showframe Abigail 21/pause 80/showframe Abigail 20/pause 50/playsound snowyStep/pause 750/move farmer 0 -2 3/move farmer -1 0 0/pause 200/doaction 13 11/pause 300/move farmer 0 -6 3 true/pause 200/emote Abigail 8/pause 1000/playMusic distantBanjo/pause 350/showFrame Abigail 21/pause 100/showFrame Abigail 22/pause 100/move farmer -1 0 3/move farmer -3 0 3 true/faceDirection Abigail 1/pause 200/emote Abigail 16/pause 600/speak Abigail \"@?\"/pause 300/move farmer -3 0 3/speak Abigail \"You scared me, sneaking into my room like that.\"/pause 500/faceDirection Abigail 0/pause 650/speak Abigail \"*sigh* I've been playing 'Journey of the Prairie King' for hours, and I can't even beat the first level...$s#$b#This game is ridiculously hard!$a#$b#Well, either that or I'm just terrible at it.$s\"/faceDirection Abigail 1/pause 1000/emote Abigail 16/pause 300/speak Abigail \"Hey, do you wanna try this level together with me? I think I might do better with your help.$9\"/faceDirection farmer 3/farmerAnimation 97/pause 1000/move farmer 0 1 3/move farmer -4 0 0 true/faceDirection Abigail 2/move farmer 0 -1 0/facedirection Abigail 3 continue/faceDirection farmer 0 continue/pause 450/faceDirection Abigail 0/pause 450/showframe Abigail 22/pause 100/showframe Abigail 21/pause 100/showframe Abigail 20/pause 80/playsound snowyStep/pause 80/playsound dirtyHit/pause 750/emote farmer 8/speak Abigail \"...Huh? N-Nope! I didn't hear anything!$9#$b#...Probably just the cushion shifting or something!$1#$b#...Alright, come on! Quit stalling, or I'll start without you!$4\"/pause 450/showframe 63/pause 100/showframe 62/playSound pickUpItem/pause 100/showframe 63/pause 450/emote farmer 52/pause 450/playSound select/pause 500/playSound select/pause 350/playsound cowboy_powerup/pause 80/speak Abigail \"Hehe, yeah! Let's do this!!$1\"/pause 250/globalFade/cutscene AbigailGame/stopMusic/pause 500/faceDirection Abigail 3/faceDirection farmer 1/fork beatGame/pause 100/playMusic distantBanjo/pause 600/emote Abigail 28/pause 400/speak Abigail \"Ugh! Alright, I give up. No way I'm getting past this level today...$s#$b#Thanks for trying, though.\"/faceDirection farmer 2/showFrame 96/emote farmer 40/pause 400/speak Abigail \"Um... hey, @? Would you mind stepping out of my room for a bit?#$b#I just gotta... do something real quick!$9#$b#Let's hang out again later, okay?$1\"/faceDirection farmer 1/pause 450/emote farmer 56/pause 450/move farmer 0 1 1/move farmer 11 0 2 true/faceDirection Abigail 2/pause 450/faceDirection Abigail 1/pause 2000/faceDirection Abigail 2/pause 250/animate Abigail false true 100 28 29/pause 600/stopAnimation Abigail/pause 800/textAboveHead Abigail \"...Phew...\"/move farmer 0 5 1 true/pause 1000/globalFade/viewport -4000 0/pause 100/end",

  "beatGame": "playMusic jaunty/pause 100/speak Abigail \"Hey, that was fun!$h#$b#Well thanks, @. You seem to really know your way around a joystick, huh? I guess that makes sense. $h^Thanks, @. I didn't think you'd know how to work a joystick so well! But it seems you're experienced.$h\"/pause 200/emote Abigail 32/pause 400/speak Abigail \"Oh! Right, Um... would you mind stepping out of my room for a sec?#$b#I just gotta... do something real quick.$9#$b#But if you want, we can hang out more after I'm done!\"/faceDirection farmer 1/pause 450/emote farmer 56/pause 450/move farmer 0 1 1/move farmer 11 0 2 true/faceDirection Abigail 2/pause 450/faceDirection Abigail 1/pause 2000/faceDirection Abigail 2/pause 250/animate Abigail false true 100 28 29/pause 600/stopAnimation Abigail/pause 800/textAboveHead Abigail \"...Phew...\"/move farmer 0 5 1 true/pause 1000/globalFade/viewport -4000 0/pause 100/end",
			},
		},
		{
			"LogName":"Abigail 4 heart cutscene",
			"Action":"EditData",
			"Target":"Data/Events/Mountain",
			"Entries":{

  "2/f Abigail 1000/w rainy/t 1200 1900/z winter": "AbigailFlute/-1000 -1000/farmer 34 32 1 Abigail 47 31 2/skippable/ambientLight 160 140 10/specificTemporarySprite abbyAtLake/animate Abigail false true 612 16 17 18 19/viewport 46 31 clamp true/pause 17900/move farmer 13 0 0/stopMusic/playMusic rain/pause 500/stopAnimation Abigail/faceDirection Abigail 2/emote Abigail 16/speak Abigail \"$q 32 null#@! Why are you out here in the rain?$7#$r 32 0 Event_Rain_1#Just doing some work#$r 32 50 Event_Rain_2#Enjoying the weather#$r 32 10 Event_Rain_3#I could ask you the same question\"/faceDirection Abigail 1/pause 1250/speak Abigail \"...I came here to spend some time alone.$8\"/pause 1000/faceDirection farmer 1/pause 1600/faceDirection Abigail 2/speak Abigail \"But I don't mind your company!\"/pause 500/emote Abigail 40/speak Abigail \"You're getting soaked. Come stand under the tree.\"/move farmer -1 0 0/move farmer 0 -1 2/pause 1500/emote farmer 4/faceDirection Abigail 3/pause 500/emote Abigail 8/pause 300/startJittering/pause 800/playSound wateringCan/pause 200/playsound wateringCan/pause 400/stopJittering/pause 650/speak Abigail \"...Oh. *giggle*$1\"/pause 100/emote farmer 28/pause 850/speak Abigail \"Well, I guess it won't keep you dry after all.\"/pause 500/faceDirection Abigail 2/pause 500/speak Abigail \"Oh well.\"/faceDirection Abigail 1/pause 2500/speak Abigail \"*sigh*... It's impossible to describe this feeling... watching the curtains of rain whisper above a silent lake...$8\"/pause 650/faceDirection farmer 1/pause 500/faceDirection farmer 2/pause 600/playSound dwop/showFrame 98/pause 500/faceDirection Abigail 3/emote Abigail 16/pause 800/speak Abigail \"Hey! A mini-harp!$h#$b#Heh, I didn't know you could play. You're full of surprises, @.\"/pause 500/speak Abigail \"Alright, how about this...$9#$b#If you can keep up with me, I... might have a change for you.#$b#::126:change:lavender pullup:1::\"/faceDirection farmer 1/pause 900/emote farmer 56/faceDirection Abigail 3/pause 700/faceDirection Abigail 2/faceDirection farmer 2/pause 500/showFrame Abigail 16/pause 500/showFrame 98/pause 2000/playMusic AbigailFluteDuet/pause 1250/animate Abigail false true 612 16 17 18 19/animate farmer false true 308 99 98 98 99 100 100/pause 10000/viewport move 1 0 18000/pause 20000/globalFade/viewport -1000 -1000/pause 500/speak Abigail \"%As soon as you finished playing together, Abigail surprisingly stayed true to her word, giving you a slightly crumpled pull-up she'd been keeping hidden in her backpack.\"/pause 2400/end",
			},
		},
		{
			"LogName":"Abigail 10 heart cutscene",
			"Action":"EditData",
			"Target":"Data/Events/Mine",
			"Entries":{

  "901756/f Abigail 2500/t 1700 2400/o Abigail": "Upper_Ambient/18 7/farmer -1000 -1000 0 Abigail 18 11 0/skippable/move Abigail 0 -3 1/move Abigail 5 0 2/pause 500/animate Abigail false false 150 26 24 25 25 25 25/pause 450/playSound sandyStep/stopAnimation Abigail/showFrame Abigail 25/pause 2000/playSound batFlap/pause 500/playSound batFlap/pause 500/playSound batFlap/pause 500/emote Abigail 8/pause 1000/specificTemporarySprite abbyOneBat/playSound batScreech/showFrame Abigail 32/shake Abigail 2000/pause 200/playSound wateringCan/pause 1800/showFrame Abigail 0/pause 600/emote Abigail 40/pause 500/animate Abigail false true 100 28 29/pause 1200/stopAnimation Abigail/pause 1000/specificTemporarySprite abbyManyBats/showFrame Abigail 32/shake Abigail 2000/pause 1650/playSound squid_hit/pause 200/playSound slimeHit/pause 250/playsound slimedead/pause 150/speed Abigail 8/move Abigail 0 -4 0/speed Abigail 8/move Abigail 2 0 0/animate Abigail false false 100 21 20/pause 200/showFrame Abigail 20/shake Abigail 10000/pause 300/playSound wateringCan/pause 150/playSound slosh/pause 450/playSound slimedead/pause 1200/warp farmer 18 13/move farmer 0 -5 0/pause 500/faceDirection farmer 1/pause 300/emote farmer 16/speed farmer 8/move farmer 6 0 0/speed farmer 8/playMusic desolate/move farmer 0 -4 1/speak Abigail \"$q 776589 null#*sniffle* *sob*$s#$r 776589 20 Event_Cave2_1#What happened?#$r 776589 40 Event_Cave2_2#Are you okay?\"/pause 500/animate Abigail false false 100 21 22/pause 200/stopAnimation Abigail 22/pause 750/faceDirection Abigail 1/pause 500/emote Abigail 60/speak Abigail \"Oh, god, I'm a mess... *hic*$2\"/pause 1500/faceDirection Abigail 3/pause 500/emote Abigail 28/speak Abigail \"I... I've been practicing my swordsmanship for a while...$9#$b#And... I decided today would be the day I finally went into the caves...$8\"/pause 500/faceDirection Abigail 2/showFrame Abigail 26/shake Abigail 850/pause 1000/speak Abigail \"B-but... now that I'm actually here... I'm scared. I can't do it.$2\"/pause 1500/animate Abigail false false 100 26 24 27 25/pause 400/playsound slimeHit/stopAnimation Abigail 25/pause 250/shake Abigail 500/pause 800/emote Abigail 28/pause 400/animate Abigail false true 500 24 27/speak Abigail \"$q 34 null#Maybe I'm not as tough as I thought...$2#$r 34 20 Event_Cave_1#You're safe with me.#$r 34 40 Event_Cave_2#I get scared too! You don't have to be fearless to be brave.#$r 34 20 Event_Cave_3#Aww... you're crying like a little baby.\"/stopMusic/stopAnimation Abigail 53/pause 1500/playMusic sadpiano/animate Abigail false false 100 25 24 26 0 0/pause 500/stopAnimation Abigail 0/pause 400/faceDirection Abigail 3/pause 250/speak Abigail \"...@? I... I really like you... And not just as a friend. You know that, right?$8\"/pause 1000/faceDirection Abigail 1/speak Abigail \"I can't believe I'm actually saying this, but... I can't keep it in anymore. I've felt this way for a long time.$4\"/pause 800/faceDirection Abigail 3/pause 800/speak Abigail \"You don't have to say anything right now... Let's just stay here for a while.$4^I didn't even know I felt this way about other girls until I met you...$4\"/playMusic Upper_Ambient/pause 2500/showFrame 101/pause 100/showFrame Abigail 33/pause 3000/showframe Abigail 12/faceDirection farmer 1/pause 250/emote Abigail 20/pause 500/speak Abigail \"...Wow. *giggle*$4\"/pause 1500/faceDirection Abigail 2/emote Abigail 40/pause 400/speak Abigail \"...Uhm... hey, @? Would now be a bad time to ask for a change..?$1\"/pause 250/emote farmer 32/pause 600/animate Abigail false true 100 28 29/pause 1000/speed farmer 2/move farmer 0 1 1/stopAnimation Abigail/move farmer 1 0 0/pause 1250/animate Abigail false false 150 0 26 24 25 24/pause 750/playSound dirtyHit/stopAnimation Abigail 24/pause 200/showframe 63/playSound dwop/pause 400/globalFade/viewport -1000 -1000/pause 250/playSound harvest/pause 250/playSound sipTea/pause 750/playSound harvest/pause 250/playSound sipTea/pause 2500/playSound dirtyHit/pause 500/speak Abigail \"G-Gah! C-Cold air!!$7#$b#.....$4#$b#...Well? H-Hurry up already!!! *giggle*$1\"/pause 500/playsound leafrustle/pause 1500/playSound snowyStep/pause 150/playsound snowyStep/pause 450/playSound cancel/pause 300/playSound cancel/pause 1250/playSound dirtyHit/pause 400/playsound sipTea/pause 250/playSound snowyStep/pause 550/playsound sipTea/pause 250/playSound snowyStep/pause 1000/playSound questcomplete/pause 1500/message \"...One VERY stinky diaper change (...and another dozen kisses) later...\"/pause 750/end",
			},
		},
	]
}