{
	"Jodi_Initial_Letter": [ "Dear @,^Welcome to town! Here are some veggies from the garden to tide you over while you move in. Your grandpa told me about your little problem, so I enclosed some supplies for you. Visit Pierre if you run out!^      <, Jodi" ],
	"Food_Low": [
		"You're hungry.",
		"Your stomach rumbles.",
		"You're thinking about eating food.",
		"You think about finding food.",
		"You need some food."
	],
	"Food_None": [
		"You're starving!",
		"All you can think about is food! Better eat!",
		"You're so hungry you can't think straight!"
	],
	"Water_Low": [
		"You're getting pretty thirsty.",
		"You could really use some water.",
		"You're thinking about getting a drink.",
		"You need a drink."
	],
	"Water_None": [
		"You're dehydrated!",
		"You're super thirsty! Get a drink right now!",
		"You're so thirsty you can't think straight!"
	],
	"Drink_Water_Source": [
		"You scoop up some water in a cup and drain it down."
	],
	"Bladder_Yellow": [
		"You need to pee.",
		"You should find somewhere to pee soon.",
		"You feel like you might pee soon.",
		"Your bladder is getting full."
	],
	"Bladder_Orange": [
		"You really need to pee!",
		"You're not sure how much longer you can hold your pee!",
		"If you don't pee soon, you'll have an accident!",
		"You start crossing your legs trying not to pee yourself!"
	],
	"Bladder_Red": [
		"You can’t hold it anymore! You're about to pee yourself!",
		"You let out a desperate little whine as your full bladder threatens to empty itself",
		"You have to pee so badly you start hopping around!",
		"You feel a few drops of pee leak out into your $UNDERWEAR_NAME$!"
	],
	"Bowels_Yellow": [
		"You need to poop.",
		"You should find somewhere to poop soon.",
		"You feel a rumble in your bowels.",
		"It might be time to poop."
	],
	"Bowels_Orange": [
		"You really need to poop!",
		"If you don't find a place to poop soon, you'll mess yourself!",
		"You're not sure how much longer you can hold your poop!"
	],
	"Bowels_Red": [
		"You can feel the poop starting to push out!",
		"You feel a lot of pressure in your backside! It feels like it's about to come out one way or another.",
		"You can’t hold it anymore! You're about to mess yourself!"
	],
	"Bladder_Continence_Yellow": [ "You seem to be getting worse at holding your pee." ],
	"Bladder_Continence_Orange": [ "...You're getting pretty bad at holding your pee." ],
	"Bladder_Continence_Red": [ "You're barely able to hold your pee now..." ],
	"Bladder_Continence_Min": [ "You don't think you can hold your pee anymore!" ],
	"Bowel_Continence_Yellow": [ "You seem to be getting worse at holding your poop." ],
	"Bowel_Continence_Orange": [ "...You're getting pretty bad at holding your poop." ],
	"Bowel_Continence_Red": [ "You're barely able to hold your poop now..." ],
	"Bowel_Continence_Min": [ "You don't think you could hold your poop anymore!"         ],
	"Pee_Voluntary": [
		"You drop your $UNDERWEAR_NAME$ and pee on the ground.",
		"Moving your $UNDERWEAR_NAME$, you take a deep breath and empty your bladder.",
		"Looking around sheepishly, you pull your $UNDERWEAR_NAME$ down and go right where you are!",
		"You slide your $PANTS_NAME$ to your knees</, squat,> and let your pee splatter all over the ground.",
		"You pull down your $PANTS_NAME$ and sprinkle on the ground.",
		"You pull your $PANTS_NAME$ down and go <pee pee/tinkle> on the ground.",
		"You slide your $PANTS_NAME$ down, <spread your legs/squat down>, and empty your bladder."
	],
	"Poop_Voluntary": [
		"You slide your $PANTS_NAME$ down, squat, and empty your bowels.",
		"Looking around nervously, you pull your $PANTS_NAME$ down and go number two right on the ground!",
		"Undressing, you squat and let your poop pile out onto the ground.",
		"You pull down your $PANTS_NAME$ and poop on the ground.",
		"You slide your $PANTS_NAME$ to your knees, squat down, and gently push all your poop out."
	],
	"Pee_Toilet": [
		"Sprinkling into the toilet, you breathe a sigh of relief.",
		"You pee in the potty like a big <boy/girl>.",
		"You slide your $PANTS_NAME$ down, <stand in front of the toilet/sit on the toilet>, and pee like a big <boy/girl>.",
		"You barely make it to the toilet. Any longer and you might have wet yourself!",
		"You wee in the toilet. Good thing you were able to hold it until then!",
		"You proudly pee in the toilet. Now you won't need a diaper!",
		"You tinkle in the toilet. Your mommy would be proud!",
		"You undress and go number one in the toilet like a good <boy/girl>."
	],
	"Poop_Toilet": [
		"As your poop slides out into the toilet, you start to relax. Whew, that felt good!",
		"You slide your $PANTS_NAME$ to your knees, sit on the toilet, and poop like a big <boy/girl>.",
		"You poop in the potty like a big <boy/girl>.",
		"You poop in the toilet. Maybe now you won't mess yourself today!",
		"You slide your $PANTS_NAME$ to your knees and poop in the toilet.",
		"You proudly poop in the toilet. Now you won't need a diaper!",
		"You poop in the toilet. Your mommy would be proud!",
		"You undress and go number two in the toilet like a good <boy/girl>."
	],
	"Pee_Toilet_Attempt": [
		"You try to pee in the potty like a big <boy/girl>, but nothing comes out.",
		"You slide your $PANTS_NAME$ down, <spread your legs/sit on the toilet>, and try to pee, but you can't."
	],
	"Poop_Toilet_Attempt": [
		"You squirm a little as you try to poop in the toilet, but nothing comes out.",
		"You try to poop in the potty like a big <boy/girl>, but you can't.",
		"You slide your $PANTS_NAME$ to your knees, sit on the toilet, and strain to poop, but nothing comes out."
	],
	"Wet_Voluntary": [
		"You relax your bladder and pee gushes into your $UNDERWEAR_NAME$.",
		"Your bladder tingles as you let go and warmth spreads out into your $UNDERWEAR_NAME$.",
		"You take a deep breath and release your pee into your $UNDERWEAR_NAME$.",
		"You glance around a little sheepishly as you deliberately pee your $UNDERWEAR_NAME$ like a little <boy/girl>.",
		"You press your hands to your crotch, feeling the warmth as the sudden flood of pee comes rushing out.",
		"You feel a blush start coming on as you focus really hard on making your $UNDERWEAR_NAME$ nice and soggy.",
		"You don't wanna walk all the way to a potty, so you just pee in your $UNDERWEAR_NAME$ like a little baby.",
		"You close your eyes and relax until you can finally feel yourself wetting your $UNDERWEAR_NAME$.",
		"You feel a warmth spreading at your crotch. What a soggy little <boy/girl> you are!",
		"Your cheeks warm a little bit as you decide to just skip the trip to the potty and wet yourself instead.",
		"You give your bladder a little extra push, and soon enough the pee starts to flow into your $UNDERWEAR_NAME$."
	],
	"Mess_Voluntary": [
		"You squat a little and empty your bowels into your $UNDERWEAR_NAME$.",
		"You concentrate and push a warm load of poo into your $UNDERWEAR_NAME$.",
		"You hope nobody notices as you deliberately let a big poop squeeze out into your $UNDERWEAR_NAME$.",
		"You push on the back of your $UNDERWEAR_NAME$ as <it#they> <bulges#bulge>, giggling as it squishes around.",
		"You squat down and go potty, but \"forget\" to pull your $PANTS_NAME$ down first. Heehee... Oopsies!",
		"Your tummy feels achey and full, so you decide to push the bad feeling right out into your $UNDERWEAR_NAME$... Ahhh, all better!",
		"You feel yourself make a potty-face as you start to fill up your $UNDERWEAR_NAME$ on purpose.",
		"You puff your cheeks and push hard. Looks like you're a little potty-pants now, aren't you?",
		"You close your eyes, and hope nobody is looking as you lean forwards and fill your $UNDERWEAR_NAME$.",
		"Your $UNDERWEAR_NAME$ <seems#seem> like a perfectly suitable toilet right now. Hopefully nobody minds the smell...",
		"You blush deeply as you choose to poop your $UNDERWEAR_NAME$ right here instead of finding a potty.",
		"Your tushy is all mushy now! ...Well? Isn't this what <a #>$UNDERWEAR_NAME$ <is#are> for?",
	],
	"Pee_Attempt": [
		"You pull down your $PANTS_NAME$ and relax your bladder, but nothing comes out.",
		"You slide your $PANTS_NAME$ down, <spread your legs/squat down>, and try to pee, but you can't."
	],
	"Poop_Attempt": [
		"You pull down your $PANTS_NAME$ and try to poop, but you can't.",
		"You slide your $PANTS_NAME$ to your knees, squat down, and strain to poop, but nothing comes out."
	],
	"Wet_Attempt": [
		"You relax your bladder, but nothing comes out.",
		"You try to pee in your $UNDERWEAR_NAME$, but you can't."
	],
	"Mess_Attempt": [
		"You squat a little and strain, but nothing comes out.",
		"You try to poop your $UNDERWEAR_NAME$, but you can't."
	],
	"Still_Soiled": [
		"You feel your <wet&messy> $UNDERWEAR_NAME$ and blush at the sensation.",
		"You feel like a little <boy/girl> knowing that you're still in $UNDERWEAR_PREFIX$ <wet&messy> $UNDERWEAR_NAME$.",
		"You blush and smile warmly realizing you're wearing $UNDERWEAR_PREFIX$ <wet&poopy> $UNDERWEAR_NAME$.",
		"You smell something stinky and your heart flutters as you realize you're still wearing $UNDERWEAR_PREFIX$ <wet&messy> $UNDERWEAR_NAME$.",
		"You feel your <wet&poopy> $UNDERWEAR_NAME$ squishing between your legs and smile to yourself.",
		"You notice your sagging <wet&messy> $UNDERWEAR_NAME$ <is#are> snug and warm.",
		"You notice you're waddling because your $UNDERWEAR_NAME$ <is#are> <wet&messy>.",
		"You consider changing your <wet&messy> $UNDERWEAR_NAME$ soon, but not right now. It's still warm.",
		"You press your hand into your squishy $UNDERWEAR_NAME$. You feel like a little baby knowing you <wet&messed> <it#them>.",
		"You feel your $UNDERWEAR_NAME$. <It's#They're> all <wet&messy>!",
		"Your $UNDERWEAR_NAME$ <is#are> sagging, so you grab <the#their> waistband, and pull <it#them> back up... <Oh! It's nice and warm!&Oh! It's... very smushy back there.>",
		"You feel a little cozier walking around with some extra <warmth&weight> in your $UNDERWEAR_NAME$.",
		"You hope nobody can tell that you're walking around in <a #><soaked&loaded> $UNDERWEAR_NAME$...",
		"You can't help but give the <front&back> of your $PANTS_NAME$ a little smoosh when you think nobody's looking."
	],
	"Wet_Accident": [
		"You bite your lip and take a sharp breath through your nose as your bladder gives in and you flood your $UNDERWEAR_NAME$.",
		"You're helpless as pee streams into your $UNDERWEAR_NAME$.",
		"You hope no one notices the pee pouring into your $UNDERWEAR_NAME$.",
		"Your thumb finds its way into your mouth as you suddenly feel warmth spreading into your $UNDERWEAR_NAME$!",
		"You hope your $UNDERWEAR_NAME$ doesn't leak as you realize you're wetting yourself.",
		"You stop in your tracks as you start to go <wee/tinkle> in your $UNDERWEAR_NAME$!",
		"You give a sheepish smile as you realize the warmth spreading into your crotch is pee!",
		"You <gasp/squeal> when you realize you're suddenly wetting yourself!",
		"With a faint hiss, warmth floods into your $UNDERWEAR_NAME$!",
		"You press your hands to your crotch, feeling the warmth as the sudden flood of pee comes rushing out.",
		"You're wetting your $UNDERWEAR_NAME$ like a little <boy/girl>!",
		"You give up trying to hold it any longer and your pee gushes out, flooding your $UNDERWEAR_NAME$.",
		"You can't help but relax and let your pee spurt into your $UNDERWEAR_NAME$.",
		"Oopsies! You're wetting yourself!",
		"You're wetting your $UNDERWEAR_NAME$! Oh well.",
		"You notice a growing warmth, before glancing down and realizing you're peeing in your $UNDERWEAR_NAME$.",
		"Your $UNDERWEAR_NAME$ <sags#sag> as you wet yourself. Your cheeks flush as you realize you're just a little <boy/girl>.",
		"Uh-oh, your bladder couldn't hold it any longer! Your face and your $UNDERWEAR_NAME$ both feel a lot warmer now...",
		"You awkwardly stand very still as you drench your $UNDERWEAR_NAME$.",
		"You feel it coming and let out a little whine, but you can't stop yourself from peeing in your $UNDERWEAR_NAME$.",
		"You desperately try to cross your legs, but it's too late! Your $UNDERWEAR_NAME$ <gets#get> soaked!"
	],
	"Mess_Accident": [
		"Your knees bend and your body moves on its own as you find yourself pushing a warm load into the seat of your $UNDERWEAR_NAME$.",
		"You realize you're suddenly filling the back of your $UNDERWEAR_NAME$! You heft your seat with a slight blush as your warm, soft muck squishes against you.",
		"You sigh with relief and grin bashfully as the distinctive smell of poop begins to waft from your $UNDERWEAR_NAME$.",
		"You bashfully cover your face as you fill your $UNDERWEAR_NAME$ with warm poop. After you're done, you realize your thumb found it's way into your mouth",
		"With a faint crackling sound, your poop squeezes out into your $UNDERWEAR_NAME$.",
		"You start squirming and push a heavy load of poop into your $UNDERWEAR_NAME$.",
		"You're almost startled as you notice it. You're pooping yourself!",
		"You can't hold your poop any more, so you let it all out into your $UNDERWEAR_NAME$.",
		"You finally give in, and a heavy load of warm poop pushes into your $UNDERWEAR_NAME$.",
		"You freeze up and look around sheepishly as your poop squishes out into your $UNDERWEAR_NAME$.",
		"Oh!!! You're pooping in your $PANTS_NAME$!!",
		"You feel a warm mass spreading into your $UNDERWEAR_NAME$, and feel like a little <boy/girl> again.",
		"You push on the back of your $UNDERWEAR_NAME$ as <it#they> <bulges#bulge>, giggling as it squishes around.",
		"Oopsies! Your $UNDERWEAR_NAME$ <is#are> all messy now!",
		"You don't even try to stop it. You're messing yourself!",
		"Hmm..? Feels like there's something slimy and warm in your $UNDERWEAR_NAME$ suddenly...",
		"Your $UNDERWEAR_NAME$ <bulges#bulge> as you openly mess yourself.",
		"You give up trying to hold it, and sigh in relief as you mess your $UNDERWEAR_NAME$!",
		"Your face scrunches up and your cheeks puff out, as you fail to stop yourself from messing your $UNDERWEAR_NAME$.",
		"Your tummy starts pushing all on its own. Looks like someone should've gone potty earlier!",
		"You expected gas, but soft poop rushes out into your $UNDERWEAR_NAME$ instead!",
		"You barely have time to squat before the seat of your $UNDERWEAR_NAME$ starts feeling all warm and mushy.",
		"You try to stop pooping after the first log comes out, but it's like a cork popping! Your $UNDERWEAR_NAME$ <feels#feel> a lot heavier now..."
	],
	"Toilet_Night": [
		"You had to <pee&poop> last night, and made it to the toilet$HOW_MANY_TIMES",
		"You woke up to <pee&poop> in the potty like a big <boy/girl> last night$HOW_MANY_TIMES"
	],
	"Wake_Up_Underwear_State": [
		"You wake up in $INSPECT_UNDERWEAR_NAME$."
	],
	"Wet_Bed": [
		"You find that you leaked last night--your bed is all wet!",
		"Your bed is cold and wet. You must have wet the bed last night!",
		"You wet your bed like a little <boy/girl> last night!",
		"You wake up uncomfortable, lying in a puddle of cold pee.",
		"Your covers are all wet. You need a diaper like a little <boy/girl>!",
		"Your pajamas are uncomfortable and wet. You realize you wet the bed last night!"
	],
	"Messed_Bed": [
		"Starting to cry, you realize that you pooped< and peed> the bed like a baby!",
		"Somebody needs a diaper! You <wet and >messed your bed last night!",
		"Your cheeks burn when you discover that your bed is all <wet and >poopy!",
		"You are humiliated to realize that you pooped< and peed> in your bed while you were sleeping!",
		"Your <pee and >poop overflowed into your bed last night!",
		"You realize you must have <wet and >messed your bed last night! Oh no!",
		"You smell something stinky and realize you <wet and >messed the bed last night!"
	],
	"Spot_Washing_Bedding": [
		"You take your <wet&poopy> bedding to the river and rinse the <wet&poopy> part, but it was tiring and your bedding probably won't be dry until $BEDDING_DRYTIME$."
	],
	"Washing_Bedding": [
		"You take your <wet&poopy> bedding to the river and wash it, but it was exhausting and your bedding probably won't be dry until $BEDDING_DRYTIME$."
	],
	"Washing_Underwear": [
		"You wash your $UNDERWEAR_NAME$ in the water. <It#They> will be dry tomorrow."
	],
	"Overwashed_Underwear": [
		"You wash your $UNDERWEAR_NAME$ in the water. <It#They> <was#were> too worn out and fell apart!"
	],
	"Bedding_Still_Wet": [
		"Your bedding won't be dry until $BEDDING_DRYTIME$!"
	],
	"Cant_Remove": [
		"You try to pull down your $UNDERWEAR_NAME$, but you can't get it off without ruining it. Maybe you should change into something else? Or you could just use it..."
	],
	"Pee_Overflow": [
		"Your $UNDERWEAR_NAME$ leaked! Your pants are all wet!",
		"You start crying as you feel pee dribbling down your legs!",
		"You turn red as you realize your pee is running down your legs!",
		"You notice a wet spot growing on your $PANTS_NAME$, and realize your $UNDERWEAR_NAME$ leaked!",
		"Your $UNDERWEAR_NAME$ couldn't hold the pee and it leaked out into your $PANTS_NAME$!",
		"Your $UNDERWEAR_NAME$ <is#are> overflowing! You're leaking into your pants.",
		"Uh-oh! Your $UNDERWEAR_NAME$ can't absorb any more! You feel pee dribbling down into your shoes. Eww...",
		"You realize, too late, that your waterlogged $UNDERWEAR_NAME$ <isn't#aren't> absorbing any more. Oh dear..."
	],
	"Poop_Overflow": [
		"Your $UNDERWEAR_NAME$ blew out! Your pants are all poopy!",
		"Turning bright red, you realize you had a blowout in your $UNDERWEAR_NAME$!",
		"Your cheeks burn with shame when you discover your poop overflowed out into your $PANTS_NAME$.",
		"You smell something really stinky and realize your poop overflowed into your $PANTS_NAME$!",
		"You start crying as you feel a big log of poop squish out past your $UNDERWEAR_NAME$ and smear down your legs!",
		"Oh no! Your $UNDERWEAR_NAME$ couldn't hold the poop and it came out into your $PANTS_NAME$!",
		"Your poop is starting to spill out of your $UNDERWEAR_NAME$, and get all over the inside of your $PANTS_NAME$! You really hope it washes out...",
		"Your $UNDERWEAR_NAME$ <is#are> too full to hold any more poop! You try to fight the tears as your stinky mess squishes up your back."
	],
	"Debuff_Wet_Pants": [
		"Your pants are wet!",
		"You wet your pants!",
		"You peed your pants!"
	],
	"Debuff_Messy_Pants": [
		"Your pants are messy!",
		"Your pants are poopy!",
		"You messed your pants!"
	],
	//																																																										
	"Villager_Reactions": {
		"adult": {
			//Use your diaper near them
			"soiled_verynice": [
				"%You think you might be disappointed that nobody noticed you <wet&filled> your $UNDERWEAR_NAME$."
			],
			"soiled_nice": [
				"%You almost wish someone noticed that you're <wetting&filling> your $UNDERWEAR_NAME$, but it's for the best no one did."
			],
			"soiled_mean": [
				"%You're thankful nobody noticed that you're <wetting&filling> your $UNDERWEAR_NAME$."
			],
			//You check them
			"check_verynice": [
				"%You take a peek when you think nobody is looking, just in case the grown-ups have started wearing diapers behind your back...#$b#%...It could totally happen! ...Maybe!#$b#%...But it hasn't."
			],
			"check_nice": [
				"%You don't see the telltale puffy bulge of a diaper...#$b#%But you suppose that makes sense. This is a grown-up, after all..."
			],
			"check_mean": [
				"...Hm? What do you think you're looking at?$u"
			],
			"cooldown_check": [
				"%You're pretty sure that nothing has changed since you last checked."
			],
			//They check you
			"soiled_change_verynice": [
				"Oh, poor thing. That doesn't look comfortable at all.#$b#Well, it's a good thing I carry a few of these for you, just in case.$1#$b#::104:change:baby print diaper:1::"
			],
			"change_verynice": [
				"<That#Those> $UNDERWEAR_NAME$ <looks#look> just fine to me. Did you just want my attention?$1"
			],
			"soiled_change_nice": [
				"Oh dear...$3#$b#...I'm sorry, I don't have anything you can change into.$2"
			],
			"change_nice": [
				"...<That#Those> $UNDERWEAR_NAME$ <looks#look> clean to me. Did you just want my attention?"
			],
			"soiled_change_mean": [
				"Oh, that's gross... You should go change.$2"
			],
			"change_mean": [
				"Didn't your parents ever teach you basic privacy..?$3"
			],
			//Ground
			"ground": [
				"%You hope no one noticed the little <puddle&pile> you left on the ground."
			],
			"ground_attempt": [
				"%You don't think anyone noticed you trying to go on the ground."
			]
		},
		//																																																									
		"teen": {
			//Use your diaper near them
			"soiled_verynice": [
				"%You think you might be disappointed that nobody noticed you <wet&filled> your $UNDERWEAR_NAME$."
			],
			"soiled_nice": [
				"%You almost wish someone noticed that you're <wetting&filling> your $UNDERWEAR_NAME$, but it's for the best no one did."
			],
			"soiled_mean": [
				"%You're thankful nobody noticed that you're <wetting&filling> your $UNDERWEAR_NAME$."
			],
			//You check them
			"check_verynice": [
				"Alright, alright, let's get it over with...$1#$b#%You give them a quick check, just to make absolutely sure they aren't wet or stinky... Yup, all clean here!#$b#Okay. Happy now? *chuckle*"
			],
			"check_nice": [
				"Um... @?"
			],
			"check_mean": [
				"Woah, back off!$a"
			],
			"cooldown_check": [
				"%You're pretty sure that nothing has changed since you last checked."
			],
			//They check you
			"soiled_change_verynice": [
				"Oof. Um, @? You should definitely change. It's... pretty visible.$1#$b#I'll cover for you, don't worry! *wink*"
			],
			"change_verynice": [
				"Cute $UNDERWEAR_NAME$, @.$1#$b#<It's#They're> dry, don't worry about it."
			],
			"soiled_change_nice": [
				"Sheesh, I can <see&smell> from here that you wrecked that thing...$u#$b#Go ahead and get cleaned up. You can use my room, if you need."
			],
			"change_nice": [
				"You don't smell.#$b#So, uh... As far as I'm willing to find out, you're... probably fine??"
			],
			"soiled_change_mean": [
				"Ew, you smell like <pee&crap>!$a#$b#Geez, did you go in your $PANTS_NAME$?! That's gross! Go change!$u"
			],
			"change_mean": [
				"What?! No, I won't check your pants, go bother someone else.$a"
			],
			//Ground
			"ground": [
				"%You hope no one noticed the little <puddle&pile> you left on the ground."
			],
			"ground_attempt": [
				"%You don't think anyone noticed you trying to go on the ground."
			]
		},
		//																																																								
		"kid": {
			//Use your diaper near them
			"soiled_verynice": [
				"%You're thankful nobody noticed that you're <wetting&filling> your $UNDERWEAR_NAME$."
			],
			"soiled_nice": [
				"%You're thankful nobody noticed that you're <wetting&filling> your $UNDERWEAR_NAME$."
			],
			"soiled_mean": [
				"%You're thankful nobody noticed that you're <wetting&filling> your $UNDERWEAR_NAME$."
			],
			//You check them
			"check_verynice": [
				"%You don't think anyone here still needs their diapers checked regularly.#$b#%...Well, nobody aside from yourself, that is."
			],
			"check_nice": [
				"%You don't think anybody here needs a diaper check."
			],
			"check_mean": [
				"%You don't think anybody here needs a diaper check...#$b#%But, if they do, it's probably better left to their mommy or daddy."
			],
			"cooldown_check": [
				"%You're pretty sure nothing's changed since the last time you checked."
			],
			//They check you
			"soiled_change_verynice": [
				"%You think about finding someone who can give you a diaper change..."
			],
			"change_verynice": [
				"%You think about finding someone who can check your diaper..."
			],
			"soiled_change_nice": [
				"%You think about finding someone who can give you a diaper change..."
			],
			"change_nice": [
				"%You think about finding someone who can check your diaper..."
			],
			"soiled_change_mean": [
				"%You think about finding someone who can give you a diaper change..."
			],
			"change_mean": [
				"%You think about finding someone who can check your diaper..."
			],
			//Ground
			"ground": [
				"%You hope no one noticed the little <puddle&pile> you left on the ground."
			],
			"ground_attempt": [
				"%You don't think anyone noticed you trying to go on the ground."
			]
		},
		//																																																								
		"animal": {
			"soiled_nice": [
				"...",
				"???"
			],
			"ground": [
				"<...&!!!>"
			],
			"ground_attempt": [
				"<...&???>"
			]
		},
		//																																																								
		"abigail": {
			//Use your diaper near them
			"soiled_verynice": [
				"Mm, four out of ten, I've done worse.$1",
				"Aw, couldn't hold it in, cutie? *giggle*$1",
				"Having fun there?$1",
				"Skipping a step or two, aren't we?$1",
				"Snuck up on you, huh? I know the feeling.$4",
				"...Are you challenging me? *smirk*",
				"%Abigail looks at you with a mischievous glint in her eye.#$b#...I wonder how long it would take Mayor Lewis to notice if somebody buried <that#those> in his flowerbox? *chuckle*$4",
				"I'm pretty sure farmers are supposed to <water&fertilize> their plants, @... <Looks&Smells> to me like you forgot the 'L'!$1",
				"All done '<watering&fertilizing>' your pants, @?$1",
				"Hmm, should I go tell one of the grown-ups you had an accident?#$b#Nawww, don't worry, I won't.$1",
				"Hey, you never gotta hold it in on my account. I promise I don't give a crap.<&#$b# ...But it sure smells like you did just now! *giggle*$1>"
			],
			"soiled_nice": [
				"Hmm, should I go tell one of the grown-ups you had an accident?#$b#Nawww, don't worry, I won't.$1",
				"Hey, you don't need to hold it on my account, I don't give a crap.<& ... Well, it seems like you might have.$1>",
				"Yeah, I get it. Bathrooms are overrated.",
				"I thought farmers were supposed to <water&fertilize> their 'plants'... <Looks&Smells> like you missed an 'L' there.",
				"You skipped a step or two there, buddy.",
				"I won't snitch on you, so you'd better not tattle on me, alright?"
			],
			"soiled_mean": [
				"Yeesh, dude - I can <hear you going&smell that> from here.$3",
				"I thought farmers were supposed to <water&fertilize> their 'plants'? Seems you might've missed an 'L'...$9",
				"If you <leak in&stink up> Dad's store, I'm not covering for you.$3"
			],
			//You check them
			"check_verynice": [
				"%Abigail gives you an impish smile and shows off her freshly packed diaper.#$b#You gonna do something about it, @?$4",
				"%You ask if Abigail's had an accident, and she giggles mischievously.#$b#Nope! But I did use my diaper a whole lot!$1#$b#...Why do you ask, @? You wanna change me that badly? *giggle*$1",
				"%Abigail drops a clean diaper next to you and crosses her arms.#$b#Change. Now.$5#$b#.........$5#$b#*sigh* .....Please? ...It's yucky and I really don't wanna have to do it myself...$2#$b#%You oblige, and quickly change a furiously-blushing Abigail.",
				"%You notice Abigail squirming, and suggest that maybe she should go to the bathroom.#$b#Hey, good idea, @!$1#$b#%Abigail scrunches her face up, and you hear a quiet mushy crackling.#$b#Hahh... So, you were saying?$4",
				"%You notice Abigail squirming, and offer to walk with her to the bathroom.#$b#Oh, didn't you know? There's actually one right here...#$b#%Abigail looks you straight in the eyes and smirks. You hear a loud hissing in her diaper.#$b#...Pretty convenient, huh?$4",
				"%You notice Abigail squirming, and ask if she wants to go to the potty.#$b#Hmm... Yeah, I think I will!$1#$b#%Abigail grins at you, and you realize a wet spot is blooming at the crotch of her dark jeans.#$b#...Hm? That wasn't what you meant? Maybe you gotta be more careful with your words, then! *giggle*$4",
				"Hmm? Change? Whatever could you mean, @?#$b#%Abigail smiles sweetly, and discreetly shows you a glimpse of her clean purple undies.",
				"Oh, @... you'd know if I needed a change.#$b#%Abigail winks, and gently tugs her waistband out to reveal a pair of purple big-girl undies.",
				"%You ask to check Abigail. She grins and tugs her waistband out to show you a pair of soggy purple undies.#$b#%...You tell her she should probably change.#$b#Yeah? Make me.",
				"%You ask to check Abigail. She grins and tugs her the back of her waistband out to show you a pair of messy purple underpants.#$b#%...You tell her she REALLY needs a change.#$b#*giggles* Yeah? Make me.$4"
			],
			"check_nice": [
				"%You tell Abigail that her diaper looks pretty full.#$b#Yeah? And? ...I'll change it when I wanna! You can't tell me what to do.$3",
				"%You tell Abigail that she should probably change her diaper soon.#$b#Oh yeah? Well maybe *you* should change *your* diaper soon!$3#$b#%...She crosses her arms and turns her head away in a pout.",
				"Well, you're not gonna make me change, so why even bother checking?",
				"Mmm... no. You can't tell me what to do.",
				"Tch. Back off, I'm dry.$3#$b#You wanna prove otherwise? Then come back with a warrant, diaper-cop!$5",
				"%You try to sneak a quick check when you think Abigail isn't paying attention...#$b#%...Oops. Looks like Abigail is actually wearing a pair of regular big-girl undies right now...#$b#%She grins smugly as you flush with embarassment.",
				"...Oh? Does it look like I'm wearing a diaper to you, @?#$b#%Abigail shifts her jacket aside, flaunting an obviously un-padded posterior."
			],
			"check_mean": [
				"What's under MY pants? None of your business, that's what!$5",
				"%She swats your hand away when you try to check her.#$b#Woah! Hands off the goods, dweeb!$5",
				"%You think you heard a faint crinkle under Abigail's jeans, and you ask her about it.#$b#What--that? That was just... a trail snack wrapper or something!$9"
			],
			"cooldown_check": [
				"%You're pretty sure things haven't changed since you last checked."
			],
			//They check you
			"soiled_change_verynice": [
				"%You ask Abigail for a change.#$b#*giggle* ...Aye-aye, cap'n.#$b#::123:change:space diaper:1::",
				"Well, I coooould change <it#them> for you... but I don't know if I wanna...#$b#$y 'Abigail sticks her tongue out at you_Please?_Fine, fine, if you're gonna look at me with those big sad puppy-dog eyes...*::101:change:space diaper:1::_Well, maybe I don't want you to!!_Oh? So, you're just showing off?*Well, then I give it a ten out of ten, little <buddy/cutie>.$1'",
				"%You ask Abigail for a change. She giggles mischievously.#$b#Let me consider it...#$b#...$9#$b#...Okay, maybe you deserve it this time.#$b#::122:change:space diaper:1::",
				"%You ask Abigail for a change. She giggles mischievously.#$b#Let me consider it...#$b#...$9#$b#...Mmmmmm, no. Try a little harder. *smirk*",
				"%Abigail smiles innocently when you ask for a change.#$b#Mmmmmm, nah, I'm pretty sure <that#those> <soggy&mushy> little $UNDERWEAR_NAME$ can wait a little while longer.",
				"You want a change?#$b#Hmmm, I dunno... What's in it for me?$9",
				"Are you suuuuure you need a change?$6#$b#...Well, if you're THAT desperate, you can use these! *giggle*$1#$b#::124:change:dinosaur undies:1::",
				"%Abigail takes a close look your <wet&messy> $UNDERWEAR_NAME$.#$b#$y 'Hmmm, does the little baby <boy/girl> really need a change? REALLY really?_Yes really!!!_%Abigail pretends to think about it for a long moment...*Hmmmm... Alright, you've convinced me!$1*::123:change:space diaper:1::_...N-no..._Oh, alright then. I guess I won't!$1*%Abigail giggles knowingly as she puts the diaper back in her bag._I'm not a baby!!_Oh? Because your $UNDERWEAR_NAME$ says otherwise...*But if you think you're such a big <boy/girl>, then how about you just TRY to keep these clean for the rest of the day?$1*::121:change:polka dot panties:1::'"
			],
			"change_verynice": [
				"Hehe, okay, fine. I'll admit, it's kinda cute when you gloat about being dry.$1",
				"%Abigail pokes your $UNDERWEAR_NAME$.#$b#Well... you're all clean, but this is fun too."
			],
			"soiled_change_nice": [
				"Um... so, I don't have any extras right now.$9#$b#But you can use my room if you need a spot to change out of that thing.$1",
				"%You ask Abigail for a change. She giggles mischievously.#$b#I'll consider it.",
				"%You ask Abigail for a change.#$b#Oh, @, you're gonna have to try a little harder than that.",
				"%Abigail smiles innocently when you ask for a change.#$b#Mmm, nah, I think <that#those> $UNDERWEAR_NAME$ can wait a bit longer.",
				"You want a change?#$b#Hmm, I dunno... What's in it for me?$9",
				"Are you suuuuure you need a change?$6#$b#...Hmm, alright! Lie down for me... *giggle*$1#$b#::121:change:dinosaur undies:1::"
			],
			"change_nice": [
				"%Abigail folds her arms and pouts.#$b#You're gloating, aren't you?$3",
				"Alright, I've looked at your butt. Is that all you wanted?$9"
			],
			"soiled_change_mean": [
				"No way. I'm not touching -whatever- is under your $PANTS_NAME$<&, it smells like rotten bugmeat>.$5",
				"That sounds like a \"you\" problem.",
				"Mmm, no.",
				"Look. Just cause this doesn't gross me out? Doesn't mean I'm gonna do anything about it.$9"
			],
			"change_mean": [
				"Congratulations? You have a butt, and it is - in fact - attached to your body. Just like everybody else.$3",
				"*gasp* Dear god... it's hideous--$7#$b#*rolls eyes* Nah, false alarm. This is literally nothing.$3"
			],
			//Ground
			"ground": [
				"Had to go that badly, huh?",
				"Hehe, yeah! Stick it to the man!$1",
				"Don't worry, I saw nothing. *wink*",
				"I dunno, I'd probably have kept that to my pants if I were you.$1"
			],
			"ground_attempt": [
				"Mmm, cute try, but you're pretty bad at this... Maybe just stick to diapers?$1"
			]
		},
		//																																																																
		"alex": {
			//Use your diaper near them
			"soiled_verynice": [
				"Awww, you're so cute when you're embarrassed!$1",
				"Where's your mommy $NICKNAME$? I think you need a change."
			],
			"soiled_nice": [
				"Did you just <wet&mess> yourself $FARMERNAME$?",
				"Just letting you know $FARMERNAME$, you should probably change your diaper soon."
			],
			"soiled_mean": [
				"...$5",
				"...Did you just...$2"
			],
			//You check them
			"check_verynice": [
				"Well, if you're that curious...#$b#%They give you the smallest peek.#$b#All right, show's over$1"
			],
			"check_nice": [
				"*snickers* What, you think I'm a baby?"
			],
			"check_mean": [
				"Back off.$u"
			],
			"cooldown_check": [
				"%Things haven't changed since your last check."
			],
			//They check you
			"soiled_change_verynice": [
				"soiled very nice change"
			],
			"change_verynice": [
				"<That#Those> $UNDERWEAR_NAME$ <looks#look> just fine to me silly. Did you just want my attention?"
			],
			"soiled_change_nice": [
				"soiled nice change"
			],
			"change_nice": [
				"<That#Those> $UNDERWEAR_NAME$ <looks#look> just fine to me silly. Did you just want my attention?"
			],
			"soiled_change_mean": [
				"Yuck! You smell <like pee&disgusting>! Get it away from me!$u"
			],
			"change_mean": [
				"What?! No I won't check your pants, go bother someone else.$u"
			],
			//Ground
			"ground": [
				"Eww. Is that normal in the city?$5",
				"What... Ugh!$5",
				"Did you just <pee&poop> on the ground? Gross!$5"
			],
			"ground_attempt": [
				"What... Put your pants back on!$5"
			]
		},
		//																																																								
		"caroline": {
			"soiled_verynice": [
				"Aww, do you need me to change you out of your <wet&messy> $UNDERWEAR_NAME$?",
				"I think little $NICKNAME$ needs <his/her> diaper changed!",
				"I know a little farmer who needs <his/her> diaper changed!$1"
			],
			"soiled_nice": [
				"You poor thing! Did you just <wet&mess> yourself?",
				"Does someone need a diaper change?"
			],
			"soiled_mean": [
				"You <&really >might want to go change your pants.$u"
			],
			//You check them
			"check_verynice": [
				"What, are you curious what underpants look like?"
			],
			"check_nice": [
				"I'll be fine, you worry about your own pants."
			],
			"check_mean": [
				"What do you think you're looking at?$u"
			],
			"cooldown_check": [
				"%Things haven't changed since the last check."
			],
			//They check you
			"soiled_change_verynice": [
				"Oh, you have something to show me?#$b#Oh! well, you sure are <wet&messy>!$h#$b#I guess that's no surprise. Why don't you head into my room for some privacy and clean yourself up."
			],
			"change_verynice": [
				"<That#Those> $UNDERWEAR_NAME$ <looks#look> just fine to me. Did you just want my attention?"
			],
			"soiled_change_nice": [
				"Oh, yeah, you sure are <wet&messy>... Look, if you need a private place to change, you can use my room.#$b#Just make sure to clean up after yourself."
			],
			"change_nice": [
				"Well, your $UNDERWEAR_NAME$ seem dry to me.#$b#... I guess I check your pants now... Huh."
			],
			"soiled_change_mean": [
				"Oh gross. Go figure it out yourself.$u"
			],
			"change_mean": [
				"Keep it to yourself...$u",
				"Didn't your parents teach you basic privacy?$u"
			],
			//Ground
			"ground": [
				"$FARMERNAME$! Living in the country doesn't make us barbarians!$u",
				"That's not okay! Use a toilet!$u"
			],
			"ground_attempt": [
				"$FARMERNAME$! What are you doing!$u"
			]
		},
		//																																																									
		"clint": {
			"soiled_verynice": [
				"Um...$2#$b#%Clint awkwardly shuffles away from you."
			],
			"soiled_nice": [
				"*muttering* ...Gross...$3#$b#%Clint steps slightly back from you."
			],
			"soiled_mean": [
				"Urgh. No. Don't do that near me again.$3"
			],
			//You check them
			"check_verynice": [
				"You mind your business, and I'll mind mine.$3"
			],
			"check_nice": [
				"I'll be fine, you worry about your own pants.$2"
			],
			"check_mean": [
				"What do you think you're looking at?$3"
			],
			"cooldown_check": [
				"%Things haven't changed since the last check."
			],
			//They check you
			"soiled_change_verynice": [
				"Ugh. Just take this and get cleaned up already.$2#$b#::180:give:Joja diaper:1::"
			],
			"change_verynice": [
				"%Clint ignores your request for a diaper-check.#$b#I'm busy."
			],
			"soiled_change_nice": [
				"%Clint pinches his nose.#$b#Ugh. Well, you sure are <wet&messy>...$2#$b#I guess that's no surprise.$2#$b#Look, if you need a private place to change, you can use my room. Just don't make a mess in there."
			],
			"change_nice": [
				"%Clint ignores your request for a diaper-check.#$b#I'm busy.$3"
			],
			"soiled_change_mean": [
				"Urgh, gross. Figure it out yourself.$3"
			],
			"change_mean": [
				"Keep it to yourself...$u",
				"Didn't your parents teach you basic privacy?$u"
			],
			//Ground
			"ground": [
				"$FARMERNAME$! Living in the country doesn't make us barbarians!$3",
				"That's not okay! Use a toilet!$3"
			],
			"ground_attempt": [
				"$FARMERNAME$! What are you doing!$3"
			]
		},
		//																																																									
		"demetrius": {
			"soiled_verynice": [
				"Well, that's interesting. I wonder what part of the biological process prevents you from making it to the toilet.#$b#There's a surprising amount of possibilities$3"
			],
			"soiled_nice": [
				"That's an interesting behavior. I wonder why that happens to you.$5#$b#Hmmmm...$2"
			],
			"soiled_mean": [
				"Huh... Interesting.$5"
			],
			//You check them
			"check_verynice": [
				"What am I wearing? You can see what I'm wearing.#$b#%Demetrius holds out his arms to prove his point, though, it doesn't answer the question you were trying to ask."
			],
			"check_nice": [
				"%You're not sure you've ever even seen Demetrius's shirt untucked. Though, you know enough about him to know he wouldn't be wearing a diaper."
			],
			"check_mean": [
				"%You're not sure you've ever even seen Demetrius's shirt untucked. Though, if it were, you doubt you'd see a diaper."
			],
			"cooldown_check": [
				"%Things haven't changed since the last check."
			],
			//They check you
			"soiled_change_verynice": [
				"I actually started keeping diapers in the lab to experiment with the sodium polyacrylate. You can have one if you need it.#$b#::200:give:Joja diaper:1::"
			],
			"change_verynice": [
				"You look dry enough to me. Or is that a new technology that's so efficient I can't tell how much you've soiled it..?$1#$b#...No, <that's a#those are> normal $UNDERWEAR_NAME$.$2"
			],
			"soiled_change_nice": [
				"I don't think I can help with that, but if you need a spot to take care of it yourself you can use my room.$5#$b#I'm sure Robin wouldn't mind."
			],
			"change_nice": [
				"You look fine to me."
			],
			"soiled_change_mean": [
				"I'm busy...$4"
			],
			"change_mean": [
				"I'm busy...$4"
			],
			//Ground
			"ground": [
				"$FARMERNAME$! Living in the country doesn't make us barbarians!$3",
				"That's not okay! Use a toilet!$3"
			],
			"ground_attempt": [
				"$FARMERNAME$! What are you doing!$3"
			]
		},
		//																																																									
		"dwarf": {
			"soiled_verynice": [
				"Ah! There's that familiar foul smell of my favorite customer! *chuckle*#$b#Hey, so long as you've got the gold, I can turn a blind-- Erm... Nose? ...To anything, my friend!"
			],
			"soiled_nice": [
				"My people are able to recognize each other by scent alone. A useful quality, in the dark.#$b#Your kind are typically not so... distinctive... as you."
			],
			"soiled_mean": [
				"..."
			],
			//You check them
			"check_verynice": [
				"...Are you still curious as to what dwarven undergarments look like?#$b#It's just the same as what many of your own kind wears.#$b#Except for you, I suppose."
			],
			"check_nice": [
				"Eh? Are you curious what dwarven undergarments look like?#$b#That's a bit personal, isn't it?"
			],
			"check_mean": [
				"%The Dwarf hisses at you when you try to get behind them.#$b#%...Seems you won't be checking anything here."
			],
			"cooldown_check": [
				"%Things haven't changed since the last check."
			],
			//They check you
			"soiled_change_verynice": [
				"Here. I took these from the surface! They're the same type of garment you wear, right?#$b#::113:give:Joja diaper:1::"
			],
			"change_verynice": [
				"The smell of your... incidents... is not one I can easily ignore.#$b#If you needed assistance, trust me, I would know."
			],
			"soiled_change_nice": [
				"*sniff* Eugh! That's worse than the bug-nests in the mines.#$b#I'm not going near that."
			],
			"change_nice": [
				"...What?"
			],
			"soiled_change_mean": [
				"..."
			],
			"change_mean": [
				"..."
			],
			//Ground
			"ground": [
				"Please, do NOT <urinate&defecate> on the floor of my shop!#$b#...It attracts the duggies."
			],
			"ground_attempt": [
				"...I am unfamiliar with you humans and your customs...#$b#But, to us Dwarves?#$b#Well, that is extremely offensive, what you're doing right now."
			]
		},
		//																																																									
		"elliott": {
			//Use your diaper near them
			"soiled_verynice": [
				"Awww, you're so cute when you're embarrassed!$1",
				"Where's your mommy $NICKNAME$? I think you need a change."
			],
			"soiled_nice": [
				"Did you just <wet&mess> yourself $FARMERNAME$?",
				"Just letting you know $FARMERNAME$, you should probably change your diaper soon."
			],
			"soiled_mean": [
				"...$5",
				"...Did you just...$2"
			],
			//You check them
			"check_verynice": [
				"Well, if you're that curious...#$b#%They give you the smallest peek.#$b#All right, show's over.$1"
			],
			"check_nice": [
				"*snickers* What, you think I'm a baby?"
			],
			"check_mean": [
				"Back off.$u"
			],
			"cooldown_check": [
				"%Things haven't changed since your last check."
			],
			//They check you
			"soiled_change_verynice": [
				"soiled very nice change"
			],
			"change_verynice": [
				"<That#Those> $UNDERWEAR_NAME$ looks just fine to me silly. Did you just want my attention?"
			],
			"soiled_change_nice": [
				"soiled nice change"
			],
			"change_nice": [
				"<That#Those> $UNDERWEAR_NAME$ looks just fine to me silly. Did you just want my attention?"
			],
			"soiled_change_mean": [
				"Yuck! You smell <like pee&disgusting>! Get it away from me!$u"
			],
			"change_mean": [
				"What?! No I won't check your pants, go bother someone else.$u"
			],
			//Ground
			"ground": [
				"Eww. Is that normal in the city?$5",
				"What... Ugh!$5",
				"Did you just <pee&poop> on the ground? Gross!$5"
			],
			"ground_attempt": [
				"What... Put your pants back on!$5"
			]
		},
		//																																																								
		"emily": {
			//Use your diaper near them
			"soiled_verynice": [
				"Oh no, baby, were you holding all that in for me?$2#$b#There, there, just let it all out. We'll get you cleaned up once you're all done.$4#$b#I promise, no one's watching.",
				"*whisper* Shh, shh... It's okay, you can't help it.#$b#%Emily gently rubs circles on your back.",
				"Aw, c'mon now, @. You weren't even trying to make it, were you?$4",
				"$query !LOCATION_NAME Here Saloon#Aww, @, did you give yourself a tummyache trying to hold it again?$2|Oh no! Did you <drink&eat> too much and upset your tummy, @?#$b#I'll grab the mop, okay? Don't worry about it.",
				"$query !PLAYER_FRIENDSHIP_POINTS Current Haley 2000#Poor sweetie. I hope your tummy feels better now!$2|Uh-oh, is someone <tinkling&making pushies>?$1#$b#Heh, I thought so. Both you and my baby sister get all blushy when it's happening. It's so precious!$4#$b#...Sorry, is it weird to notice that? *chuckle*$1",
				"$query !PLAYER_FRIENDSHIP_POINTS Current Haley 2000#Awh, don't worry. You tried to hold it in, didn't you..? That's all that matters.$4|It's okay, baby</girl>, Haley does this around the house sometimes too... *chuckle*$1#$b#But unlike my dear sister, you wouldn't be so shy about recieving a change if I noticed you getting too <leaky&stinky>, would you?$4"
			],
			"soiled_nice": [
				"Aw. Poor <boy/girl>... Do you need me to find a grown-up for you?",
				"$query !LOCATION_NAME Here Saloon#Oh, @... Are you okay?$2|Oh gosh! Did you <drink&eat> too much, @?$2#$b#Just take it easy, okay?$3",
				"$query !PLAYER_FRIENDSHIP_POINTS Current Haley 2000#Oh...! Be careful not to leak, @!$6|So, this is where my little sister gets it from, huh? *laughs*$1#$b#...Mmm, it might be sort of cute... if she was actually *responsible* when it came to getting cleaned up as soon as she needs it.$3#$b#...So! Are you a big responsible <boy/girl>, @?"
			],
			"soiled_mean": [
				"Urgh... Yikes!$6",
				"$query LOCATION_NAME Here Saloon#Oh, yuck!! Don't make a mess on any of the seats!!! *glare*$5|%Emily <grimaces&covers her nose>.#$b#<&Pee-yew... >Looks like the little farmer had an accident in <his/her> pants.$6" 
			],
			//You check them
			"check_verynice": [
				"%Emily quickly stifles a chuckle behind her hand.#$b#Aww, baby... you want to give me a diaper check?$1#$b#Well! *giggle* ...That's... very sweet! Thank you for offering?$1#$b#%...You're starting to suspect Emily might not wear diapers... But you can never be too sure!"
			],
			"check_nice": [
				"%You're not sure if Emily is the type to wear a diaper...#$b#%...But, if she was, a flowy dress WOULD be the perfect cover..."
			],
			"check_mean": [
				"Hey, what do you think you're doing? *glare*$5"
			],
			"cooldown_check": [
				"%Things haven't changed since your last check."
			],
			//They check you
			"soiled_change_verynice": [
				"Aw, did you make a present for me? *giggle*$1#$b#Let's get you out of that nasty thing!#$b#::260:change:baby print diaper:1::",
				"Oh, no! You didn't make it?$2#$b#Don't worry, I know it's hard for you. Let's go get that taken care of.$4#$b#::262:change:baby print diaper:1::"
			],
			"change_verynice": [
				"Aww, don't worry your little head, $NICKNAME$. If you ever need a change, you can always ask me!"
			],
			"soiled_change_nice": [
				"$query !PLAYER_FRIENDSHIP_POINTS Current Haley 2000#Awh, @... I'm sorry, I don't keep diapers on me.|Oh, you had an accident, hmm?<$1& Oof, and a pretty bad one, too...$2>#$b#It's okay. I've learned keep a couple spares in my bag for Haley.#$b#*sigh* She can be such a scatterbrain, always forgetting to replace the ones in her purse...$3#$b#::261:change:baby print diaper:1::"
			],
			"change_nice": [
				"<That#Those> $UNDERWEAR_NAME$ <looks#look> just fine to me, silly. Did you just want my attention?"
			],
			"soiled_change_mean": [
				"$query !PLAYER_FRIENDSHIP_POINTS Current Haley 2000#Yuck! You smell <like pee&disgusting>! Get it away from me!$a|Eugh! No thanks, I have enough on my hands with just Haley to deal with.$5"
			],
			"change_mean": [
				"What?! No, I'm not going to check your pants!$a"
			],
			//Ground
			"ground": [
				"Eww. Is that normal in the city?$5",
				"What... Ugh!$5",
				"Did you just <pee&poop> on the ground? Gross!$5"
			],
			"ground_attempt": [
				"What... Put your pants back on!$5"
			]
		},
		//																																																								
		"Evelyn": {
			"soiled_verynice": [
				"Oh goodness, I can't let you stay like that, come here.#$b#%Evelyn takes you by the hand to a private spot and gets to work changing your diaper.#$b#You know, I think you'd fit just fine in one of mine! Isn't that curious!$1#$b#::280:change:heart diaper:1::",
				"My eyesight may be poor, but my nose hasn't failed me yet!"
			],
			"soiled_nice": [
				"Did you have an accident?$2#$b#Why don't you go find your mommy, she'll help you get cleaned up.",
				"Did you <wet&poop> your pants?#$b#Don't be shy now!$1",
				"My eyesight may be poor, but my nose hasn't failed me yet!"
			],
			"soiled_mean": [
				"Oh, poor baby. Why don't you find somebody to help you get cleaned up.$2",
				"Oh, I thought you were too old for that.$2#$b#I guess my eyes aren't what they used to be.",
				"My eyesight may be poor, but my nose hasn't failed me yet!"
			],
			//You check them
			"check_verynice": [
				"Goodness aren't you a curious little one. Yes, sometimes people go back to diapers when they get older, and that's okay.#$b#%She boops your nose affectionately.",
				"What a curious little bug you are. Yes, I am wearing a diaper.#$b#But shhhh, it's a secret.$1"
			],
			"check_nice": [
				"What a curious little bug you are. Yes, I am wearing a diaper.#$b#But shhhh, it's a secret.$1",
				"Goodness aren't you a curious little one. Yes, sometimes people go back to diapers when they get older, and that's okay."
			],
			"check_mean": [
				"%You're too nervous to ask about it, but you can definitely hear a crinkle from under Evelyn's dress."
			],
			"cooldown_check": [
				"%Things haven't changed since the last check."
			],
			//They check you
			"soiled_change_verynice": [
				"Well, let me see... Oh honey, you're <wet&messy>.$2#$b#I can't let you stay like that. Come on.#$b#%Evelyn takes you by the hand and leads you to a private spot to get changed.#$b#::281:change:heart diaper:1::",
				"Well, let me see... Oh honey, you're <wet&messy>.$2#$b#I can't let you stay like that. Come on.#$b#%Evelyn takes you by the hand and leads you to a private spot to get changed.#$b#::282:change:heart diaper:1::"
			],
			"change_verynice": [
				"<That#Those> $UNDERWEAR_NAME$ <looks#look> just fine to me. Did you just want my attention?",
				"Awww, are you proud that you're all dry? What a sweetheart."
			],
			"soiled_change_nice": [
				"Well, let me see... Oh honey, you're <wet&messy>.$2#$b#I can't let you stay like that. Come on.#$b#%Evelyn takes you by the hand and leads you to a private spot to get changed.#$b#::281:change:heart diaper:1::"
			],
			"change_nice": [
				"Awww, are you proud that you're all dry? What a sweetheart."
			],
			"soiled_change_mean": [
				"Oh, you need a change? Huh, I could have sworn you were older.$2#$b#Anyway, where's you mommy?"
			],
			"change_mean": [
				"Oh, you need a change? Huh, I could have sworn you were older.$2#$b#Anyway, where's you mommy?"
			],
			//Ground
			"ground": [
				"$FARMERNAME$! Living in the country doesn't make us barbarians!$3",
				"That's not okay! Use a toilet!$3"
			],
			"ground_attempt": [
				"$FARMERNAME$! What are you doing!$3"
			]
		},
		//																																																									
		"george": {
			"soiled_verynice": [
				"I know that look...#$b#Go find Evelyn. She'll take care of it.$1",
				"I remember when my body didn't betray me.$2#$b#Shame yours always has."
			],
			"soiled_nice": [
				"Find somewhere else to do that.$3"
			],
			"soiled_mean": [
				"Find somewhere else to do that.$3"
			],
			//You check them
			"check_verynice": [
				"Look, I'll take care of myself, okay?#$b#I don't need your help.$2"
			],
			"check_nice": [
				"What do you think you're looking at?$3",
				"Keep your hands to yourself.$3"
			],
			"check_mean": [
				"Back off.$3",
				"Keep you hands to yourself.$3"
			],
			"cooldown_check": [
				"%Things haven't changed since the last check."
			],
			//They check you
			"soiled_change_verynice": [
				"*sigh* Look, I've got enough to deal with. You're a bright kid. Figure yourself out.",
				"Go find Evelyn. She'll sort you out."
			],
			"change_verynice": [
				"*sigh* Look, I've got enough to deal with. You're a bright kid. Figure yourself out."
			],
			"soiled_change_nice": [
				"Keep it to yourself buddy.$3",
				"Figure it out yourself.$3"
			],
			"change_nice": [
				"Keep it to yourself buddy."
			],
			"soiled_change_mean": [
				"Figure it out yourself.$3",
				"Keep your pants on.$3"
			],
			"change_mean": [
				"Keep it to yourself...$u",
				"Figure it out yourself.$3",
				"Keep your pants on.$3"
			],
			//Ground
			"ground": [
				"$FARMERNAME$! Living in the country doesn't make us barbarians!$3",
				"That's not okay! Use a toilet!$3"
			],
			"ground_attempt": [
				"$FARMERNAME$! What are you doing!$3"
			]
		},
		//																																																									
		"gus": {
			"soiled_verynice": [
				"Couldn’t quite make it? That’s okay. Ain’t the worst mess I’ve seen ‘round here, trust me.$1",
				"Looks like that was a relief, hah!$1",
				"Couldn’t hold it any longer, eh?",
				"Hoo boy, that’s gonna be a heck of a change.$1",
				"That’s it, let it all on out.",
				"Wow, you were really <satisfied&pushing> with that one.$1",
				"Well, at least it feels good to take a load off...#$b#Even if it’s in your pants, yeah?$1",
				"You makin’ your own fertilizer there $FARMERNAME$?",
				"You got any clean diapers? I always keep some spare in back for ya, just in case, pal.$1#$b#Well, you and anyone else who happens to need one.",
				"I hope that smell’s a dirty diaper and not some rotting food in back…",
				"When you gotta go I guess!$1",
				"Couldn’t quite make it? That's alright, go get cleaned up. The Saloon will still be here when you get back."
			],
			"soiled_nice": [
				"You mind takin' care of that please?#$b#Thanks$1",
				"When you gotta go I guess!$1",
				"Couldn’t quite make it? That's alright, go get cleaned up. The Saloon will still be here when you get back.",
				"I hope that smell’s a dirty diaper and not some rotting food in back…"
			],
			"soiled_mean": [
				"You mind takin' care of that before it bothers anyone else buddy?$2",
				"I have enough to clean up.$3",
				"Alright, you're not drinking any more tonight."
			],
			//You check them
			"check_verynice": [
				"Yeah, I'm just in undies. Gotta be professional. You know how it is.#$b#Well, I guess you don't.$1",
				"What do you think you're lookin' for?#$b#Tryin' to see if I'm takin' after my crinkliest customer?$1",
				"I'm not wearin' anything that needs checkin', but I won't object if you want give a pat just to make sure."
			],
			"check_nice": [
				"Yeah, I'm just in undies. Gotta be professional. You know how it is.#$b#Well, I guess you don't$1"
			],
			"check_mean": [
				"%Gus always looks nice and presentable."
			],
			"cooldown_check": [
				"%Things haven't changed since your last check."
			],
			//They check you
			"soiled_change_verynice": [
				"Ah, I figured this might happen, so I came prepared.#$b#::110:give:pawprint diaper:1::",
				"Yup, that's a <droopy&loaded> $UNDERWEAR_NAME$ you got there! Here, I got somethin' that might help ya.$1#$b#::110:give:pawprint diaper:1::",
				"Well, let's see what we got here.#$b#%Gus spends much longer than he needs groping at your drooping diaper.#$b#Yeah, that sure seems like a <wet&loaded> $UNDERWEAR_NAME$ to me!"
			],
			"change_verynice": [
				"Well what're you showin' me that for? Looks clean enough to me!",
				"Ah, came prepared to drink I see. Good choice.$1"
			],
			"soiled_change_nice": [
				"I'm a little busy at the moment. Just use my room, ain't no one gonna bug ya in there.",
				"Yup, that sure is a <wet&messy> one.#$b#If I wasn't so busy I'd help!"
			],
			"change_nice": [
				"Well what're you showin' me that for? Looks clean enough to me!",
				"Ah, came prepared to drink I see. Good choice.$1"
			],
			"soiled_change_mean": [
				"It's not easy running an establishment. Sort yourself out.$3"
			],
			"change_mean": [
				"I have enough to clean up.$3"
			],
			//Ground
			"ground": [
				"Alright, you're not drinking any more tonight.",
				"That's not okay! Use a toilet!$3"
			],
			"ground_attempt": [
				"What the?! Keep your pants on!"
			]
		},
		//																																																																
		"haley": {
			//Use your diaper near them
			"soiled_verynice": [
				"Aww! That face is like, so adorbs! *blush*$1",
				"Looks like <that#those> $UNDERWEAR_NAME$ <is#are> a little <wet&messy> now! How about a changing?$1",
				"%Haley <&takes a few curious sniffs and >giggles at you emptying out your <bladder&tummy>.#$b#Like, right in front of me, @??$13#$b#*mumble* ......C-Cute.$4",
				"Um, like... @? You can totally borrow from my closet if you ruin your $PANTS_NAME$, by the way.#$b#I donate clothes all the time, but they just keep piling up again! Heehee.$1",
				"You know, I'll admit it. Maybe gross things CAN be fun sometimes...$13",
				"$query !PLAYER_FRIENDSHIP_POINTS Current Emily 2000#Heh. Don't let Emily catch you, she hates it when I don't try to make it.$13|Oof, feels good to let it out, huh?$4#$b#My big sis has no clue what she's missing out on! *giggle*$1"
			],
			"soiled_nice": [
				"Soooo, like... hypothetically... what colors do those diapers come in?$13",
				"I think you might be leaking a little!$13"
			],
			"soiled_mean": [
				"Diapers are NOT in fashion, and neither is <peeing&pooping> your pants like a baby!$3",
				"Like, eww. Why is everyone in this town so gross?!$3",
				"I was gonna tell you to change your clothes because of how unstylish they are, but it looks like you need your diaper changed more, you big baby!$3"
			],
			//You check them
			"check_verynice": [
				"%Haley proudly lifts her skirt to show a clean pink diaper.#$b#Hmph. Easy!$11",
				"%Haley bashfully lifts her skirt to show a clean white diaper with cartoon prints on it.#$b#Ugh... It was my sister's choice, not mine.$3",
				"%Haley nervously lifts her skirt to show a wet diaper with a pawprint design.#$b#I-I was totally going to change it like... now...?$2",
				"%Haley cautiously lifts up the back of her skirt to show you. ...Wow. That's a full diaper.#$b#U-Umm. How bad is it? I kinda lost track of how many times I...$8#$b#%Haley gives her diaper a tentative grope.#$b#......Wuh-oh.$12",
				"%You give Haley a quick diaper check. All clean!#$b#Psh! Like there could be any doub-$13#$b#%...Haley awkwardly trails off as you feel the front of her diaper suddenly getting warm against your hand.#$b#...Uuuh... H-Heh... u-umm...$12#$b#*wince* ...Nevermind.$2",
				"I think my diaper's starting to sag. Can you give me a hand?$2#$b#%...You give Haley a quick change, and she sighs with relief.#$b#...I'm really glad you've gotten me into this whole diaper thing, @.$4",
				"%You give the back of Haley's diaper a firm smoosh, and she giggles airily.#$b#That feels SO weird, @!$1#$b#Ugh, yeah, whatever. I guess I did mess a little...$13#$b#%You take Haley aside, wipe her down thoroughly, and give her a change.#$b#You know, I .$4",
				"%You see the pale white fabric of a sodden diaper peeking out from under Haley's skirt.#$b#%The moment Haley realizes what you're staring at, she gives it a tentative poke and her face flushes bright-red.#$b#Oh! Um... Oopsies... I'll, like, take care of it in just a minute!!!$12"
			],
			"check_nice": [
				"%You don't think Haley would let you check her yet, even if she was wearing a diaper..."
			],
			"check_mean": [
				"Back off!$a"
			],
			"cooldown_check": [
				"%Things haven't changed since your last check."
			],
			//They check you
			"soiled_change_verynice": [
				"Looks like we've got a <soggy&stinky> little cutie-patootie on our hands.$13#$b#Let's put you in something nice and cute, okay?$1#$b#::340:change:heart diaper:1::",
				"You too?$13#$b#...Hey. Wanna see if we could get Emily to change us both? *giggle*$1#$b#Joking, joking! I can be a big girl for like, five minutes to change a <soggy&poopy> diaper or two.$4#$b#::341:change:pawprint diaper:1::",  
				"Woah.$8#$b#Bestie! You totally <peed&pooped> your pamps!$12#$b#Like... okay, sure, I guess I've sat in worse. But that's gonna give you a rash! And I won't stand for it!#$b#::342:change:heart diaper:1::",
				"Oh! You need a change?$8#$b#For sure, I'll help!$11#$b#::343:change:lil swabbies:1::"
			],
			"change_verynice": [
				"<That#Those> $UNDERWEAR_NAME$ <is#are> totally adorable on you.#$b#Oh! You're asking me like, do you need to change..?#$b#Nope, you're all good</, girl>!$1"
			],
			"soiled_change_nice": [
				"Um, that's like... kinda yucky, isn't it?<$2&$12>#$b#I don't wanna touch something that has <pee&poop> on it.$2#$b#But, like, you can totes use our bathroom to clean up any time! Emily won't mind, I'm sure!"
			],
			"change_nice": [
				"<That#Those> $UNDERWEAR_NAME$ <is#are> kind of cute, actually...$4#$b#Um, where exactly do you get these? ...Just curious, I mean!$13"
			],
			"soiled_change_mean": [
				"Yuck! You smell <like pee&disgusting>! Get away from me!$u"
			],
			"change_mean": [
				"What?! No I won't check your pants, you big baby! Go bother someone else.$3"
			],
			//Ground
			"ground": [
				"What... Ugh!$5",
				"Did you just <pee&poop> on the ground? Gross!$5"
			],
			"ground_attempt": [
				"What?? Put your pants back on!$5"
			]
		},
		//																																																													
		"harvey": {
			//Use your diaper near them
			"soiled_verynice": [
				"%Harvey raises an eyebrow at you before silently moving to check your $UNDERWEAR_NAME$.#$b#It is my expert medical opinion that this diaper is <wet&messy>.$3#$b#%He gives your bottom a gentle pat.",
				"%Harvey chuckles and pats your bottom#$b#Goodness.$1",
				"It's okay, that's just a sign of a healthy diet.$1#$b#You're okay, just go back to playing.",
				"%Harvey pinches your cheek.#$b#Don't be shy, that's why I keep you in diapers.",
				"Do they make thicker diapers than those yet?$2#$b#You might need them.$3",
				"Oh $FARMERNAME$, you're so cute when you're embarrassed!$1",
				"%Harvey puts a firm hand on your shoulder#$b#Do you want to tell me what just happened or do you want me to check?",
				"Either your symptoms are getting worse or you're enjoying yourself.$1#$b#$y 'Well, which is it?_I-I like it..._Awwww. Thank you for telling the truth little <boy/girl>._No way!_Well then. I guess that means you're going to need an exam soon, aren't you.$3'"
			],
			"soiled_nice": [
				"Hey, you might have something you need to take care of.$4",
				"Are you feeling okay? Did you eat something that didn't agree with you?$8",
				"At least your symptoms are consistent...$2",
				"%Harvey doesn't speak up, but he gives you a little wink to let you know he saw what happened.",
				"I have supplies from Joja in my office...#$b#You might be better off going to Pierre's.$2"
			],
			"soiled_mean": [
				"Oh. That's certainly a symptom...$8",
				"My office is supposed to be sterile...$5",
				"I can see your medical history is accurate.$2",
				"%Harvey tries not to pay what happened any attention. His awkward glasses-adjustment gives him away.",
				"%Harvey clears his throat.#$b#U-uhmm. There's 'supplies' at Pierre's if you need them.$7"
			],
			//You check them
			"check_verynice": [
				"%Harvey notices you looking down.#$b#Are you curious about what it looks like to wear pants that don't crinkle?#$b#%Harvey untucks his shirt to let you see the band of his boxers.#$b#Aww, don't be jealous. I prefer that you aren't wearing these.$1",
				"%Harvey's shirt is thoroughly tucked in and you can't get a good look. He doesn't seem to notice your glances.",
				"Are you pretending I'm the baby that needs a check?#$b#You must be really good at pretending given the circumstances!$1"
			],
			"check_nice": [
				"%A little nervous, you reach out to see if you can move Harvey's shirt out of the way.#$b#Uhm.... Do you need something?$8"
			],
			"check_mean": [
				"%Harvey's shirt is thoroughly tucked in and you can't get a good look. He doesn't seem to notice your glances."
			],
			"cooldown_check": [
				"Harvey hasn't changed his pants since you last looked."
			],
			//They check you
			"soiled_change_verynice": [
				"Hmmmm. That sure is a <wet&messy> $UNDERWEAR_NAME$. I think it'll keep though.#$b#%Harvey pats your squishy bottom to send you off to play.",
				"Hmmmm. That sure seems like a <wet&messy> $UNDERWEAR_NAME$ to me.#$b#%Harvey gives your bottom an extra squish just to make sure.#$b#::360:change:baby print diaper:1::",
				"%Harvey raises an eyebrow at you before silently moving to check your <soggy&dirty> $UNDERWEAR_NAME$.#$b#Goodness, let's get you into something more comfortable$1#$b#::360:change:baby print diaper:1::"
			],
			"change_verynice": [
				"I see your taking my prescription seriously.$3#$b#Good <boy/girl>, thank you.$1",
				"Hmmm. It's in my professional opinion that this is a very clean $UNDERWEAR_NAME$.$3"
			],
			"soiled_change_nice": [
				"O-Oh... W-Well, you can change in my room if you need somewhere.$4"
			],
			"change_nice": [
				"I see your taking my prescription seriously.$3"
			],
			"soiled_change_mean": [
				"%Harvey blanches a little as you ask him to help you with your <wet&messy> $UNDERWEAR_NAME$.#$b#W-we don't offer that service at the clinic.$7"
			],
			"change_mean": [
				"W-we don't offer that service at the clinic.$7"
			],
			//Ground
			"ground": [
				"@, you're supposed to be wearing protective underwear for a reason.$5#$b#If you cannot make it to a toilet, then use them instead.$5"
			],
			"ground_attempt": [
				"What?? Put your pants back on!$5"
			]
		},
		//																																																														
		"jas": {
			//Use your diaper near them
			"soiled_verynice": [
				"#$p 102#%Jas doesn't seem to notice what happened.|Don't cry, it's okay for little <boy/girl>s to have accidents sometimes.",
				"#$p 102#%Jas doesn't seem to notice what happened.|Oh no, did you have an accident? That's okay, you can try again next time.",
				"#$p 102#%Jas doesn't seem to notice what happened.|It's okay, I won't tell anyone you had an accident $FARMERNAME$",
				"#$p 102#%Jas doesn't seem to notice what happened.|It's okay $NICKNAME$, I still have accidents too.$1",
				"#$p 102#%Jas doesn't seem to notice what happened.|I can see you waddling!$4",
				"#$p 102#%Jas doesn't seem to notice what happened.|Did you have an accident? It's okay, once you're all clean you'll feel all better.",
				"#$p 102#%Jas doesn't seem to notice what happened.|You're supposed to do that on the potty you know.$4",
				"#$p 102#%Jas doesn't seem to notice what happened.|Do you need me to get Aunt Marnie? She always helps me when I have an accident."
			],
			"soiled_nice": [
				"#$p 102#%Jas doesn't seem to notice what happened.|*Giggles* Uh oh!$1",
				"#$p 102#%Jas doesn't seem to notice what happened.|You're supposed to do that on the potty you know.$4",
				"#$p 102#%Jas doesn't seem to notice what happened.|Do you need me to get Aunt Marnie? She always helps me when I have an accident.$3"
			],
			"soiled_mean": [
				"#$p 102#%Jas doesn't seem to notice what happened.|Oh... gross...$3",
				"#$p 102#%Jas doesn't seem to notice what happened.|Ewww$3",
				"#$p 102#%Jas doesn't seem to notice what happened.|...$2"
			],
			//You check them
			"check_verynice": [
				"#$p 102#%You consider finding someone you can check.|%After you ask, she lifts her dress to peek under it.#$b#All clean!#$b#I'm very good at this$4",
				"#$p 102#%You consider finding someone you can check.|%After you ask, she lifts her dress so you can peek under it. You tell her she's dry and she beams.#$b#It's cause I just pottied!$1",
				"#$p 102#%You consider finding someone you can check.|%After you ask, she lifts her dress to peek under it.#$b#A-Aunt Marnie!$2",
				"#$p 102#%You consider finding someone you can check.|%After you ask, she lifts her dress and lets you peek under it. She's very wet.#$b#Oh rats.$3",
				"#$p 102#%You consider finding someone you can check.|%After you ask, she lifts her dress to peek under it.#$b#All dry!$1#$b#I'm very good at this$4#$b#%You point out the smell and her expression droops.#$b#O-ohh.$2",
				"#$p 102#%You consider finding someone you can check.|I'm all clean, see?#$b#%Jas lifts up her dress to proudly show off her clean pull up.#$b#Told you$4",
				"#$p 102#%You consider finding someone you can check.|%You ask Jas if she might need to use the potty.#$b#Oh yeah! Thank you!$1",
				"#$p 102#%You consider finding someone you can check.|I already used the potty thank you very much.$4",
				"#$p 102#%You consider finding someone you can check.|%You ask Jas if she might need to use the potty. She just shrugs and carries on."
			],
			"check_nice": [
				"#$p 102#%You consider finding someone you can check.|%After you ask, she lifts her dress to peek under it.#$b#A-Aunt Marnie!$2",
				"#$p 102#%You consider finding someone you can check.|%After you ask, she lifts her dress to peek under it.#$b#All clean!#$b#I'm very good at this$4"
			],
			"check_mean": [
				"#$p 102#%You consider finding someone you can check.|I-I don't need your help, I'm a big girl.$2"
			],
			"cooldown_check": [
				"#$p 102#%You consider finding someone you can check.|%Jas doesn't seemed to have changed since the last time you checked."
			],
			//They check you
			"soiled_change_verynice": [
				"#$p 102#%You think about looking for someone who can help you change.|Do you need me to get Aunt Marnie? She always helps me when I have an accident.$3",
				"#$p 102#%You think about looking for someone who can help you change.|You had an accident. I have a spare pull up just in case I have an accident.#$b#$y 'Do you need it?_Yes please_::380:give:lavender pullup:1::_No thank you._Vincent never wants to change either.'",
				"#$p 102#%You think about looking for someone who can help you change.|You're <wet&icky>. Aunt Marnie makes me carry a spare pull up.#$b#$y 'Do you want it?_Yes please_::380:give:lavender pullup:1::_No thank you._Vincent never wants to change either.'"
			],
			"change_verynice": [
				"#$p 102#%You think about looking for someone who can help you change.|You're dry! Good job!$1",
				"#$p 102#%You think about looking for someone who can help you change.|Aunt Marnie says I'm a big girl when I'm still dry, so you're big now. It's the rules."
			],
			"soiled_change_nice": [
				"#$p 102#%You think about looking for someone who can help you change.|Do you need me to get Aunt Marnie? She always helps me when I have an accident.$3",
				"#$p 102#%You think about looking for someone who can help you change.|You had an accident.$3"
			],
			"change_nice": [
				"#$p 102#%You think about looking for someone who can help you change.|You're dry! Good job!$1",
				"#$p 102#%You think about looking for someone who can help you change.|Aunt Marnie says I'm a big girl when I'm still dry, so you're big now. It's the rules."
			],
			"soiled_change_mean": [
				"#$p 102#%You think about looking for someone who can help you change.|Oh... gross...$3",
				"#$p 102#%You think about looking for someone who can help you change.|Ewww$3",
				"#$p 102#%You think about looking for someone who can help you change.|...$2"
			],
			"change_mean": [
				"#$p 102#%You think about looking for someone who can help you change.|Oh... gross...$3",
				"#$p 102#%You think about looking for someone who can help you change.|Ewww$3",
				"#$p 102#%You think about looking for someone who can help you change.|...$2"
			],
			//Ground
			"ground": [
				"#$p 102#%Jas doesn't seem to notice what happened.|Ewww!$3",
				"#$p 102#%Jas doesn't seem to notice what happened.|Ewww! Don't <pee&poop> there!$3",
				"#$p 102#%Jas doesn't seem to notice what happened.|...$2"
			],
			"ground_attempt": [
				"#$p 102#%Jas doesn't seem to notice what happened.|Eww! Why are you trying to <pee&poop> on on the ground?$3"
			]
		},
		//	                      																																																		
		"jodi": {
			//Use your diaper near them
			"soiled_verynice": [
				"%Jodi leans down to put a comforting hand on your back.#$b#You can tell me if you had a little accident $NICKNAME$$. It's nothing to be ashamed of.",
				"You don't need to rush potty training if you're not ready yet.",
				"It can be hard for little <boys/girls> to remember to go potty sometimes. It's okay.",
				"Oh goodness!$1",
				"Awww, you're so cute when you're embarrassed!$1",
				"#$p 112#Oh dear, looks like a little someone went potty.|Oh dear, Did my little $NICKNAME$ go <tinkle&poopy> in <his/her> diaper?#$b#%Jodi leans down and checks the heft of your diaper. Giving it a few pats when she deems it good for a few more <wettings&messes>."
			],
			"soiled_nice": [
				"$FARMERNAME$, I  think you might need to go change.",
				"You poor thing! Did you just <wet&mess> yourself?"
			],
			"soiled_mean": [
				"You might need to tap into those supplies I left you$4"
			],
			//You check them			
			"check_verynice": [
				"You want to check my diaper?#$b#Don't be silly, I'm not the baby.$1",
				"You want to check my diaper? You silly goose.$1#$b#I think it might be YOUR $UNDERWEAR_NAME$ that needs a check.#$b#%Jodi pulls you forward a little and reaches behind you, pulling your waistband back dramatically.",
				"%You imagine Jodi wearing a diaper and it makes you giggle.#$b#Well, don't you look like a happy little <boy/girl>?$1#$b#What're you thinkin' about?"
			],
			"check_nice": [
				"You want to check my diaper?#$b#Don't be silly, I'm not the baby.$1",
				"%You imagine Jodi wearing a diaper and it makes you giggle."
			],
			"check_mean": [
				"%You try to see if maybe Jodi's wearing a diaper through her pants. It's hard to tell, but you think she probably isn't."
			],
			"cooldown_check": [
				"%Things haven't changed since your last check."
			],
			//They check you			
			"soiled_change_verynice": [
				"%Jodi gives you a quick and efficient diaper check.#$b#That's a <wet&messy> Diaper if I've ever seen one!$1#$b#Let me help you out of that little $FARMERNAME$.#$b#::402:change:lil swabbies:1::",
				"%Jodi takes a quick peek in the back of your $UNDERWEAR_NAME$.#$b#Hold it right there little <mister/missy>, I have to take care of something.#$b#::403:change:lil swabbies:1::",
				"%You tug on Jodi's sleeve and show her your <wet&messy> $UNDERWEAR_NAME$.#$b#Awww, thank you for telling me.#$b#::404:change:lil swabbies:1::",
				"Sweety, come over here a moment, I think you might be in <wet&dirty> pants.#$b#%Jodi hefts the bottom of your diaper and tsks.#$b#Thought so. Hold still for me please.#$b#::403:change:lil swabbies:1::",
				"%Jodi spots you yawning and calls you over for a quick hug. When you settle in her arms, she takes the opportunity to give you a quick check.#$b#::405:change:lil swabbies:1::"
			],
			"change_verynice": [
				"What's that, you think you need a change? Well, let me see.#$b#You silly <boy/girl>, you're as dry as can be!$1",
				"%Jodi gives you a quick and efficient diaper check.#$b#All clean!$1"
			],
			"soiled_change_nice": [
				"#$p 112#::400:give:baby print diaper:1::|Well, I can't leave you in a <wet&messy> diaper, even if you're not my kid.#$b#::401:give:lil swabbies:1::"
			],
			"change_nice": [
				"What's that, you think you need a change? Well, let me see.#$b#You silly <boy/girl>, you're as dry as can be!$1"
			],
			"soiled_change_mean": [
				"I gave you plenty of supplies already. There's instructions on the package.$4",
				"I'm busy taking care of my own kids. I'm sure you can figure it out.$2"
			],
			"change_mean": [
				"I gave you plenty of supplies already. There's instructions on the package.$4",
				"I'm busy taking care of my own kids. I'm sure you can figure it out.$2"
			],
			//Ground
			"ground": [
				"I gave you plenty of diapers and you choose to do that?$3"
			],
			"ground_attempt": [
				"Just use your diaper, no one cares."
			]
		},
		//																																																												
		"kent": {
			"soiled_verynice": [
				"Aww, do you need me to change you out of your <wet&messy> $UNDERWEAR_NAME$?",
				"I think little $NICKNAME$ needs <his/her> diaper changed!",
				"I know a little farmer who needs <his/her> diaper changed!$1"
			],
			"soiled_nice": [
				"You poor thing! Did you just <wet&mess> yourself?",
				"Does someone need a diaper change?"
			],
			"soiled_mean": [
				"You <&really >might want to go change your pants.$u"
			],
			//You check them
			"check_verynice": [
				"What, are you curious what underpants look like?"
			],
			"check_nice": [
				"I'll be fine, you worry about your own pants."
			],
			"check_mean": [
				"What do you think you're looking at?$u"
			],
			"cooldown_check": [
				"%Things haven't changed since the last check."
			],
			//They check you
			"soiled_change_verynice": [
				"Oh, you have something to show me?#$b#Oh! well, you sure are <wet&messy>!$h#$b#I guess that's no surprise. Why don't you head into my room for some privacy and clean yourself up."
			],
			"change_verynice": [
				"<That#Those> $UNDERWEAR_NAME$ <looks#look> just fine to me. Did you just want my attention?"
			],
			"soiled_change_nice": [
				"Oh, yeah, you sure are <wet&messy>... Look, if you need a private place to change, you can use my room.#$b#Just make sure to clean up after yourself."
			],
			"change_nice": [
				"Well, your $UNDERWEAR_NAME$ seem dry to me.#$b#... I guess I check your pants now... Huh."
			],
			"soiled_change_mean": [
				"Oh gross. Go figure it out yourself.$u"
			],
			"change_mean": [
				"Keep it to yourself...$u",
				"Didn't your parents teach you basic privacy?$u"
			],
			//Ground
			"ground": [
				"$FARMERNAME$! Living in the country doesn't make us barbarians!$3",
				"That's not okay! Use a toilet!$3"
			],
			"ground_attempt": [
				"$FARMERNAME$! What are you doing!$3"
			]
		},
		//																																																									
		"krobus": {
			"soiled_verynice": [
				"Ah, the smell of home!$8"
			],
			"soiled_nice": [
				"Oh, oh, let me write that down...#$b#My human behavior research has been difficult without a regular subject to track.$8"
			],
			"soiled_mean": [
				"..?"
			],
			//You check them
			"check_verynice": [
				"$query !LOCATION_NAME Here MovieTheater#%Krobus doesn't seem to be wearing anything for you to check.|%You hear a distinct crinkling under Krobus's trenchcoat.#$b#I made sure my human disguise was as accurate as possible!$9#$b#Well, almost... I haven't used it yet...$9#$b#Maybe during the movie.$9"
			],
			"check_nice": [
				"$query !LOCATION_NAME Here MovieTheater#%Krobus doesn't seem to be wearing anything for you to check.|%Krobus doesn't seem to be wearing a diaper under his trenchcoat.#$b#Oh... I knew I was forgetting a part of my human disguise...$9"
			],
			"check_mean": [
				"$query !LOCATION_NAME Here MovieTheater#%Krobus doesn't seem to be wearing anything for you to check.|%Krobus doesn't seem to be wearing a diaper under his trenchcoat."
			],
			"cooldown_check": [
				"%Things haven't changed since the last check."
			],
			//They check you
			"soiled_change_verynice": [
				"<That#Those> look<s#> quite comfortable, @.$1"
			],
			"change_verynice": [
				"I appreciate the human ingenuity of having a bathroom in your pants.$1"
			],
			"soiled_change_nice": [
				"If you need somewhere to change... my shop is mostly dry.#$b#I don't mind!$1"
			],
			"change_nice": [
				"I see you've kept your $UNDERWEAR_NAME$ clean for now, @.#$b#Hmm... This anomaly certainly muddles up my human behavior research data...$2"
			],
			"soiled_change_mean": [
				"Do you really need to change? It doesn't bother me...$3"
			],
			"change_mean": [
				"I don't see anything wrong..."
			],
			//Ground
			"ground": [
				"$query !LOCATION_NAME Here Sewer#Hmm... Isn't this the wrong place for that?$3|Be careful not to slip!$1#$b#...Oh, don't look so shy. It's a sewer! You're allowed to do that here!$7"
			],
			"ground_attempt": [
				"$FARMERNAME$! What are you doing!$3"
			]
		},
		//																																																									
		"leah": {
			//Use your diaper near them
			"soiled_verynice": [
				"...Oh! Is it change time?",
				"Hehe. I get too focused all the time too. It's OK, Just don't get a rash!$1",
				"Looks like you just made a<n& big> uh-oh...$1#$b#Um... D-Do you... need help changing?$4",
				"%Leah tries to stifle childish giggles at the noises coming from your $UNDERWEAR_NAME$.#$b#%...She definitely needs to work on her poker face.",
				"Hehe... Your face is all scrunchy!#$b#Looks like someone's <a little potty-pants&got the grumpy-dumpies>... *giggle*$1",
				"%Leah watches as you <wet&stink up> your $UNDERWEAR_NAME$.#$b#%You wave at her, and she beams back at you.#$b#Hi, $NICKNAME$.$1",
				"%Leah squirms a little as you noisily <wet&mess> your $UNDERWEAR_NAME$.#$b#*Whisper* $NICKNAME$! You're gonna make me <tinkle&poop> my pants if you keep going potty in yours right next to me!! *pout*$5#$b#Mmf... Dangit! Now I gotta go too!$6",
				"Oh! Hang on... can you hold that face, @?$7#$b#%Leah reaches for her sketchbook and pencil.#$b#...Oh, nevermind, there it went.$2",
				"%Leah looks up from her sketchbook and gives you a sympathetic smile.#$b#Couldn't make it? Aw, that's alright.#$b#...That's what your diapers are for, aren't they?$4",
			],
			"soiled_nice": [
				"*whisper* Uh-oh, $NICKNAME$! You're <peeing&pooping> in your big <boy/girl> $PANTS_NAME$ again! *giggle*$1#$b#...Uh... whoops. Inside thoughts, Leah...$6",
				"*whisper* H-Hey, um... @? C-Could you do that a little further away?$3#$b#<*squirm*&*gurgle*> A-Ah... too late, now I need to go to the toilet too...$7",
				"Ohhh... Okay, so thats why you were making that face!$1",
				"%Leah tries to ignore the <sound&smell> of you <wetting&filling> your $UNDERWEAR_NAME$, but you can see her <blushing shyly&nose crinkle up a little>.",
				"%You notice Leah shyly sneaking glances as you go potty in your $UNDERWEAR_NAME$.#$b#%...She shyly buries her face back into her sketchbook when you wave at her."
			],
			"soiled_mean": [
				"Uh... @..?$6",
				"Oh... You might wanna go change, @...$2",
				"Umm... @? Y-You're... supposed to go to the bathroom for that... I think...$7",
				"...Did you just...$6",
				"Eww<...$2&..!$6>"
			],
			//You check them
			"check_verynice": [
				"%You tug back Leah's waistband, but it's hard to tell if her diaper is used or not beneath blotches of 'Sky Blue', 'Forest Green', and 'Sunflower Yellow'.#$b#%You give it a gentle heft, which confirms your suspicions... It's totally soaked!#$b#Oh. I went? Gosh, I-I didn't even notice! ...Could you, um...$7#$b#%...You nod, and change Leah into a fresh white diaper while she continues painting in her artbook.#$b#%...As soon as the new diaper is on, she absentmindedly wipes her fingers on it, streaking it with paint again.",
				"%Leah hums happily as she doodles something colorful in her sketchbook.#$b#%You're just about to check her diaper when she leans forward a little, and you hear her start letting out tiny grunts of effort.#$b#%Oh dear... It sounds like you really won't need to check her anymore...#$b#*sniff* *sniff* Ohhhh... Oh no. I need a bath now... Dangit...!$2",
				"Ummm... Yes, I-I'd like a change, b-but, I... think... Can you change me after I...$7#$b#%Leah's face turns bright red with embarassment, as the back of her diaper pushes out.#$b#%As soon as she's finished going potty, you quickly take her aside and pull the changing mat out of her bag, putting her into a nice clean diaper.#$b#T-Thanks...$4",
				"*giggle* OK, you can look at my diaper, $NICKNAME$!$1#$b#%Leah sticks her butt out, and slips her waistband down to show off her diaper. It looks pretty saturated...#$b#...It's not poopy, so it should be okay if I wait til I'm done with this drawing.$7#$b#%...You insist on giving her a quick change anyways.",
				"%You check Leah's diaper while she plays with some sculpting clay.#$b#%Based on the heavy brown color it's been stained, you assume she's VERY messy... but one gentle and crinkly butt-pat tells you otherwise.#$b#Oh..!$6#$b#...Hehe, sorry, @. I should have told you that I was painting with a lot of Raw Umber earlier...$4#$b#And, um... I think more of it ended up on me than the canvas...$1",
				"Gosh, my stomach is so upset! I think I'm about to...$2#$b$...Oh, I-I'm so sorry...$6",
				"%You do a quick sniff-check on Leah's diaper. It smells strongly like paint, but you're pretty sure she hasn't gone in it yet.#$b#%If it's a little wet, Leah doesn't seem bothered."

			],
			"check_nice": [
				"Well, um, maybe I did wet... a little... while I was in the zone...$7#$b#%Leah makes sure the coast is clear, before she bashfully slips her waistband down to show a soggy diaper...#$b#%You take her aside and give her a change.#$b#...Th-thanks, @...",
				"%You ask Leah if she wants a diaper change.#$b#...Umm, no thanks! I don't wanna have to stop right now.$7#$b#%Looks like Leah isn't going to budge. Oh well.",
				"%Leah looks uncomfortable, but her diaper is all clean...#$b#*whine* $NICKNAME$, I gotta poop!! But clean-up takes so long... *pout*$2#$b#%Leah reluctantly scampers off to go find the nearest bathroom.",
				"Um, okay. G-Go ahead...#$b#%You take a peek under Leah's pants. Her diaper remains unused, for now...#$b#%...Although there are many smears of paint all over the outside, where she's been wiping her hands off.",
			],
			"check_mean": [
				"Um... What?$7",
				"Hey! Stop that!$5",
				"Huh? What are you doing back there, @??$6"
			],
			"cooldown_check": [
				"%Things haven't changed since your last check."
			],
			//They check you
			"soiled_change_verynice": [
				"%Leah takes you aside and has you lay down. Once your diaper comes off, she waves a hand in front of her nose enthusiastically.#$b#Pee-yew!! You< smell like pee&'re so stinky>, $NICKNAME$! *giggle*$1#$b#::460:change:pawprint diaper:1::",
				"%Leah takes you aside, pulls your $PANTS_NAME$ down to your knees, and gives the <front&back> of your $UNDERWEAR_NAME$ a big smush, giggling at  <the squelchy noise it makes&the squishy feeling>.#$b#Okie-dokie, just leave it to Leah! I'll get you out of those icky pottypants, $NICKNAME$!!$1#$b#::461:change:pawprint diaper:1::",
				"Oh? Um, yeah... You're definitely <soggy&poopy>...$7#$b#If you want a change, I can do that for you!$1#$b#%Leah takes you aside and pulls a changing mat, baby powder, and a diaper out of her bag.#$b#::462:change:pawprint diaper:1::",
				"%Leah stares at your <soaked&packed> diaper for a moment and pretends to hum thoughtfully, but she keeps breaking into giggle-fits.#$b#...$NICKNAME$, I'm busyyyyyyy! I gotta draw this horsey first! Horses are really hard to draw...$1#$b#You'll be okay! Besides, I don't think you REALLY mind having <a #>mushy<&, stinky> $UNDERWEAR_NAME$. Right, $NICKNAME$? *giggle*$4"
			],
			"change_verynice": [
				"Heehee, you have a pretty butt, $NICKNAME$! ...And your $UNDERWEAR_NAME$ would be fun to draw sometime...$1#$b#Umm, but <it's#they're> not soggy or stinky yet? So... you don't NEED to show me right now.$1",
				"%You tug on Leah's sleeve for a diaper check.#$b#Ooh! What are you wearing? Is it one of mine!? Lemme see!!$1#$b#...Heehee, boop!$1#$b#%Leah pokes your $UNDERWEAR_NAME$ with a giggle, before remembering she's supposed to be checking you.#$b#Oh! Right! Umm, <it's#they're> still all clean!$1",
				"%You ask Leah for a check. She tugs the waistband of your $PANTS_NAME$ back, and gives your $UNDERWEAR_NAME$ an appraising once-over.#$b#Hmm... No, <that#those> $UNDERWEAR_NAME$ <looks#look> fine to me...$7#$b#...O-Oh, but it's good that you're keeping track!$4"
			],
			"soiled_change_nice": [
				"$NICKNAME$, you're supposed to tell a grown-up when you have an accident!$7#$b#...Aw, it's OK, I can still do it. But I've gotta stay in the zone! So, don't make me think any boring grown-up thoughts, OK?$1#$b#%Leah distractedly rummages around in her bag, talking excitedly about the pretty animals she's seen outside her cabin lately...#$b#::464:change:baby print diaper:1::",
				"$NICKNAME$, you made an oopsie again... I know it's not your fault, but your tummy must've been <sloshing&gurgling> for a while!$2#$b#Make sure to go to the potty when that happens!<& It's hard to work when you're so stinky next to me!>$7#$b#::465:change:lavender pullup:1::",
				"$NICKNAME$, I gotta finish my drawings, can you change yourself? Or, umm, find a grown-up?$7#$b#If you can't, then I'll do it, but these are for my big-girl work. I don't wanna get distracted and forget to finish them on time again.$2",
				"%You tug on Leah's sleeve, and ask her for a change. She takes a deep breath and sets her tools down.#$b#...S-Sure, I can do that... I should be giving my wrists a break anyways...#$b#%Leah looks around, and finds a clear spot to change your $UNDERWEAR_NAME$.#$b#::462:change:pawprint diaper:1::"
			],
			"change_nice": [
				"%Leah peeks at your $UNDERWEAR_NAME$ very quickly, and can't seem to help but blush a little bit.#$b#Yep! I-It's clean!$6",
				"%You tug on Leah's sleeve for a diaper check, and she makes sure nobody is looking before carefully peeking down your waistband.#$b#Umm... Y-Yeah, it looks clean."
			],
			"soiled_change_mean": [
				"U-Uhh... Oh, gosh! Would you look at that? I need to... fix this shading! S-Sorry!$6#$b#%Leah buries her face into her sketchbook. Looks like she's not gonna help you...",
				"U-Umm s-sorry, I don't really... wear... diapers? So, I don't, um... have any for you..<.$2&!$6>#$b#%...Leah seems to chew over a thought for a moment, but then she shakes it off.#$b#...Sorry...$2"
			],
			"change_mean": [
				"Uhm... n-no?! That's... a little too personal for me, I think!$6"
			],
			//Ground
			"ground": [
				"*cough* *cough* Ugh... Don't do that here, please!$6",
				"H-Hey! Um! You're... supposed to, um...$5#$b#...<*cough*&*gag*> N-Nevermind... too late...$2",
				"Eww, thats yucky.$6",
			],
			"ground_attempt": [
				"H-Hey! Stop!$5#$b#...o-oh, gosh, I didn't mean to yell, sorry...$6",
				"%Leah looks away uncomfortably.",
				"Um... What... Why did you take your $PANTS_NAME$ off..?$7"
			]
		},
		//																																																								
		"leo": {
			"soiled_verynice": [
				"#$p 102#Leo doesn't seem to notice what happened.|Oh! @, you're having potty troubles!$3#$b#Maybe Miss Penny can change you! She's very nice!$1"
			],
			"soiled_nice": [
				"#$p 102#Leo doesn't seem to notice what happened.|You have a strong smell, @. Kind of like <pee&poop>...$3#$b#Is it from being a farmer? ...I don't know what farmers smell like."
			],
			"soiled_mean": [
				"#$p 102#Leo doesn't seem to notice what happened.|Something smells... bad.$2#$b#Oh, it is you.$3"
			],
			//You check them
			"check_verynice": [
				"#$p 102#%You don't think anybody here needs a diaper check.|%You notice that Leo has a pull-up under his shorts.#$b#Miss Penny is trying to potty-train me because I kept having accidents during class...$3#$b#At least now I get to match all of my friends!$1"
			],
			"check_nice": [
				"#$p 102#%You don't think anybody here needs a diaper check.|%You give Leo a quick check, just to make sure he hasn't had an accident in his shorts.#$b#Oh. Thanks, but you don't need to do that.#$b#I'm so fast, like a jungle tiger! I always make it to the grass outside! Haha!$1"
			],
			"check_mean": [
				"#$p 102#%You don't think anybody here needs a diaper check.|%You don't think Leo would even have access to diapers, here on the island..."
			],
			"cooldown_check": [
				"%Things haven't changed since your last check."
			],
			//They check you
			"soiled_change_verynice": [
				"%You think about finding someone who can give you a diaper change..."
			],
			"change_verynice": [
				"%You think about finding someone who can check your diaper..."
			],
			"soiled_change_nice": [
				"%You think about finding someone who can give you a diaper change..."
			],
			"change_nice": [
				"%You think about finding someone who can check your diaper..."
			],
			"soiled_change_mean": [
				"%You think about finding someone who can give you a diaper change..."
			],
			"change_mean": [
				"%You think about finding someone who can check your diaper..."
			],
			//Ground
			"ground": [
				"#$p 102#Leo doesn't seem to notice what happened.|Oh, did you grow up in a jungle too?"
			],
			"ground_attempt": [
				"#$p 102#Leo doesn't seem to notice what happened.|You should do that out in the wilderness, or the scary beasts will smell you and come get you."
			]
		},
		//
			
		
			
			
		"lewis": {
			"soiled_verynice": [
				"Aww, do you need me to change you out of your <wet&messy> $UNDERWEAR_NAME$?",
				"I think little $NICKNAME$ needs <his/her> diaper changed!",
				"I know a little farmer who needs <his/her> diaper changed!$1"
			],
			"soiled_nice": [
				"You poor thing! Did you just <wet&mess> yourself?",
				"Does someone need a diaper change?"
			],
			"soiled_mean": [
				"You <&really >might want to go change your pants.$u"
			],
			//You check them
			"check_verynice": [
				"What, are you curious what underpants look like?"
			],
			"check_nice": [
				"I'll be fine, you worry about your own pants."
			],
			"check_mean": [
				"What do you think you're looking at?$u"
			],
			"cooldown_check": [
				"%Things haven't changed since the last check."
			],
			//They check you
			"soiled_change_verynice": [
				"Oh, you have something to show me?#$b#Oh! Well, you sure are <wet&messy>!$h#$b#I guess that's no surprise. Why don't you head into my room for some privacy and clean yourself up."
			],
			"change_verynice": [
				"<That#Those> $UNDERWEAR_NAME$ <looks#look> just fine to me. Did you just want my attention?"
			],
			"soiled_change_nice": [
				"Oh, yeah, you sure are <wet&messy>... Look, if you need a private place to change, you can use my room.#$b#Just make sure to clean up after yourself."
			],
			"change_nice": [
				"Well, your $UNDERWEAR_NAME$ seem dry to me.#$b#... I guess I check your pants now... Huh."
			],
			"soiled_change_mean": [
				"Oh gross. Go figure it out yourself.$u"
			],
			"change_mean": [
				"Keep it to yourself...$u",
				"Didn't your parents teach you basic privacy?$u"
			],
			//Ground
			"ground": [
				"$FARMERNAME$! Living in the country doesn't make us barbarians!$3",
				"That's not okay! Use a toilet!$3"
			],
			"ground_attempt": [
				"$FARMERNAME$! What are you doing!$3"
			]
		},
		//																																																									
		"linus": {
			"soiled_verynice": [
				"...Ah. I thought I recognized that face you're making, little sprout.$1",
				"Is this how you get in touch with nature, little $NICKNAME$? Certainly a... unique method.$1",
				"That's it, let your worries go, little one.#$b#...Though, next time, perhaps you should push them into the soil instead of your $PANTS_NAME$...$1"
			],
			"soiled_nice": [
				"It's alright little one, you can go whenever you need to when you're out here...#$b#But, er... maybe try pulling your $PANTS_NAME$ *down* next time?$1",
				"Oh, is it happening again? ...Never mind, judging by the face you're making<& and that unmistakable odor>, I can already tell that's a \"Yes\"."
			],
			"soiled_mean": [
				"Oh, my... That's unfortunate. Are you alright? <&...You didn't eat any poisonous berries, did you?>$3",
				"Are you well, young one? You seem to have missed a cue or two from your <bladder&bowels>..."
			],
			//You check them
			"check_verynice": [
				"*chuckle* A diaper? Now, why would I need one of those?#$b#My tent may not have plumbing, but this is the great outdoors! There's a bathroom wherever you look!$1",
				"Aw, thanks for worrying about me, little one, but you're the only one who goes in <his/her> $PANTS_NAME$ here.$1#$b#Ah, unless this is your way of saying that I smell bad?$2#$b#...Perhaps I'll take a rinse under the falls tonight, just in case.$1"
			],
			"check_nice": [
				"%You're pretty sure that Linus doesn't wear diapers... but the crinkling and rustling sounds of his leaf-suit still reminds you of one."
			],
			"check_mean": [
				"%You can't really see if Linus is wearing a diaper under his big bulky leaf-tunic."
			],
			"cooldown_check": [
				"%Things haven't changed since the last check."
			],
			//They check you
			"soiled_change_verynice": [
				"I'm sorry, little sprout. I tried to make a diaper recipe using some simple forage, like fiber and sap, but...#$b#Well, suffice to say I think you're better off sticking with your store-bought kind. They pose a far lower risk of falling apart.$1"
			],
			"change_verynice": [
				"Great job, little sprout! <That#Those> $UNDERWEAR_NAME$ <looks#look> as clean as a mountain spring!$1"
			],
			"soiled_change_nice": [
				"Well, <that#those> $UNDERWEAR_NAME$ <has#have><& certainly> seen better days... You may want to listen more closely whenever your body is telling you something, @.$3",
				"I see... You may change in my tent, if you need more privacy.#$b#But there's no shortage of it when you're this far from town, either."
			],
			"change_nice": [
				"Well, your $UNDERWEAR_NAME$ <looks#look> clean to me! I'm glad to see it, little one.$1"
			],
			"soiled_change_mean": [
				"Eurgh... I'm sorry, young one, but I just don't have anything to help you with.$2#$b#I don't exactly buy things from the store... least of all for things I'd have no use for, myself.$2"
			],
			"change_mean": [
				"*sigh* ...I can't imagine the amount of pollution caused by mass-producing those things...$2#$b#Ah, it's not your fault young one. That's just how the world is...$2"
			],
			//Ground
			"ground": [
				"%Linus notices you're <going tinkle&making poopies> on the ground.#$b#Oh. Well, better out than in, little one.$1#$b#...Plus, that's good for the plants.",
				"%Linus turns away to give you privacy.#$b#...Just be very careful not to wipe yourself with poison ivy, @.#$b#It is a very unpleasant lesson to learn that the hard way. *chuckle*$1",
				"%Linus politely averts his gaze while you do your business.#$b#Make sure you're mindful of the wildlife. Bury your business when you're all done."
			],
			"ground_attempt": [
				"Err... $FARMERNAME$? It doesn't look like nature is calling... you can stop trying to answer.$2"
			]
		},
		//																																																									
		"marnie": {
			"soiled_verynice": [
				"%As you pass by Marnie, she grabs you by the wrist.#$b#Hold your horses! Something <smells&stinks>, and it ain't my animals!$3#$b#%She firmly pats your butt, squishing your <wet&messy> $UNDERWEAR_NAME$ with a sigh escaping her lips.#$b#You're such a handful @!$1",
				"Look, $FARMERNAME$, you know that using the bathroom isn't the end of the world, right?$3#$b#C'mon, I know you can do it.",
				"*Sigh* Have you made it to the potty at all today? Are you even trying?",
				"Need to take a short bathroom break?$3#$b#Oh, you're all red now!$1#$b#You know, using the potty is a lot less embarrassing. Food for thought."
			],
			"soiled_nice": [
				"%As you pass by Marnie, she grabs you by the wrist.#$b#Hold your horses! Something <smells&stinks>, and it ain't my animals$3",
				"Look, $FARMERNAME$, you know that using the bathroom isn't the end of the world, right?$3",
				"Need to take a short bathroom break?#$b#Don't get too upset at me, I'm just teasing!$1",
				"You know, using the potty is a lot less embarrassing.$3",
				"Oh! Are you in a rush? Don't mind me then, git going!$1"
			],
			"soiled_mean": [
				"Something <smells&stinks>, and it ain't my animals.$4"
			],
			//You check them
			"check_verynice": [
				"Yes hun, I am wearing underpants. You know, if you try really hard, you can be wearing them too.#$b#Wouldn't that be nice? Having clean all the time? Never sitting in anything gross?",
				"Why yes, I have kept my pants clean. Now how about you?#$b#%Marnie raises an eyebrow at you expectantly.",
				"%Marnie catches you staring, and you look away with a blush.#$b#Well maybe if you were as interested in wearing them as you are looking at them you would be able to wear them more often.$3"
			],
			"check_nice": [
				"%You can tell whenever Marnie's shirt rides up that she's wearing clean, white panties. You wonder if she's letting them show just enough to try and make you jealous.",
				"%Marnie catches you staring at her pants. You look away with a blush. She doesn't say anything about it."
			],
			"check_mean": [
				"%You can't quite get a good look, but you don't think they're wearing anything out of the ordinary."
			],
			"cooldown_check": [
				"%Things haven't changed since the last check."
			],
			//They check you
			"soiled_change_verynice": [
				"Oh you! Fine, let's go find somewhere nice for you to lie down and take a breather.#$b#::520:change:lavender pullup:1::",
				"%You tug on Marnie's sleeve. She knows that look and immediately goes to check you.#$b#Yup, that's <wet&messy>. Did you even try? *sigh* I guess it doesn't matter. Lie down.$3#$b#::520:change:lavender pullup:1::",
				"%You tug on Marnie's sleeve. She knows that look and immediately goes to check you.#$b#*sigh* C'mon, $FARMERNAME$, you can do better than this. Let's get you cleaned up.$3#$b#::520:change:lavender pullup:1::",
				"Hold up there.$3#$b#%Marnie tugs the back of your $UNDERWEAR_NAME$ and tsks.#$b#Yup, you're <wet&messy>.#$b#::521:change:lavender pullup:1::",
				"What've you got there?#$b#%Marnie checks you diaper quickly and efficiently.#$b#Oh $FARMERNAME$, were you even trying? C'mon, let's get you cleaned up.#$b#::523:change:lavender pullup:1::"
			],
			"change_verynice": [
				"%Marnie sees you standing nearby and takes the opportunity to give you a quick check.#$b#All clean, that's what I like to see.$1",
				"%Marnie sees you standing nearby and takes the opportunity to give you a quick check.#$b#All clean! Good job! Why don't you take a pit stop at your farm and give that potty a try.$1",
				"Look how proud you are showing me you're all dry! Isn't that so much better than being yucky?$1"
			],
			"soiled_change_nice": [
				"Oh, yeah, you sure are <wet&messy>... Look, if you need a private place to change, you can use my room.$3#$b#Just make sure to clean up after yourself.",
				"What've you got there?#$b#%You blush and show Marnie your $UNDERWEAR_NAME$.#$b#::522:give:lavender pullup:1::"
			],
			"change_nice": [
				"%Marnie sees you standing nearby and takes the opportunity to give you a quick check.#$b#All clean, that's what I like to see.",
				"Look how proud you are showing me you're all dry!$1"
			],
			"soiled_change_mean": [
				"You're not my kid. Go figure it out.$3"
			],
			"change_mean": [
				"You're not my kid. Go figure it out.$3"
			],
			//Ground
			"ground": [
				"$FARMERNAME$! Living in the country doesn't make us barbarians!$3",
				"That's not okay! Use a toilet!$3"
			],
			"ground_attempt": [
				"$FARMERNAME$! What are you doing!$3"
			]
		},
		//																																																									
		"maru": {
			//Use your diaper near them
			"soiled_verynice": [
				"Eh, don't worry about it. There's more important things to pay attention to!$1",
				"Had better things to do than stop right now, huh?$1",
				"%Maru gives you a quiet little hum of approval.",
				"%As you <let go of your pee&bend your knees and push>, Maru <blushes and grins at you&playfully waves a hand next to her nose>.#$b#Phew! <Sounds&Smells> like someone was holding that in for a while!$1",
				"Hehe... nice.$1#$b#...Just make sure you change that before you get a rash, OK?$3",
				"*whisper* These things sure are efficient, huh?$4",
				"*giggle* ...You really don't seem to mind <wetting&messing> yourself, huh?$1#$b#Well... Truth be told, I don't mind doing it either.$1"
			],
			"soiled_nice": [
				"Isn't that... uncomfortable?$2",
				"How are you just okay with that?$8#$b#I-I mean, not in a mean way...$9#$b#It's just... Doesn't it feel bad?$2",
				"You really don't seem to mind <wetting&messing> yourself, do you..?",
				"I guess you can just do that right here... Huh...$2"
			],
			"soiled_mean": [
				"Did you just..!?$9#$b#Um...$2",
				"Just.. right here?$9"
			],
			//You check them
			"check_verynice": [
				"%Maru giggles when you ask, and shows you her soaked diaper.#$b#I guess I've been in this one longer than I thought.$1",
				"%Maru giggles when you ask, and shows you her stinky diaper.#$b#I guess I've been in this one longer than I thought!$1",
				"%Maru hardly notices when you reach over to feel how squishy her diaper is.#$b#%...She looks busy. You'll leave her to it.",
				"%You can smell Maru's diaper when you pass her.#$b#%You make a dramatic sniff to get her attention, but she just giggles and gets back to work.",
				"My diaper? Oh, I'm sure that isn't much of a mystery.$1#$b#%Maru wiggles her bottom at you... You can easly tell how swollen her diaper is through her overalls."
			],
			"check_nice": [
				"W-What!? I-I'm not...$9#$b#%You already caught the shape of her diaper through her overalls, but you're afraid of causing lasting damage if she blushes any harder."
			],
			"check_mean": [
				"%You think Maru would look cute in diapers with her overalls... Though you're pretty sure she isn't wearing one."
			],
			"cooldown_check": [
				"%Things haven't changed since your last check."
			],
			//They check you
			"soiled_change_verynice": [
				"Sure, I could take a break!#$b#::540:change:space diaper:1::",
				"Wow, you sure are <wet&messy>! Let me help you with that.#$b#::541:change:space diaper:1::",
				"%Maru gives your <sodden&loaded> $UNDERWEAR_NAME$ a firm smushing before giving you a succinct nod.#$b#I diagnose you with <soggy&stinky> <boy/girl> disease. And the treatment is changies!$1#$b#%Maru peels off your dirty $UNDERWEAR_NAME$ and carefully balls <it#them> up...#$b#::545:change:space diaper:1::",
			],
			"change_verynice": [
				"Sure, I could take a break!#$b#...Wait just a second, you don't need a change!$3#$b#Are you just trying to trick me?$1",
				"*laughing* @, you're supposed to soil your $UNDERWEAR_NAME$ BEFORE you ask me to change them.#$b#...Do you want to try that again?$4"
			],
			"soiled_change_nice": [
				"W-Well... U-Ummm. I don't know if I can.$2#$b#You can change in my room if you need to though, I don't mind. Honest!"
			],
			"change_nice": [
				"I-I didn't realize you needed a... a...$9#$b#Wait, you're dry! Are you trying to trick me?$8"
			],
			"soiled_change_mean": [
				"Huh!? I thought you were able to change yourself, @?$9#$b#...@, if you're injured to the point that you can't do simple tasks, you need to schedule a visit with Doctor Harvey!$5"
			],
			"change_mean": [
				"Wh-what!?$9#$b#I-I mean... No??$8"
			],
			//Ground
			"ground": [
				"$query LOCATION_IS_INDOORS Here#@!! Go use the toilet! You could get people sick, doing that!$5|@, you should really find a bathroom when you need to go.$9#$b#...O-Or, uh, wear some protection, and use that instead.",
				"$query LOCATION_IS_INDOORS Here#Hey!! Don't contaminate my work-space!$9|U-Um... Did you just <pee&poop> on the ground??#$b#<I guess that's... probably better than soaking your pants...$2&If that happens again, you should keep it contained to your underwear, and just worry about the clean-up later. Human feces can transmit all kinds of diseases to the wildlife!$8>",
				"@, if you aren't going to use the facilities like a grown-up, then you need to be in a diaper.$8#$b#Nurse's orders.$3",
				"@!! That's so unsanitary!$9#$b#The floor is not a toilet.$5"
			],
			"ground_attempt": [
				"$query PLAYER_FRIENDSHIP_POINTS Current Maru 0 1499#Waah! %firstnameletter-@!! P-Put your pants back on!$9|Um, @? You shouldn't be taking off your $PANTS_NAME$ in full public view.#$b#...I mean, you should really be wearing diapers. It's what they're for!$4"
			]
		},
		//																																																								
		"pam": {
			"soiled_verynice": [
				"Aww, do you need me to change you out of your <wet&messy> $UNDERWEAR_NAME$?",
				"I think little $NICKNAME$ needs <his/her> diaper changed!",
				"I know a little farmer who needs <his/her> diaper changed!$1"
			],
			"soiled_nice": [
				"You poor thing! Did you just <wet&mess> yourself?",
				"Does someone need a diaper change?"
			],
			"soiled_mean": [
				"You <&really >might want to go change your pants.$u"
			],
			//You check them
			"check_verynice": [
				"What, are you curious what underpants look like?"
			],
			"check_nice": [
				"I'll be fine, you worry about your own pants."
			],
			"check_mean": [
				"What do you think you're looking at?$u"
			],
			"cooldown_check": [
				"%Things haven't changed since the last check."
			],
			//They check you
			"soiled_change_verynice": [
				"Oh, you have something to show me?#$b#Oh! well, you sure are <wet&messy>!$h#$b#I guess that's no surprise. Why don't you head into my room for some privacy and clean yourself up."
			],
			"change_verynice": [
				"<That#Those> $UNDERWEAR_NAME$ <looks#look> just fine to me. Did you just want my attention?"
			],
			"soiled_change_nice": [
				"Oh, yeah, you sure are <wet&messy>... Look, if you need a private place to change, you can use my room.#$b#Just make sure to clean up after yourself."
			],
			"change_nice": [
				"Well, your $UNDERWEAR_NAME$ seem dry to me.#$b#... I guess I check your pants now... Huh."
			],
			"soiled_change_mean": [
				"Oh gross. Go figure it out yourself.$u"
			],
			"change_mean": [
				"Keep it to yourself...$u",
				"Didn't your parents teach you basic privacy?$u"
			],
			//Ground
			"ground": [
				"$FARMERNAME$! Living in the country doesn't make us barbarians!$3",
				"That's not okay! Use a toilet!$3"
			],
			"ground_attempt": [
				"$FARMERNAME$! What are you doing!$3"
			]
		},
		//																																																									
		"penny": {
			//Use your diaper near them
			"soiled_verynice": [
				"$FARMERNAME$! You're <wetting&messing> your $UNDERWEAR_NAME$!$5#$b#Why didn't you tell me you needed the potty?$3#$b#*Sigh* It's okay, we can try again next time.",
				"%Penny watches you with an eyebrow raised.#$b#Is there something you want to tell me @?$3",
				"%Penny waits until you're all finished before tugging your waistband for a check.#$b#Looks like you didn't save anything for the potty, little <boy/girl>.$1",
				"%You tug on Penny's sleeve for help to go potty, right before <wetting&messing> your $UNDERWEAR_NAME$.#$b#Oh no, you were so close!$3#$b#I'm not mad, I know you're trying. You'll get the hang of it really soon.",
				"Did you have an accident in your $UNDERWEAR_NAME$ @?#$b#You have to tell me as soon as your body says you have to go potty, okay?$3",
				"#$p 102#Did you have an accident in your $UNDERWEAR_NAME$ @?|You have the same potty face as Vincent.$1#$b#Do you need help getting changed like him too?#$b#%Penny tickles your tummy teasingly.",
				"I saw that.$3#$b#$y 'Was that REALLY an accident?_Uh huh, I tried to hold it._Oh $FARMERNAME$, I know it's hard for you. I'm very proud of you for trying._I didn't wanna use the potty._$FARMERNAME$, I know it's hard for you, but you still have to try, okay?$3'",
				"We're supposed to do that on the potty $NICKNAME$. What happened?$3#$b#It's okay, I'm not angry. You're trying really hard. It's okay if you still have accidents sometimes.#$b#<Boys/Girls> are easy to clean!$1"
			],
			"soiled_nice": [
				"You might wanna change. Just in case someone else says something.",
				"A-are you okay?$3",
				"Do you need help making it to the potty?",
				"I'm sorry. That can't feel good.$3"
			],
			"soiled_mean": [
				"...$5",
				"Uhmm...$2",
				"...Oh.$2",
				"#$p 102#D-did you...|You too?$5"
			],
			//You check them
			"check_verynice": [
				"#$p 102#%You don't think Penny's the type to wear a diaper.|%You imagine Penny wearing a diaper, and then you imagine Vincent and Jas having to teach her at the library. It makes you giggle.",
				"%You barely catch a glimpse of Penny's panties.#$b#Now what are you blushing about little $FARMERNAME$?$1#$b#Do you think you need to go potty?"
			],
			"check_nice": [
				"%You don't think Penny's the type to wear a diaper.",
				"#$p 102#%You don't think Penny's the type to wear a diaper.|%You imagine Penny wearing a diaper, and then you imagine Vincent and Jas having to teach her at the library. It makes you giggle."
			],
			"check_mean": [
				"%You don't think Penny's the type to wear a diaper."
			],
			"cooldown_check": [
				"%Things haven't changed since your last check."
			],
			//They check you
			"soiled_change_verynice": [
				"Oh no, $FARMERNAME$, you're <soaked&messy>. Why didn't you tell me you needed the potty?$3#$b#*Sigh* It's okay, we can try again next time. Let's get you cleaned up.#$b#::582:change:lavender pullup:1::",
				"Hold on, let me check something.#$b#%Penny discreetly places a palm on your bottom, her expression hardening.#$b#Why didn't you tell me you had to go potty?$5#$b#Well it's too late now. Let's get you cleaned up.$3#$b#::582:change:lavender pullup:1::",
				"Awww, did you have a little accident? Let me help you out of that <soggy&icky> $UNDERWEAR_NAME$#$b#::583:change:lavender pullup:1::",
				"$FARMERNAME$, do you have something you want to tell me?$3#$b#%You squirm shyly before showing Penny your <wet&messy> $UNDERWEAR_NAME$.@#b#Well, there's nothing to do about that now, is there. Let's get you cleaned up.#$b#::583:change:lavender pullup:1::",
				"%You tug on Penny's sleeve, and her first instinct is to check your $UNDERWEAR_NAME$.#$b#Goodness, you sure did <soak&fill> this one.$1#$b#Hmmmm... You're already <wet&messy>. You might as well make sure it's all out before I get you a change.$4"
			],
			"change_verynice": [
				"You seem dry. Are you telling me you need to potty?#$b#$y 'Can you try for me?_Yeah!_Good <boy/girl>! Go ahead, I'm watching._*shake your head*_Now now $FARMERNAME$, you know you're supposed to use the potty. Can you try for me? Please?$5'",
				"You're all clean, good job!",
				"*giggles* Are you trying to brag?$1#$b#Well I'm very impressed you're still dry. Good job$4",
				"Look at you staying dry!$1#$b#I think now's a good time to try and potty like a big <boy/girl>. Can you do that for me?"
			],
			"soiled_change_nice": [
				"Oh no, you're all <wet&messy>.$3#$b#Well, I'm sure it was an accident. Why don't you go get cleaned up."
			],
			"change_nice": [
				"You seem dry. Are you telling me you need to potty?",
				"You're all clean, good job!",
				"Do you need help making it to the potty?"
			],
			"soiled_change_mean": [
				"U-uhm...$2#$b#I-I'm busy$3."
			],
			"change_mean": [
				"U-uhm...$2#$b#I-I'm busy$3."
			],
			//Ground
			"ground": [
				"You made it in the potty! Good job!$1",
				"Look at you, keeping your pants <dry&clean>.",
				"You should be proud of yourself for making it to the potty.#$b#I know I'm proud of you!$4",
				"You did it!$1",
				"Good job little $FARMERNAME$."
			],
			"ground_attempt": [
				"Good try using the potty. You'll get it next time!$1",
				"Thank you for trying little @."
			]
		},
		//																																																										
		"pierre": {
			"soiled_verynice": [
				"Aww, do you need me to change you out of your <wet&messy> $UNDERWEAR_NAME$?",
				"I think little $NICKNAME$ needs <his/her> diaper changed!",
				"I know a little farmer who needs <his/her> diaper changed!$1"
			],
			"soiled_nice": [
				"You poor thing! Did you just <wet&mess> yourself?",
				"Does someone need a diaper change?"
			],
			"soiled_mean": [
				"You <&really >might want to go change your pants.$u"
			],
			//You check them
			"check_verynice": [
				"What, are you curious what underpants look like?"
			],
			"check_nice": [
				"I'll be fine, you worry about your own pants."
			],
			"check_mean": [
				"What do you think you're looking at?$u"
			],
			"cooldown_check": [
				"%Things haven't changed since the last check."
			],
			//They check you
			"soiled_change_verynice": [
				"Oh, you have something to show me?#$b#Oh! well, you sure are <wet&messy>!$h#$b#I guess that's no surprise. Why don't you head into my room for some privacy and clean yourself up."
			],
			"change_verynice": [
				"<That#Those> $UNDERWEAR_NAME$ <looks#look> just fine to me. Did you just want my attention?"
			],
			"soiled_change_nice": [
				"Oh, yeah, you sure are <wet&messy>... Look, if you need a private place to change, you can use my room.#$b#Just make sure to clean up after yourself."
			],
			"change_nice": [
				"Well, your $UNDERWEAR_NAME$ seem dry to me.#$b#... I guess I check your pants now... Huh."
			],
			"soiled_change_mean": [
				"Oh gross. Go figure it out yourself.$u"
			],
			"change_mean": [
				"Keep it to yourself...$u",
				"Didn't your parents teach you basic privacy?$u"
			],
			//Ground
			"ground": [
				"$FARMERNAME$! Living in the country doesn't make us barbarians!$3",
				"That's not okay! Use a toilet!$3"
			],
			"ground_attempt": [
				"$FARMERNAME$! What are you doing!$3"
			]
		},
		//																																																									
		"robin": {
			"soiled_verynice": [
				"Oh goodness, I guess you are just a little <boy/girl>!$1",
				"Seems like someone was just a little too distracted.$1",
				"Oh it's okay, I know you were too focused on playing. Well go on I'm not stopping you.",
				"I think it might be time for a break there little <boy/girl>.$1",
				"It's okay, I get a little distracted too sometimes.#$b#Well, not that distracted.$1",
				"Oh, was someone a little too caught up?"
			],
			"soiled_nice": [
				"I think it might be time for a break.",
				"Seems like someone was just a little too distracted.",
				"Oh, was someone a little too caught up with play time?"
			],
			"soiled_mean": [
				"You <&really >might want to go change your pants.$u"
			],
			//You check them
			"check_verynice": [
				"%You try to imagine Robin in a diaper, but your mental image eventually settles on a Santa suit.#$b#Whatchya thinkin' about there little <guy/lady>?#$b#*giggles* Well, if I'm Santa, then you'll have to be my little elf.#$b#%Robin boops your nose affectionately."
			],
			"check_nice": [
				"%You try to imagine Robin in a diaper, but your mental image eventually settles on a Santa suit.#$b#Whatchya thinkin' about?#$b#%You just giggle and blush."
			],
			"check_mean": [
				"%You don't think Robin would appreciate you trying to check her."
			],
			"cooldown_check": [
				"%Things haven't changed since the last check."
			],
			//They check you
			"soiled_change_verynice": [
				"I see a little <boy/girl> who was too busy to keep their diaper <dry&clean>.$1",
				"I'm sorry, I haven't had diapers in the house since Maru was little. You can change in my room if you need space."
			],
			"change_verynice": [
				"<That#Those> $UNDERWEAR_NAME$ <looks#look> just fine to me. Did you just want my attention?",
				"Oh you're fine. Don't worry about it, go play."
			],
			"soiled_change_nice": [
				"I'm sorry, I haven't had diapers in the house since Maru was little. You can change in my room if you need space."
			],
			"change_nice": [
				"Oh you're fine. Don't worry about it, go play."
			],
			"soiled_change_mean": [
				"Oh gross. Go figure it out yourself.$u"
			],
			"change_mean": [
				"Keep it to yourself...$u",
				"Didn't your parents teach you basic privacy?$u"
			],
			//Ground
			"ground": [
				"$FARMERNAME$! Living in the country doesn't make us barbarians!$3",
				"That's not okay! Use a toilet!$3"
			],
			"ground_attempt": [
				"$FARMERNAME$! What are you doing!$3"
			]
		},
		//																																																									
		"sam": {
			//Use your diaper near them
			"soiled_verynice": [
				"#$p 102#Oh man, that was pretty hard to miss!$1|Man, you're just like Vincent.$1",
				"Are you okay buddy?#$b#$y 'Do you want some help with that?_Yes please._::646:change:baby print diaper:1::_Not yet!_Looks like the little <boy/girl> wants to stay <wet&messy> a bit longer!$1'",
				"It's okay $NICKNAME$. Accidents are nothing to be ashamed of.",
				"Awwww, look at you go! That must have felt good.$4",
				"Oh man, that was pretty hard to miss!$1",
				"Good one!$1",
				"Man, you're such a little baby sometimes.#$b#%Sam giggles a bit as he pats your squishy bottom.",
				"Awww, did the little farmer have a little accident?",
				"I bet I could get Mommy to go change you.$3#$b#I'm kidding I'm kidding!$1",
				"Man, it looks like you really need diapers, don't you.",
				"Oh wow, you really <wet&messed> yourself!#$b#$y 'Can I feel it?_Yes._%Sam blushes as he presses his hand into your squishy diaper._No thank you._Okay, I won't.'"
			],
			"soiled_nice": [
				"You might wanna change. Just in case someone else says something.$7",
				"A-are you okay?$8",
				"%Sam just blushes a as you <wet&mess> yourself. You take note of how closely he watches the whole scene.",
				"Oh man, I'm sorry. That can't feel good."
			],
			"soiled_mean": [
				"I'm just..never mind.$5",
				"This is pretty awkward.$2",
				"...Oh$2",
				"You might want to take care of that...",
				"#$p 102#You might want to take care of that...|Great, more potty issues to be witness to. Thanks.$5"
			],
			//You check them
			"check_verynice": [
				"H-hey! My diaper is nice and dry!",
				"%Sam's diaper is dry to your surprise. You wonder how long that'll last",
				"%You pull back Sam's leak guards to find his diaper sodden and squishy.#$b#Sorry! I had too many juice boxes and the potty was just too far away!$10",
				"%You pull back at Sam's waistband. Yeesh! The little tyke sure had to go, if he messed anymore you'd worry you'd have some teary eyes on your hands.",
				"$y 'You can see Sam's full diaper peeking below his snapped onesie from a mile away._Looks like a certain someone had to go._I... I didn't even notice I went potty...$8_I know a little stinker who needs a change_H-huh?!$8*%You lay Sam down and untape his full diaper, wipe him down, and tape him up in his favorite race car diaper.'",
				"I was hoping you wouldn't notice.$10#$b#%Sam blows a raspberry at you"
			],
			"check_nice": [
				"Told you I'm dry! I'm not a potty pants like you!$1",
				"I-I just had too much to drink that's all!",
				"#$p 102#Sorry... I hope you don't mind the smell, I just really didn't feel like changing.$10|Sorry... Vincent had an accident and I didn't want him to feel so left out.$9#$b#Psst... Don't tell him I was just jealous...$4"
			],
			"check_mean": [
				"Are you looking for something?#$b#%You're too embarrassed to admit you were trying to spot a diaper bulge.",
				"H-HEY! What the hell are you doing?!",
				"%You think if you look just right you can see an outline of a diaper bulge, but it's more likely you're just imagining things."
			],
			"cooldown_check": [
				"%Things haven't changed since your last check."
			],
			//They check you
			"soiled_change_verynice": [
				"Oh buddy, that diaper's <drenched&packed>!, lets take care of that.#$b#::640:change:baby print diaper:1::",
				"Geez! Looks like you sure had fun, we oughta change you before you stink up the place.#$b#::641:change:baby print diaper:1::",
				"Yeesh! That diapers <soaked!&ripe>!#$b#Quick! let's get this on you before someone smells that <soggy&stinky> butt!#$b#::643:change:baby print diaper:1::",
				"#$p 102#Yeah, that sure is a <wet&messy> $UNDERWEAR_NAME$ You've got!|Yeah, that sure is a <wet&messy> $UNDERWEAR_NAME$ You've got!#$b#Here, I snagged one of Vincent's diapers. I bet you can fit into it.#$b#::642:change:lil swabbies:1::"
			],
			"change_verynice": [
				"Your diaper looks nice and dry to me.#$b#%Sam pats your bottom softly",
				"<That#Those> $UNDERWEAR_NAME$ <looks#look> just fine to me, silly. Did you just want my attention?#$b#%You giggle a little and stick your tongue out at Sam.#$b#He grins and sticks his out right back at you."
			],
			"soiled_change_nice": [
				"Yeesh! That diapers <soaked!&ripe>!#$b#Quick! let's get this on you before someone smells that <soggy&stinky> butt!#$b#::643:give:lil swabbies:1::"
			],
			"change_nice": [
				"Your diaper looks nice and dry to me.#$b#%Sam pats your head softly"
			],
			"soiled_change_mean": [
				"Oh gross, no!"
			],
			"change_mean": [
				"O-ohh... Uhmm... I think I'm too busy.$8"
			],
			//Ground
			"ground": [
				"Eww. Is that normal in the city?$5",
				"What... Ugh!$5",
				"Did you just <pee&poop> on the ground? Gross!$5"
			],
			"ground_attempt": [
				"What... Put your pants back on!$5"
			]
		},
		//																																																										
		"sandy": {
			"soiled_verynice": [
				"Aww, do you need me to change you out of your <wet&messy> $UNDERWEAR_NAME$?",
				"I think little $NICKNAME$ needs <his/her> diaper changed!",
				"I know a little farmer who needs <his/her> diaper changed!$1"
			],
			"soiled_nice": [
				"You poor thing! Did you just <wet&mess> yourself?",
				"Does someone need a diaper change?"
			],
			"soiled_mean": [
				"You <&really >might want to go change your pants.$u"
			],
			//You check them
			"check_verynice": [
				"What, are you curious what underpants look like?"
			],
			"check_nice": [
				"I'll be fine, you worry about your own pants."
			],
			"check_mean": [
				"What do you think you're looking at?$u"
			],
			"cooldown_check": [
				"%Things haven't changed since the last check."
			],
			//They check you
			"soiled_change_verynice": [
				"Oh, you have something to show me?#$b#Oh! well, you sure are <wet&messy>!$h#$b#I guess that's no surprise. Why don't you head into my room for some privacy and clean yourself up."
			],
			"change_verynice": [
				"<That#Those> $UNDERWEAR_NAME$ <looks#look> just fine to me, silly! Did you just want my attention?"
			],
			"soiled_change_nice": [
				"Oh, yeah, you sure are <wet&messy>... Look, if you need a private place to change, you can use my room.#$b#Just make sure to clean up after yourself."
			],
			"change_nice": [
				"Well, your $UNDERWEAR_NAME$ seem dry to me.#$b#... I guess I check your pants now... Huh."
			],
			"soiled_change_mean": [
				"Oh gross. Go figure it out yourself.$u"
			],
			"change_mean": [
				"Keep it to yourself...$u",
				"Didn't your parents teach you basic privacy?$u"
			],
			//Ground
			"ground": [
				"$FARMERNAME$! Living in the country doesn't make us barbarians!$3",
				"That's not okay! Use a toilet!$3"
			],
			"ground_attempt": [
				"$FARMERNAME$! What are you doing!$3"
			]
		},
		//																																																									
		"sebastian": {
			//Use your diaper near them
			"soiled_verynice": [
				"Awww, you're so cute when you're embarrassed!$1",
				"Where's your mommy $NICKNAME$? I think you need a change."
			],
			"soiled_nice": [
				"Did you just <wet&mess> yourself $FARMERNAME$?",
				"Just letting you know $FARMERNAME$, you should probably change your diaper soon."
			],
			"soiled_mean": [
				"...$5",
				"...Did you just...$2"
			],
			//You check them
			"check_verynice": [
				"Well, if you're that curious...#$b#%They give you the smallest peek.#$b#All right, show's over$1"
			],
			"check_nice": [
				"*snickers* What, you think I'm a baby?"
			],
			"check_mean": [
				"Back off.$u"
			],
			"cooldown_check": [
				"%Things haven't changed since your last check."
			],
			//They check you
			"soiled_change_verynice": [
				"soiled very nice change"
			],
			"change_verynice": [
				"<That#Those> $UNDERWEAR_NAME$ <looks#look> just fine to me. Did you just want my attention?"
			],
			"soiled_change_nice": [
				"soiled nice change"
			],
			"change_nice": [
				"<That#Those> $UNDERWEAR_NAME$ <looks#look> just fine to me. Did you just want my attention?"
			],
			"soiled_change_mean": [
				"Yuck! You smell <like pee&disgusting>! Get it away from me!$u"
			],
			"change_mean": [
				"What?! No I won't check your pants, go bother someone else.$u"
			],
			//Ground
			"ground": [
				"Eww. Is that normal in the city?$5",
				"What... Ugh!$5",
				"Did you just <pee&poop> on the ground? Gross!$5"
			],
			"ground_attempt": [
				"What... Put your pants back on!$5"
			]
		},
		//																																																								
		"shane": {
			//Use your diaper near them
			"soiled_verynice": [
				"Awww, you're so cute when you're embarrassed!$1",
				"Where's your mommy $NICKNAME$? I think you need a change."
			],
			"soiled_nice": [
				"Did you just <wet&mess> yourself $FARMERNAME$?",
				"Just letting you know $FARMERNAME$, you should probably change your diaper soon."
			],
			"soiled_mean": [
				"...$5",
				"...Did you just...$2"
			],
			//You check them
			"check_verynice": [
				"Well, if you're that curious...#$b#%They give you the smallest peek.#$b#All right, show's over$1"
			],
			"check_nice": [
				"*snickers* What, you think I'm a baby?"
			],
			"check_mean": [
				"Back off.$u"
			],
			"cooldown_check": [
				"%Things haven't changed since your last check."
			],
			//They check you
			"soiled_change_verynice": [
				"soiled very nice change"
			],
			"change_verynice": [
				"<That#Those> $UNDERWEAR_NAME$ <looks#look> just fine to me. Did you just want my attention?"
			],
			"soiled_change_nice": [
				"soiled nice change"
			],
			"change_nice": [
				"<That#Those> $UNDERWEAR_NAME$ <looks#look> just fine to me. Did you just want my attention?"
			],
			"soiled_change_mean": [
				"Yuck! You smell <like pee&disgusting>! Get it away from me!$u"
			],
			"change_mean": [
				"What?! No I won't check your pants, go bother someone else.$u"
			],
			//Ground
			"ground": [
				"Eww. Is that normal in the city?$5",
				"What... Ugh!$5",
				"Did you just <pee&poop> on the ground? Gross!$5"
			],
			"ground_attempt": [
				"What... Put your pants back on!$5"
			]
		},
		//																																																								
		"vincent": {
			"soiled_verynice": [
				"#$p 102#%Vincent doesn't seem to notice what happened.|Mommy told me big kids are supposed to use the potty. #$b#I don't wanna be a big kid either!$1",
				"#$p 102#%Vincent doesn't seem to notice what happened.|%Vincent watches you <wet&mess> yourself and giggles.#$b#Good one!$1",
				"#$p 102#%Vincent doesn't seem to notice what happened.|%You notice Vincent watching as you <wet&mess> yourself.#$b#All better?",
				"#$p 102#%Vincent doesn't seem to notice what happened.|%Vincent watches the whole scene curiously and giggles when you look over. #$b# You <peed&pooped>!$1",
				"#$p 102#%Vincent doesn't seem to notice what happened.|If you want I could ask my mommy to change you.#$b#No?#$b#That's okay, I like being <wet&messy> too!$1",
				"#$p 102#%Vincent doesn't seem to notice what happened.|$NICKNAME$'s <wet&messy> and I'm still dry!$1#$b#...#$b#Wait...$2",
				"#$p 102#%Vincent doesn't seem to notice what happened.|Don't cry, Mommy says it's okay to have accidents sometimes.",
				"#$p 102#%Vincent doesn't seem to notice what happened.|Feel all better?"
			],
			"soiled_nice": [
				"#$p 102#%Vincent doesn't seem to notice what happened.|Don't cry, Mommy says it's okay to have accidents sometimes.",
				"#$p 102#%Vincent doesn't seem to notice what happened.|Don't worry $NICKNAME$, I still do that too!",
				"#$p 102#%Vincent doesn't seem to notice what happened.|Feel all better?",
				"#$p 102#%Vincent doesn't seem to notice what happened.|It smells like you need a diaper change!"
			],
			"soiled_mean": [
				"#$p 102#%Vincent doesn't seem to notice what happened.|%Vincent saw what happened and snickers at you.",
				"#$p 102#%Vincent doesn't seem to notice what happened.|Was that an accident?",
				"#$p 102#%Vincent doesn't seem to notice what happened.|Ha! Gross!$1",
				"#$p 102#%Vincent doesn't seem to notice what happened.|$FARMERNAME$ just <peed&pooped> <himself/herself>!$1",
				"#$p 102#%Vincent doesn't seem to notice what happened.|Hah! I just watched you <pee&poop> yourself!$1"
			],
			//You check them			
			"check_verynice": [
				"#$p 102#%You consider finding someone you can check.|My diaper? It's fine, see?#$b#%Vincent shamelessly slips down his pants to show you his soggy diaper.#$b#Change? Mmmmmm... Maybe later!",
				"#$p 102#%You consider finding someone you can check.|My diaper? It's fine, see?#$b#%Vincent shamelessly slips down his pants to show you his stinky diaper.#$b#Change? Hmmmmm.... Maybe later.",
				"#$p 102#%You consider finding someone you can check.|%You ask about his diaper and he just shrugs and carries on. It's pretty easy to tell he's soggy given how much more his pants bulge out than they normally do.",
				"#$p 102#%You consider finding someone you can check.|%You ask about his diaper and he just shrugs and carries on. He doesn't seem to mind the faint smell following him."
			],
			"check_nice": [
				"#$p 102#%You consider finding someone you can check.|My diaper? It's fine, see?#$b#Vincent shamelessly slips down his pants to show you his soggy diaper.",
				"#$p 102#%You consider finding someone you can check.|My diaper? It's fine, see?#$b#Vincent shamelessly slips down his pants to show you his stinky diaper.",
				"#$p 102#%You consider finding someone you can check.|%You can't help but notice how much Vincent's diaper is bulging his pants outward..."
			],
			"check_mean": [
				"#$p 102#%You consider finding someone you can check.|%It's pretty clear Vincent is wearing a diaper just by the poof of his pants.",
				"#$p 102#%You consider finding someone you can check.|%You can definitely smell his messy diaper. He doesn't seem to care."
			],
			"cooldown_check": [
				"#$p 102#%You consider finding someone you can check.|Things haven't changed since your last check."
			],
			//They check you			
			"soiled_change_verynice": [
				"#$p 102#%You think about looking for someone who can help you change.|%Vincent giggles when you show him your diaper.#$b#Don't worry $FARMERNAME$, I still <pee&poop> in my diapers too.",
				"#$p 102#%You think about looking for someone who can help you change.|*giggles* your $UNDERWEAR_NAME$ <looks#look> comfy.",
				"#$p 102#%You think about looking for someone who can help you change.|Uh oh, you're all <wet&messy>! Don't worry, I know what to do.$1#$b#::720:give:lil swabbies:1::",
				"#$p 102#%You think about looking for someone who can help you change.|Mommy says that it's okay if diapers get <soggy&stinky> cause boys are easy to clean.#$b#Oh wait, here!$1#$b#::720:give:lil swabbies:1::"
			],
			"change_verynice": [
				"#$p 102#%You think about looking for someone who can help you change.|%Vincent giggles when you show him you're diaper.#$b#You're just like me!",
				"#$p 102#%You think about looking for someone who can help you change.|Oh, you're dry? Did you just get changed?$3",
				"#$p 102#%You think about looking for someone who can help you change.|$UNDERWEAR_NAME$<s#> look cute on you!$1"
			],
			"soiled_change_nice": [
				"#$p 102#%You think about looking for someone who can help you change.|%Vincent giggles when you show him you're diaper.#$b#Did you have an accident?",
				"#$p 102#%You think about looking for someone who can help you change.|%Vincent giggles when you show him you're diaper.#$b#Don't worry $FARMERNAME$, I still <pee&poop> in my diapers too."
			],
			"change_nice": [
				"#$p 102#%You think about looking for someone who can help you change.|%Vincent giggles when you show him you're diaper.#$b#You're just like me!"
			],
			"soiled_change_mean": [
				"#$p 102#%You think about looking for someone who can help you change.|Was that an accident?",
				"#$p 102#%You think about looking for someone who can help you change.|Ha! Gross!$1"
			],
			"change_mean": [
				"#$p 102#%You think about looking for someone who can help you change.|$FARMERNAME$'s wearing a diaper!$1",
				"#$p 102#%You think about looking for someone who can help you change.|You're wearing a diaper too?"
			],
			//Ground
			"ground": [
				"#$p 102#%Vincent doesn't seem to notice what happened.|Ewww!$3",
				"#$p 102#%Vincent doesn't seem to notice what happened.|Ewww! Don't <pee&poop> there!$3",
				"#$p 102#%Vincent doesn't seem to notice what happened.|Hey everyone! $FARMERNAME$ just <peed&pooped> on the ground!$1"
			],
			"ground_attempt": [
				"#$p 102#%Vincent doesn't seem to notice what happened.|Eww! Why are you trying to <pee&poop> on on the ground?$3"
			]
		},
		//																																																								
		"willy": {
			"soiled_verynice": [
				"Aye, hardly surprised to hear that noise...$3",
				"Well, guess ya might as well just go ahead 'n get it all out now.",
				"Alright... Time for a change, isn' it, skipper?$3",
				"Now, $NICKNAME$, do ya remember where yer supposed to be doin' that, for next time? *chuckle*$1",
				"Ah, well. We all get a lil' bit sidetracked now n' then. No harm done.$1"
			],
			"soiled_nice": [
				"Ach, poor kid...$2",
				"Skipper, I know it's hard for ya, but try an' make it to the privy when ya start feelin' like yer gonna go, a'right?"
			],
			"soiled_mean": [
				"Ergh... <Lad/Lass>, clear off! Yer spoilin' my appetite.$2",
				"Did ye just... Yeesh, that's <whiffy&rancid>! <&Go find a bathroom and clean yerself up!>$2"
			],
			//You check them
			"check_verynice": [
				"%Willy's pants look damp. Could it be..?#$b#Ahh, I see what yer lookin at now. My trousers just got a good sprayin' of ocean brine a bit ago, <lad/lass>. <...Sorry to get yer hopes up if ya thought we matched, skipper.&>$1",
				"%You ask Willy what kind of diapers he uses on long boating trips.#$b#Skipper... there's a toilet on board...$2#$b#Wait, do ye really think I'm sat there crossin' me legs every time I go out fer the big ones? *chuckle*$1#$b#%...You think he's avoiding the question."
			],
			"check_nice": [
				"Aye, skipper, no need to poke at my bottom. I know how to use the privy! *chuckle*#$b#My ol' Pappy taught me long before you were even a twinkle in yer mam's eye.$3#$b#*sigh* Mighty shame he ain't still around to teach you too. I bet ya would've liked him!",
				"%You try to imagine Willy wearing a diaper.#$b#%It really makes you wonder... What does he do if he needs to go potty out at sea!? There aren't any toilets on the ocean!!"
			],
			"check_mean": [
				"Eh? What're ya gawkin' at my backside for, kiddo?",
				"%You don't see any signs of Willy wearing a diaper..."
			],
			"cooldown_check": [
				"%Things haven't changed since the last check."
			],
			//They check you
			"soiled_change_verynice": [
				"Heh! <That#Those> $UNDERWEAR_NAME$ <looks#look> like ya sent <it#'em> straight to Davy Jones' Locker.$1#$b#Well, if Lewis starts pitchin' a fit over me writing these things off as 'business expenses', he can go there too! *chuckle*$3#$b#::740:change:lil swabbies:1::"
			],
			"change_verynice": [
				"A'yup, that diaper is in ship-shape, skipper.#$b#I hope you're still keepin' yourself proper fed 'n watered though, <lad/lass>! You're only a wee lil' <fella/lady>, after all...$1#$b#I just know it's easy to forget those things when yer all caught up in the art of the craft.$3"
			],
			"soiled_change_nice": [
				"'Fraid I got nothing to help ya, <lad/lass>. And there ain't much of a washroom in the ol' fishin' shop, neither...$2#$b#But, if ya just need safe harbor to change outta that thing, you can duck behind the shop counter.$3#$b#Just don't leave any mess back there for me to clean up, a'right?$1"
			],
			"change_nice": [
				"Aye, you're drier than a sand-dollar, skipper.#$b#You may want to be careful where ya cast your line, in that case... I've seen my share o' soggy breeches as the waves break against the docks.$1"
			],
			"soiled_change_mean": [
				"Sorry, skipper. Nothin' for it but goin' home and getting yerself cleaned up...#$b#Whatever yer doin' here, it can wait.$2",
				"Skipper, I may be gettin' on in years, but my eyes work just fine.$2#$b#I see ya waddlin' around like you lost yer sea-legs, there's no need to be shovin' yer <sodden&stinkin'> tush in my face.$2"
			],
			"change_mean": [
				"<Lad/Lass>, have some decency. I'm not your Pappy, I don't need to be receivin' updates on the state o' your potty-trainin'.$2"
			],
			//Ground
			"ground": [
				"Ach, now what are you doin' that for, <lad/lass>!?$2",
				"...Is all the salt-air gettin' to yer head, <lad/lass>? You're makin' a mess of things!$2"
			],
			"ground_attempt": [
				"Eh? $FARMERNAME$! What're ya doing!? Pull yer trousers up!!$2"
			]
		},
		//																																																									
		"wizard": {
			"soiled_verynice": [
				"*sigh* If you were to leak upon a spell circle, it could have catastrophic results. Here, allow me.#$b#::760:change:space diaper:1::"
			],
			"soiled_nice": [
				"I would much prefer that you do your business far, far away from any active spell circles.#$b#Introducing any foreign substance to an ongoing ritual can have dire consequences..."
			],
			"soiled_mean": [
				"I sense an ill omen in the air...$1#$b#...Ah. Never mind.#$b#Please take care of that immediately. I'm afraid the 'why' may be a bit too complicated for you, but it is very important."
			],
			//You check them
			"check_verynice": [
				"You know, those rumors about wizards 'vanishing' their excrement is pure and utter drivel.#$b#Mind you, it is possible -- but no respectable mage would go in their trousers like an infant...#$b#I simply have a washroom tucked away in a pocket dimension."
			],
			"check_nice": [
				"%As you try to take a peek, Rasmodius's cape suddenly springs to life, and pushes your hand away.#$b#...Hah?!$1#$b#...By the spirits, @! You mustn't go poking around my robes like that. You could get hurt!"
			],
			"check_mean": [
				"%Hm. You don't see a toilet anywhere in the Wizard's tower... Where does he go???"
			],
			"cooldown_check": [
				"%Things haven't changed since the last check."
			],
			//They check you
			"soiled_change_verynice": [
				"Hm. Well... I suppose a *little* trick of prestidigitation wouldn't take all that much effort...#$b#::760:change:space diaper:1::"
			],
			"change_verynice": [
				"<That#Those> $UNDERWEAR_NAME$ <looks#look> just fine to me. Did you just want my attention?"
			],
			"soiled_change_nice": [
				"It is not my obligation to tend to your trousers.#$b#You are capable enough to change yourself. Please, go and do that."
			],
			"change_nice": [
				"%Rasmodius pays you no mind."
			],
			"soiled_change_mean": [
				"If you simply came here to sully the air and unsettle the precarious flow of magic through my tower, I must ask that you leave at once.$1"
			],
			"change_mean": [
				"%The Wizard ignores you."
			],
			//Ground
			"ground": [
				"@! What in the blazes are you doing!!!$1#$b#%The Wizard snaps his fingers and tidies up the mess you left on the ground.#$b#Bah! Now I have to reexamine all my spell circles to make sure you didn't cause any of them to backlash!$1#$b#...*sigh* I understand you may not have had much notice, but please never do that in my tower again."
			],
			"ground_attempt": [
				"@! What are you doing!$3"
			]
		}
		//																																																									
	},
	"Change": [
		"You change into $PANTS_PREFIX$ clean $PANTS_NAME$ and $INSPECT_UNDERWEAR_NAME$."
		//***"You take off your soiled <OLD_UNDERWEAR_DESC> and put on $UNDERWEAR_PREFIX$ clean $UNDERWEAR_NAME$."
	],
	"Change_Destroyed": [
		"You ruined your $UNDERWEAR_NAME$ when taking <it#them> off. So you throw <it#them> away."
	],
	"PeekWaistband": [
		"You peek inside your waistband and see"
	],
	"LookPants": [
		"You look down and see"
	],
	"Underwear_Clean": "clean $UNDERWEAR_DESC$",
	"Underwear_Drying": "drying $UNDERWEAR_DESC$",

	"Underwear_Wet": [ //Chosen based on diaper wetness, applied after Underwear_Messy.
		"slightly damp $UNDERWEAR_DESC$",
		"somewhat wet $UNDERWEAR_DESC$",
		"very wet $UNDERWEAR_DESC$",
		"drenched $UNDERWEAR_DESC$",
		"dripping wet $UNDERWEAR_DESC$"
	],
	"Underwear_Messy": [ //Chosen based on diaper messiness, applied before Underwear_Wet. Words in brackets are only used if underwear is also wet.
		"<and >slightly poopy $UNDERWEAR_DESC$",
		"<and >somewhat poopy $UNDERWEAR_DESC$",
		"<and >poopy $UNDERWEAR_DESC$",
		"$UNDERWEAR_DESC$ filled with poop",
		"$UNDERWEAR_DESC$ with poop squishing out"
	],




	"Consumables": {
		//While I like the idea of using the IRL caloric values, it can be extremely punishing earlygame and wasteful lategame.
		//So, I retuned food by feel instead, using a percentage of the hunger and thirst meters as my frame of reference.
		//(If a consumable has a negative energy value ingame, I will treat it as harmful, and give it a penalty. Spicy foods will also make you thirsty, as well.)
		//It's more annoying than difficult, and there's not much of a way to make a meaningful progression; either you're completely resource-starved and scraping by on forage early, or you have a couple chickens/cows, and food becomes completely trivialized.

		//Feel free to reach out if you have suggestions, though! (Discord: @EmbersAndRoses)


		//
		//Vegetables
		//
		"Amaranth": {
			"name": "Amaranth",
			"waterContent": 50,
			"calorieContent": 175
		},
		"Artichoke": {
			"name": "Artichoke",
			"waterContent": 200,
			"calorieContent": 275
		},
		"Beet": {
			"name": "Beet",
			"waterContent": 100,
			"calorieContent": 200
		},
		"Bok Choy": {
			"name": "Bok Choy",
			"waterContent": 200,
			"calorieContent": 125
		},
		"Broccoli": {
			"name": "Broccoli",
			"waterContent": 200,
			"calorieContent": 325
		},
		"Carrot": {
			"name": "Carrot",
			"waterContent": 200,
			"calorieContent": 200
		},
		"Cauliflower": {
			"name": "Cauliflower",
			"waterContent": 200,
			"calorieContent": 325
		},
		"Corn": {
			"name": "Corn",
			"waterContent": 100,
			"calorieContent": 350
		},
		"Eggplant": {
			"name": "Eggplant",
			"waterContent": 100,
			"calorieContent": 200
		},
		"Fiddlehead Fern": {
			"name": "Fiddlehead Fern",
			"waterContent": 100,
			"calorieContent": 150
		},
		"Garlic": {
			"name": "Garlic",
			"waterContent": -400,
			"calorieContent": 75 //Chowing down on an entire bulb of garlic would probably give you a stomachache...
		},
		"Green Bean": {
			"name": "Green Bean",
			"waterContent": 100,
			"calorieContent": 125
		},
		"Hops": {
			"name": "Hops",
			"waterContent": 100,
			"calorieContent": 150
		},
		"Kale": {
			"name": "Kale",
			"waterContent": 200,
			"calorieContent": 200
		},
		"Parsnip": {
			"name": "Parsnip",
			"waterContent": 100,
			"calorieContent": 250
		},
		"Potato": {
			"name": "Potato",
			"waterContent": 100,
			"calorieContent": 350 //Po-ta-toes! Boil 'em. Mash 'em. Stick 'em in a stew.
		},
		"Radish": {
			"name": "Radish",
			"waterContent": 50,
			"calorieContent": 75
		},
		"Red Cabbage": {
			"name": "Red Cabbage",
			"waterContent": 150,
			"calorieContent": 350
		},
		"Summer Squash": {
			"name": "Summer Squash",
			"waterContent": 200,
			"calorieContent": 325
		},
		"Taro Root": {
			"name": "Taro Root",
			"waterContent": 50,
			"calorieContent": 500
		},
		"Tomato": {
			"name": "Tomato",
			"waterContent": 200,
			"calorieContent": 140
		},
		"Unmilled Rice": {
			"name": "Unmilled Rice",
			"waterContent": 100,
			"calorieContent": 200
		},
		"Yam": {
			"name": "Yam",
			"waterContent": 100,
			"calorieContent": 225
		},
		//
		//Fruit
		//
		"Apple": {
			"name": "Apple",
			"waterContent": 400,
			"calorieContent": 350
		},
		"Apricot": {
			"name": "Apricot",
			"waterContent": 400,
			"calorieContent": 325
		},
		"Banana": {
			"name": "Banana",
			"waterContent": 200,
			"calorieContent": 475
		},
		"Blackberry": {
			"name": "Blackberry",
			"waterContent": 200,
			"calorieContent": 140
		},
		"Blueberry": {
			"name": "Blueberry",
			"waterContent": 150,
			"calorieContent": 100
		},
		"Cactus Fruit": {
			"name": "Cactus Fruit",
			"waterContent": 1800, //Cactus juice! It'll quench ya! It's the quenchiest!
			"calorieContent": 525
		},
		"Cherry": {
			"name": "Cherry",
			"waterContent": 200,
			"calorieContent": 275
		},
		"Cranberries": {
			"name": "Cranberries",
			"waterContent": 150,
			"calorieContent": 150
		},
		"Crystal Fruit": {
			"name": "Crystal Fruit", //Mmm, delicious and fictitious!
			"waterContent": 1400,
			"calorieContent": 750
		},
		"Grape": {
			"name": "Grape",
			"waterContent": 400, //You ever think about how grapes are basically just water with skin..?
			"calorieContent": 100
		},
		"Hot Pepper": {
			"name": "Hot Pepper",
			"waterContent": -1200, //ouuuuuuuhhh, it's so spicey...
			"calorieContent": 200
		},
		"Mango": {
			"name": "Mango",
			"waterContent": 200,
			"calorieContent": 400
		},
		"Melon": {
			"name": "Melon",
			"waterContent": 2800,
			"calorieContent": 1050 //...Sure, why not scarf down an entire watermelon?
		},
		"Orange": {
			"name": "Orange",
			"waterContent": 400,
			"calorieContent": 450
		},
		"Peach": {
			"name": "Peach",
			"waterContent": 200,
			"calorieContent": 475
		},
		"Pineapple": {
			"name": "Pineapple",
			"waterContent": 800,
			"calorieContent": 650
		},
		"Pomegranate": {
			"name": "Pomegranate",
			"waterContent": 400,
			"calorieContent": 450
		},
		"Powdermelon": {
			"name": "Powdermelon",
			"waterContent": 1600,
			"calorieContent": 700
		},
		"Qi Fruit": {
			"name": "Qi Fruit",
			"waterContent": 500,
			"calorieContent": 1000
		},
		"Rhubarb": {
			"name": "Rhubarb",
			"waterContent": 200,
			"calorieContent": 425
		},
		"Salmonberry": {
			"name": "Salmonberry",
			"waterContent": 200,
			"calorieContent": 125
		},
		"Spice Berry": {
			"name": "Spice Berry",
			"waterContent": -300,
			"calorieContent": 200
		},
		"Starfruit": {
			"name": "Starfruit",
			"waterContent": 800,
			"calorieContent": 400
		},
		"Strawberry": {
			"name": "Strawberry",
			"waterContent": 400,
			"calorieContent": 120
		},
		"Wild Plum": {
			"name": "Wild Plum",
			"waterContent": 200,
			"calorieContent": 150
		},
		//
		//Flowers
		//
		//Most of these would actually be poisonous to eat IRL.
		"Blue Jazz": {
			"name": "Blue Jazz",
			"waterContent": 0,
			"calorieContent": 0
		},
		"Crocus": {
			"name": "Crocus",
			"waterContent": 0,
			"calorieContent": 0
		},
		"Fairy Rose": {
			"name": "Fairy Rose",
			"waterContent": 0,
			"calorieContent": 0
		},
		"Poppy": {
			"name": "Poppy",
			"waterContent": 0,
			"calorieContent": 0
		},
		"Summer Spangle": {
			"name": "Summer Spangle",
			"waterContent": 0,
			"calorieContent": 0
		},
		"Sunflower": {
			"name": "Sunflower",
			"waterContent": 25,
			"calorieContent": 200 //Congratulations to Sunflowers for actually being edible!
		},
		"Sweet Pea": {
			"name": "Sweet Pea",
			"waterContent": 0,
			"calorieContent": 0
		},
		"Tulip": {
			"name": "Tulip",
			"waterContent": 0,
			"calorieContent": 0
		},
		//
		//Foraging
		//
		"Cave Carrot": {
			"name": "Cave Carrot",
			"waterContent": 400,
			"calorieContent": 625
		},
		"Chantrelle": {
			"name": "Chantrelle",
			"waterContent": 200,
			"calorieContent": 400
		},
		"Common Mushroom": {
			"name": "Common Mushroom",
			"waterContent": 100,
			"calorieContent": 250
		},
		"Daffodil": {
			"name": "Daffodil",
			"waterContent": 25,
			"calorieContent": 50
		},
		"Dandelion": {
			"name": "Dandelion",
			"waterContent": 200,
			"calorieContent": 250
		},
		"Ginger": {
			"name": "Ginger",
			"waterContent": -400, //Got a bit of kick to it.
			"calorieContent": 400
		},
		"Hazelnut": {
			"name": "Hazelnut",
			"waterContent": 500,
			"calorieContent": 525
		},
		"Holly": {
			"name": "Holly",
			"waterContent": -1500,
			"calorieContent": -1250 //If the energy penalty didn't already warn you that eating poisonous plants was a bad idea, I don't know what to say.
		},
		"Leek": {
			"name": "Leek",
			"waterContent": 500,
			"calorieContent": 350
		},
		"Magma Cap": {
			"name": "Magma Cap",
			"waterContent": -1250, //Oof ouch owie, it's Hot.
			"calorieContent": 1500 //The power of the sun, in the palm of my hand...
		},
		"Morel": {
			"name": "Morel",
			"waterContent": 200,
			"calorieContent": 450
		},
		"Purple Mushroom": {
			"name": "Purple Mushroom",
			"waterContent": 200,
			"calorieContent": 825
		},
		"Red Mushroom": {
			"name": "Red Mushroom",
			"waterContent": -1500,
			"calorieContent": -1250 //Don't eat this; you won't go to the Mushroom Kingdom, you'll go to the hospital.
		},
		"Sap": {
			"name": "Sap",
			"waterContent": -100, //Sticky...
			"calorieContent": 50 //Most tree saps are indeed safe to consume, but you should still pasteurize it first for bacteria reasons.
		},
		"Snow Yam": {
			"name": "Snow Yam",
			"waterContent": 200,
			"calorieContent": 400
		},
		"Spring Onion": {
			"name": "Spring Onion",
			"waterContent": 100,
			"calorieContent": 400
		},
		"Wild Horseradish": {
			"name": "Wild Horseradish",
			"waterContent": -1200, //...Tastes like getting kicked in the mouth by a horse.
			"calorieContent": 475
		},
		"Winter Root": {
			"name": "Winter Root",
			"waterContent": 100,
			"calorieContent": 450
		},
		//
		//Animals
		//
		"Duck Egg": {
			"name": "Duck Egg",
			"waterContent": 50,
			"calorieContent": 475
		},
		"Egg": {
			"name": "Egg",
			"waterContent": 50,
			"calorieContent": 375
		},
		"Goat Milk": {
			"name": "Goat Milk",
			"waterContent": 3200,
			"calorieContent": 525
		},
		"Golden Egg": {
			"name": "Golden Egg",
			"waterContent": 100,
			"calorieContent": 700
		},
		"L. Goat Milk": {
			"name": "L. Goat Milk",
			"waterContent": 7000,
			"calorieContent": 1050 //To avoid trivializing food completely, Large Milk gets a *bit* of a nerf - though it is still viable food for the babs.
		},
		"Large Egg": {
			"name": "Large Egg",
			"waterContent": 75,
			"calorieContent": 350
		},
		"Large Milk": {
			"name": "Large Milk",
			"waterContent": 6000, //...However, chugging down gallons of milk is gonna fill up your bladder VERY quickly.
			"calorieContent": 1050
		},
		"Milk": {
			"name": "Milk",
			"waterContent": 2400,
			"calorieContent": 450
		},
		"Ostrich Egg": {
			"name": "Ostrich Egg",
			"waterContent": 800,
			"calorieContent": 2000 //A whole Ostrich Egg, appearantly
		},
		"Truffle": {
			"name": "Truffle",
			"waterContent": 25,
			"calorieContent": 285
		},
		"Void Egg": {
			"name": "Void Egg",
			"waterContent": -1000, //You'll need to wash down the taste of burnt hair.
			"calorieContent": 525
		},
		//
		//Artisan Goods
		//
		"Aged Roe": {
			"name": "Aged Roe",
			"waterContent": 500,
			"calorieContent": 325
		},
		"Caviar": {
			"name": "Caviar",
			"waterContent": 500,
			"calorieContent": 260
		},
		"Cheese": {
			"name": "Cheese",
			"waterContent": 200,
			"calorieContent": 875
		},
		"Dinosaur Mayonnaise": {
			"name": "Dinosaur Mayonnaise",
			"waterContent": 6000,
			"calorieContent": 2700 //We were so caught up in whether we could, that we didn't stop to think if we should...
		},
		"Dried Fruit": {
			"name": "Dried Fruit",
			"waterContent": 50,
			"calorieContent": 1300
		},
		"Dried Mushrooms": {
			"name": "Dried Mushrooms",
			"waterContent": 50,
			"calorieContent": 1000
		},
		"Duck Mayonnaise": {
			"name": "Duck Mayonnaise",
			"waterContent": 800,
			"calorieContent": 1440 //A viable source of calories... but at what cost..?
		},
		"Goat Cheese": {
			"name": "Goat Cheese",
			"waterContent": 200,
			"calorieContent": 1050 //Hope you aren't lactose intolerant.
		},
		"Jelly": {
			"name": "Jelly",
			"waterContent": 1600,
			"calorieContent": 800
		},
		"Maple Syrup": {
			"name": "Maple Syrup",
			"waterContent": 2400,
			"calorieContent": 1400 //Fun fact: maple syrup has a mild laxative effect.
		},
		"Mayonnaise": {
			"name": "Mayonnaise",
			"waterContent": 1600,
			"calorieContent": 1225
		},
		"Mystic Syrup": {
			"name": "Mystic Syrup",
			"waterContent": 8000,
			"calorieContent": 3500 //What's the nutritional value for a jug of magic tree syrup? ...I'm just gonna say "All of it".
		},
		"Pickles": {
			"name": "Pickles",
			"waterContent": 2000,
			"calorieContent": 750
		},
		"Raisins": {
			"name": "Raisins",
			"waterContent": 500,
			"calorieContent": 800
		},
		"Smoked Fish": {
			"name": "Smoked Fish",
			"waterContent": 1000,
			"calorieContent": 1300
		},
		"Void Mayonnaise": {
			"name": "Void Mayonnaise", //Yum! Nightmare sludge, straight from the void!
			"waterContent": -500, //Tastes like burnt hair...
			"calorieContent": 6000 //Potion of Fill Your Pants Immediately
		},

		//
		//Drinks
		//
		"Beer": {
			"name": "Beer",
			"waterContent": 4000,
			"calorieContent": 150
		},
		"Coffee": {
			"name": "Coffee",
			"waterContent": 4800,
			"calorieContent": 250
		},
		"Cranberry Candy": {
			"name": "Cranberry Candy",
			"waterContent": 2800,
			"calorieContent": 200
		},
		"Energy Tonic": {
			"name": "Energy Tonic",
			"waterContent": 3200,
			"calorieContent": 100
		},
		"Ginger Ale": {
			"name": "Ginger Ale",
			"waterContent": 3200,
			"calorieContent": 160
		},
		"Green Tea": {
			"name": "Green Tea",
			"waterContent": 4800,
			"calorieContent": 437
		},
		"Joja Cola": {
			"name": "Joja Cola",
			"waterContent": 4000,
			"calorieContent": 100
		},
		"Juice": {
			"name": "Juice",
			"waterContent": 3000,
			"calorieContent": 250
		},
		"Life Elixir": {
			"name": "Life Elixir",
			"waterContent": 3200,
			"calorieContent": 150
		},
		"Mead": {
			"name": "Mead",
			"waterContent": 6000,
			"calorieContent": 350
		},
		//This is a Tikku addition with the goal of being a laxitive.
		//When taken, you'll mess immediately.
		//ID is [351], to have a character give you this item.
		"Muscle Remedy": {
			"name": "Muscle Remedy",
			"waterContent": 50,
			"calorieContent": 10000
		},
		"Pale Ale": {
			"name": "Pale Ale",
			"waterContent": 5500,
			"calorieContent": 180
		},
		"Piña Colada": {
			"name": "Piña Colada",
			"waterContent": 6000,
			"calorieContent": 55
		},
		"Triple Shot Espresso": {
			"name": "Triple Shot Espresso",
			"waterContent": 10000, //Thats an awful lot of caffeine for a little bladder... Better make sure you're wearing your big-kid diapers before drinking a grown-up drink like this.
			"calorieContent": 650
		},
		"Wine": {
			"name": "Wine",
			"waterContent": 6000,
			"calorieContent": 125
		},
		//
		//Fishing
		//
		"Albacore": {
			"name": "Albacore",
			"waterContent": 400,
			"calorieContent": 1050
		},
		"Anchovy": {
			"name": "Anchovy",
			"waterContent": 400,
			"calorieContent": 450
		},
		"Angler": {
			"name": "Angler", //All Legendary fish give an entire water and hunger meter. If you're going to use them like this, you might as well get your money's worth.
			"waterContent": 8000,
			"calorieContent": 3500
		},
		"Blobfish": {
			"name": "Blobfish",
			"waterContent": 800,
			"calorieContent": 875 //Poor blobfish... They actually look pretty normal when they're down on the ocean floor.
		},
		"Blue Discus": {
			"name": "Blue Discus",
			"waterContent": 400,
			"calorieContent": 550
		},
		"Bream": {
			"name": "Bream",
			"waterContent": 400,
			"calorieContent": 625
		},
		"Bullhead": {
			"name": "Bullhead",
			"waterContent": 400,
			"calorieContent": 625
		},
		"Carp": {
			"name": "Carp",
			"waterContent": 400,
			"calorieContent": 625
		},
		"Catfish": {
			"name": "Catfish",
			"waterContent": 400,
			"calorieContent": 1050
		},
		"Cave Jelly": {
			"name": "Cave Jelly",
			"waterContent": 1600,
			"calorieContent": 350
		},
		"Chub": {
			"name": "Chub",
			"waterContent": 400,
			"calorieContent": 625
		},
		"Crimsonfish": {
			"name": "Crimsonfish",
			"waterContent": 8000,
			"calorieContent": 3500
		},
		"Dorado": {
			"name": "Dorado",
			"waterContent": 400,
			"calorieContent": 700
		},
		"Eel": {
			"name": "Eel",
			"waterContent": 400,
			"calorieContent": 1050
		},
		"Flounder": {
			"name": "Flounder",
			"waterContent": 400,
			"calorieContent": 700
		},
		"Ghostfish": {
			"name": "Ghostfish",
			"waterContent": 400,
			"calorieContent": 875
		},
		"Glacierfish": {
			"name": "Glacierfish",
			"waterContent": 8000,
			"calorieContent": 3500
		},
		"Glacierfish Jr.": {
			"name": "Glacierfish Jr.",
			"waterContent": 8000,
			"calorieContent": 3500
		},
		"Goby": {
			"name": "Goby",
			"waterContent": -800,
			"calorieContent": -875
		},
		"Green Algae": {
			"name": "Green Algae",
			"waterContent": 800, //Ew, slimy.
			"calorieContent": 300
		},
		"Halibut": {
			"name": "Halibut",
			"waterContent": 400,
			"calorieContent": 875
		},
		"Herring": {
			"name": "Herring",
			"waterContent": 400,
			"calorieContent": 550
		},
		"Ice Pip": {
			"name": "Ice Pip",
			"waterContent": 400,
			"calorieContent": 1050
		},
		"Largemouth Bass": {
			"name": "Largemouth Bass",
			"waterContent": 400,
			"calorieContent": 875
		},
		"Lava Eel": {
			"name": "Lava Eel",
			"waterContent": 400,
			"calorieContent": 1050
		},
		"Legend": {
			"name": "Legend",
			"waterContent": 8000,
			"calorieContent": 3500
		},
		"Legend II": {
			"name": "Legend II",
			"waterContent": 8000,
			"calorieContent": 3500
		},
		"Lingcod": {
			"name": "Lingcod",
			"waterContent": 400,
			"calorieContent": 1050
		},
		"Lionfish": {
			"name": "Lionfish",
			"waterContent": 400,
			"calorieContent": 625
		},
		"Midnight Carp": {
			"name": "Midnight Carp",
			"waterContent": 400,
			"calorieContent": 875
		},
		"Midnight Squid": {
			"name": "Midnight Squid",
			"waterContent": 400,
			"calorieContent": 875
		},
		"Ms. Angler": {
			"name": "Ms. Angler",
			"waterContent": 8000,
			"calorieContent": 3500
		},
		"Mutant Carp": {
			"name": "Mutant Carp",
			"waterContent": 8000,
			"calorieContent": 3500
		},
		"Perch": {
			"name": "Perch",
			"waterContent": 400,
			"calorieContent": 625
		},
		"Pike": {
			"name": "Pike",
			"waterContent": 400,
			"calorieContent": 875
		},
		"Pufferfish": {
			"name": "Pufferfish",
			"waterContent": -8000,
			"calorieContent": -3500 //Pufferfish are one of the worst things you could POSSIBLY stuff in your face-hole. You would die so hard if you did this. There's a reason chefs have to take 3+ years of intensive training to be able to serve Fugu safely.
		},
		"Radioactive Carp": {
			"name": "Radioactive Carp",
			"waterContent": 8000,
			"calorieContent": 3500
		},
		"Rainbow Trout": {
			"name": "Rainbow Trout",
			"waterContent": 400,
			"calorieContent": 625
		},
		"Red Mullet": {
			"name": "Red Mullet",
			"waterContent": 400,
			"calorieContent": 625
		},
		"Red Snapper": {
			"name": "Red Snapper",
			"waterContent": 400,
			"calorieContent": 625
		},
		"River Jelly": {
			"name": "River Jelly",
			"waterContent": 1600,
			"calorieContent": 350
		},
		"Salmon": {
			"name": "Salmon",
			"waterContent": 400,
			"calorieContent": 875
		},
		"Sandfish": {
			"name": "Sandfish",
			"waterContent": 400,
			"calorieContent": 725
		},
		"Sardine": {
			"name": "Sardine",
			"waterContent": 400,
			"calorieContent": 450
		},
		"Scorpion Carp": {
			"name": "Scorpion Carp",
			"waterContent": -400,
			"calorieContent": -1050 //Yeah, eating a scorpion stinger isn't gonna be good...
		},
		"Sea Cucumber": {
			"name": "Sea Cucumber",
			"waterContent": -800,
			"calorieContent": -375
		},
		"Sea Jelly": {
			"name": "Sea Jelly",
			"waterContent": 1600,
			"calorieContent": 350
		},
		"Seaweed": {
			"name": "Seaweed",
			"waterContent": 400,
			"calorieContent": 350
		},
		"Shad": {
			"name": "Shad",
			"waterContent": 400,
			"calorieContent": 875
		},
		"Slimejack": {
			"name": "Slimejack", //Yum... Slimy sewer fish...
			"waterContent": 1600,
			"calorieContent": 1050
		},
		"Smallmouth Bass": {
			"name": "Smallmouth Bass",
			"waterContent": 400,
			"calorieContent": 625
		},
		"Son of Crimsonfish": {
			"name": "Son of Crimsonfish",
			"waterContent": 8000,
			"calorieContent": 3500
		},
		"Spook Fish": {
			"name": "Spook Fish",
			"waterContent": 400,
			"calorieContent": 875
		},
		"Squid": {
			"name": "Squid",
			"waterContent": 400,
			"calorieContent": 875
		},
		"Stingray": {
			"name": "Stingray",
			"waterContent": 400,
			"calorieContent": 1050
		},
		"Sturgeon": {
			"name": "Sturgeon",
			"waterContent": 400,
			"calorieContent": 1050
		},
		"Sunfish": {
			"name": "Sunfish",
			"waterContent": 400,
			"calorieContent": 625
		},
		"Super Cucumber": {
			"name": "Super Cucumber",
			"waterContent": 1200,
			"calorieContent": 1050
		},
		"Tiger Trout": {
			"name": "Tiger Trout",
			"waterContent": 400,
			"calorieContent": 700
		},
		"Tilapia": {
			"name": "Tilapia",
			"waterContent": 400,
			"calorieContent": 700
		},
		"Tuna": {
			"name": "Tuna",
			"waterContent": 400,
			"calorieContent": 875
		},
		"Void Salmon": {
			"name": "Void Salmon",
			"waterContent": 400,
			"calorieContent": 1050
		},
		"Walleye": {
			"name": "Walleye",
			"waterContent": 400,
			"calorieContent": 875
		},
		"White Algae": {
			"name": "White Algae",
			"waterContent": 800,
			"calorieContent": 300
		},
		"Woodskip": {
			"name": "Woodskip",
			"waterContent": 500,
			"calorieContent": 700
		},
		//
		//Cooking Ingredients
		//
		"Oil": {
			"name": "Oil",
			"waterContent": 800,
			"calorieContent": 5500 //...Did we learn nothing as a society from the Starbucks Olive Oil Coffee incidents?
		},
		"Oil of Garlic": {
			"name": "Oil of Garlic",
			"waterContent": 1400,
			"calorieContent": 6000 //I'm not sure if the garlic is gonna do the repelling here...
		},
		"Rice": {
			"name": "Rice",
			"waterContent": 500,
			"calorieContent": 525
		},
		"Sugar": {
			"name": "Sugar",
			"waterContent": 100,
			"calorieContent": 400
		},
		"Truffle Oil": {
			"name": "Truffle Oil",
			"waterContent": 1200,
			"calorieContent": 6000
		},
		"Vinegar": {
			"name": "Vinegar",
			"waterContent": 2000,
			"calorieContent": 200
		},
		"Wheat Flour": {
			"name": "Wheat Flour",
			"waterContent": -400, //this is gonna be so dry LMAO
			"calorieContent": 400
		},
		//
		//Meals
		//
		"Algae Soup": {
			"name": "Algae Soup",
			"waterContent": 4000,
			"calorieContent": 1050
		},
		"Artichoke Dip": {
			"name": "Artichoke Dip",
			"waterContent": 2000,
			"calorieContent": 1400
		},
		"Autumn's Bounty": {
			"name": "Autumn's Bounty",
			"waterContent": 400,
			"calorieContent": 2275
		},
		"Baked Fish": {
			"name": "Baked Fish",
			"waterContent": 400,
			"calorieContent": 1750
		},
		"Banana Pudding": {
			"name": "Banana Pudding",
			"waterContent": 1200,
			"calorieContent": 1400
		},
		"Bean Hotpot": {
			"name": "Bean Hotpot",
			"waterContent": 3000,
			"calorieContent": 1050
		},
		"Blackberry Cobbler": {
			"name": "Blackberry Cobbler",
			"waterContent": 800,
			"calorieContent": 2275
		},
		"Blueberry Tart": {
			"name": "Blueberry Tart",
			"waterContent": 800,
			"calorieContent": 1575
		},
		"Bread": {
			"name": "Bread",
			"waterContent": 200,
			"calorieContent": 900
		},
		"Bruschetta": {
			"name": "Bruschetta",
			"waterContent": 200,
			"calorieContent": 1200
		},
		"Bug Steak": {
			"name": "Bug Steak",
			"waterContent": 400,
			"calorieContent": 700
		},
		"Carp Surprise": {
			"name": "Carp Surprise",
			"waterContent": 1000,
			"calorieContent": 2100
		},
		"Cheese Cauliflower": {
			"name": "Cheese Cauliflower",
			"waterContent": 600,
			"calorieContent": 1300
		},
		"Chocolate Cake": {
			"name": "Chocolate Cake",
			"waterContent": 400,
			"calorieContent": 2625
		},
		"Chowder": {
			"name": "Chowder",
			"waterContent": 4800,
			"calorieContent": 1050
		},
		"Coleslaw": {
			"name": "Coleslaw",
			"waterContent": 2000,
			"calorieContent": 1050
		},
		"Complete Breakfast": {
			"name": "Complete Breakfast",
			"waterContent": 2400,
			"calorieContent": 3000
		},
		"Cookie": {
			"name": "Cookie",
			"waterContent": 200,
			"calorieContent": 700
		},
		"Crab Cakes": {
			"name": "Crab Cakes",
			"waterContent": 400,
			"calorieContent": 2100
		},
		"Cranberry Sauce": {
			"name": "Cranberry Sauce",
			"waterContent": 1500,
			"calorieContent": 700
		},
		"Crispy Bass": {
			"name": "Crispy Bass",
			"waterContent": 400,
			"calorieContent": 1575
		},
		"Dish O' The Sea": {
			"name": "Dish O' The Sea",
			"waterContent": 400,
			"calorieContent": 1750
		},
		"Eggplant Parmesean": {
			"name": "Eggplant Parmesean",
			"waterContent": 400,
			"calorieContent": 1225
		},
		"Escargot": {
			"name": "Escargot",
			"waterContent": 400,
			"calorieContent": 875
		},
		"Farmer's Lunch": {
			"name": "Farmer's Lunch",
			"waterContent": 400,
			"calorieContent": 1500
		},
		"Field Snack": {
			"name": "Field Snack",
			"waterContent": 200,
			"calorieContent": 950 //A good emergency snack
		},
		"Fiddlehead Risotto": {
			"name": "Fiddlehead Risotto",
			"waterContent": 400,
			"calorieContent": 1350
		},
		"Fish Stew": {
			"name": "Fish Stew",
			"waterContent": 2800,
			"calorieContent": 1750
		},
		"Fish Taco": {
			"name": "Fish Taco",
			"waterContent": 400,
			"calorieContent": 2275
		},
		"Fried Calamari": {
			"name": "Fried Calamari",
			"waterContent": 400,
			"calorieContent": 1225
		},
		"Fried Eel": {
			"name": "Fried Eel",
			"waterContent": 400,
			"calorieContent": 1225
		},
		"Fried Egg": {
			"name": "Fried Egg",
			"waterContent": 400,
			"calorieContent": 525
		},
		"Fried Mushroom": {
			"name": "Fried Mushroom",
			"waterContent": 400,
			"calorieContent": 1050
		},
		"Fruit Salad": {
			"name": "Fruit Salad",
			"waterContent": 1200,
			"calorieContent": 875
		},
		"Glazed Yams": {
			"name": "Glazed Yams",
			"waterContent": 400,
			"calorieContent": 875
		},
		"Hashbrowns": {
			"name": "Hashbrowns",
			"waterContent": 400,
			"calorieContent": 700
		},
		"Ice Cream": {
			"name": "Ice Cream",
			"waterContent": 800,
			"calorieContent": 700
		},
		"Lobster Bisque": {
			"name": "Lobster Bisque",
			"waterContent": 3000,
			"calorieContent": 1225
		},
		"Lucky Lunch": {
			"name": "Lucky Lunch",
			"waterContent": 400,
			"calorieContent": 1225
		},
		"Magic Rock Candy": {
			"name": "Magic Rock Candy",
			"waterContent": 8000,
			"calorieContent": 3500
		},
		"Maki Roll": {
			"name": "Maki Roll",
			"waterContent": 800,
			"calorieContent": 1050
		},
		"Mango Sticky Rice": {
			"name": "Mango Sticky Rice",
			"waterContent": 400,
			"calorieContent": 1225
		},
		"Maple Bar": {
			"name": "Maple Bar",
			"waterContent": 400,
			"calorieContent": 1400
		},
		"Miner's Treat": {
			"name": "Miner's Treat",
			"waterContent": 400,
			"calorieContent": 1050
		},
		"Moss Soup": {
			"name": "Moss Soup",
			"waterContent": 2000,
			"calorieContent": 700
		},
		"Omelet": {
			"name": "Omelet",
			"waterContent": 400,
			"calorieContent": 875
		},
		"Pale Broth": {
			"name": "Pale Broth",
			"waterContent": 2000,
			"calorieContent": 875
		},
		"Pancakes": {
			"name": "Pancakes",
			"waterContent": 400,
			"calorieContent": 1050
		},
		"Parsnip Soup": {
			"name": "Parsnip Soup",
			"waterContent": 2000,
			"calorieContent": 1050
		},
		"Pepper Poppers": {
			"name": "Pepper Poppers",
			"waterContent": -1200,
			"calorieContent": 1575
		},
		"Pink Cake": {
			"name": "Pink Cake",
			"waterContent": 400,
			"calorieContent": 2400
		},
		"Pizza": {
			"name": "Pizza",
			"waterContent": 400,
			"calorieContent": 2750 //If you're eating multiple whole pizzas back to back, I am not responsible for your blowouts.
		},
		"Plum Pudding": {
			"name": "Plum Pudding",
			"waterContent": 400,
			"calorieContent": 1575
		},
		"Poi": {
			"name": "Poi",
			"waterContent": 4000,
			"calorieContent": 2450
		},
		"Poppyseed Muffin": {
			"name": "Poppyseed Muffin",
			"waterContent": 400,
			"calorieContent": 1225
		},
		"Pumpkin Pie": {
			"name": "Pumpkin Pie",
			"waterContent": 400,
			"calorieContent": 2100
		},
		"Pumpkin Soup": {
			"name": "Pumpkin Soup",
			"waterContent": 2000,
			"calorieContent": 1050
		},
		"Radish Salad": {
			"name": "Radish Salad",
			"waterContent": 400,
			"calorieContent": 875
		},
		"Red Plate": {
			"name": "Red Plate",
			"waterContent": 400,
			"calorieContent": 875
		},
		"Rhubarb Pie": {
			"name": "Rhubarb Pie",
			"waterContent": 400,
			"calorieContent": 875
		},
		"Rice Pudding": {
			"name": "Rice Pudding",
			"waterContent": 1200,
			"calorieContent": 875
		},
		"Roasted Hazelnuts": {
			"name": "Roasted Hazelnuts",
			"waterContent": 400,
			"calorieContent": 1050
		},
		"Roots Platter": {
			"name": "Roots Platter",
			"waterContent": 400,
			"calorieContent": 1050
		},
		"Salad": {
			"name": "Salad",
			"waterContent": 400,
			"calorieContent": 875
		},
		"Salmon Dinner": {
			"name": "Salmon Dinner",
			"waterContent": 400,
			"calorieContent": 2100
		},
		"Sashimi": {
			"name": "Sashimi",
			"waterContent": 400,
			"calorieContent": 1000
		},
		"Seafoam Pudding": {
			"name": "Seafoam Pudding",
			"waterContent": 2000,
			"calorieContent": 1400
		},
		"Shrimp Cocktail": {
			"name": "Shrimp Cocktail",
			"waterContent": 2000,
			"calorieContent": 1225
		},
		"Spaghetti": {
			"name": "Spaghetti",
			"waterContent": 800,
			"calorieContent": 1450
		},
		"Spicy Eel": {
			"name": "Spicy Eel",
			"waterContent": -1000,
			"calorieContent": 2100
		},
		"Squid Ink Ravioli": {
			"name": "Squid Ink Ravioli",
			"waterContent": 1600,
			"calorieContent": 1425
		},
		"Stir Fry": {
			"name": "Stir Fry",
			"waterContent": 1000,
			"calorieContent": 1750
		},
		"Strange Bun": {
			"name": "Strange Bun",
			"waterContent": 2000,
			"calorieContent": 1875
		},
		"Stuffing": {
			"name": "Stuffing",
			"waterContent": 400,
			"calorieContent": 1225
		},
		"Super Meal": {
			"name": "Super Meal",
			"waterContent": 400,
			"calorieContent": 2050
		},
		"Survival Burger": {
			"name": "Survival Burger",
			"waterContent": 400,
			"calorieContent": 1550
		},
		"Tom Kha Soup": {
			"name": "Tom Kha Soup",
			"waterContent": 3000,
			"calorieContent": 1225
		},
		"Tortilla": {
			"name": "Tortilla",
			"waterContent": 100,
			"calorieContent": 400
		},
		"Tropical Curry": {
			"name": "Tropical Curry",
			"waterContent": 2000,
			"calorieContent": 2275
		},
		"Trout Soup": {
			"name": "Trout Soup",
			"waterContent": 3000,
			"calorieContent": 1225
		},
		"Vegetable Medley": {
			"name": "Vegetable Medley",
			"waterContent": 400,
			"calorieContent": 875
		}



	},
	"Underwear_Options": {
		"bed": {
			"name": "bed",
			"description": "cozy bed",
			"absorbency": 2500.0,
			"containment": 1000.0,
			"spriteIndex": -1,
			"price": 0,
			"washable": true,
			"plural": false,
			"dryingTime": 2400,
			"removable": false,
			"durability": -1
		},
		"blue jeans": {
			"name": "blue jeans",
			"description": "sturdy blue jeans",
			"absorbency": 300.0,
			"containment": 60.0,
			"spriteIndex": -1,
			"price": 1000,
			"washable": true,
			"plural": true,
			"dryingTime": 600,
			"removable": true,
			"durability": -1
		},
		"black thong": {
			"name": "black thong",
			"description": "lacy black thong",
			"absorbency": 50.0,
			"containment": 75.0,
			"spriteIndex": 0,
			"price": 10,
			"washable": true,
			"plural": false,
			"dryingTime": 300,
			"removable": true,
			"durability": 4
		},
		"polka dot panties": {
			"name": "polka dot panties",
			"description": "simple white panties with pink polka dots",
			"absorbency": 75.0,
			"containment": 150.0,
			"spriteIndex": 1,
			"price": 10,
			"washable": true,
			"plural": true,
			"dryingTime": 400,
			"removable": true,
			"durability": 4
		},
		"big kid undies": {
			"name": "big kid undies",
			"description": "cotton undies for big kids only",
			"absorbency": 100.0,
			"containment": 400.0,
			"spriteIndex": 2,
			"price": 10,
			"washable": true,
			"plural": true,
			"dryingTime": 400,
			"removable": true,
			"durability": 4
		},
		"dinosaur undies": {
			"name": "dinosaur undies",
			"description": "green undies covered in adorable dinosaurs",
			"absorbency": 100.0,
			"containment": 400.0,
			"spriteIndex": 3,
			"price": 10,
			"washable": true,
			"plural": true,
			"dryingTime": 400,
			"removable": true,
			"durability": 4
		},
		"lavender pullup": {
			"name": "lavender pullup",
			"description": "soft and snug lavender pullup",
			"absorbency": 600.0,
			"containment": 550.0,
			"spriteIndex": 4,
			"price": 25,
			"washable": false,
			"plural": false,
			"dryingTime": 0,
			"removable": true,
			"durability": 0
		},
		"training pants": {
			"name": "training pants",
			"description": "cloth potty training pants that look like big kid undies",
			"absorbency": 450.0,
			"containment": 400.0,
			"spriteIndex": 5,
			"price": 100,
			"washable": true,
			"plural": true,
			"dryingTime": 600,
			"removable": true,
			"durability": 5
		},
		"Joja diaper": {
			"name": "Joja diaper",
			"description": "thin white plastic diaper from JojaMart",
			"absorbency": 1000.0,
			"containment": 600.0,
			"spriteIndex": 6,
			"price": 50,
			"washable": false,
			"plural": false,
			"dryingTime": 0,
			"removable": false,
			"durability": 0
		},
		"baby print diaper": {
			"name": "baby print diaper",
			"description": "soft and crinkly fresh-scented baby print diaper",
			"absorbency": 2000.0,
			"containment": 1000.0,
			"spriteIndex": 7,
			"price": 75,
			"washable": false,
			"plural": false,
			"dryingTime": 0,
			"removable": false,
			"durability": 0
		},
		"cloth diaper": {
			"name": "cloth diaper",
			"description": "thick and soft white cloth diaper",
			"absorbency": 1800.0,
			"containment": 1400.0,
			"spriteIndex": 8,
			"price": 500,
			"washable": true,
			"plural": false,
			"dryingTime": 800,
			"removable": true,
			"durability": 8
		},
		"space diaper": {
			"name": "space diaper",
			"description": "very thick plastic diaper, with a stars-and-spaceships print",
			"absorbency": 2400.0,
			"containment": 1400.0,
			"spriteIndex": 9,
			"price": 125,
			"washable": false,
			"plural": false,
			"dryingTime": 0,
			"removable": false,
			"durability": 0
		},
		"pawprint diaper": {
			"name": "pawprint diaper",
			"description": "puffy plastic diaper, with cute animal prints and fade-when-wet little paws",
			"absorbency": 2600.0,
			"containment": 1200.0,
			"spriteIndex": 10,
			"price": 125,
			"washable": false,
			"plural": false,
			"dryingTime": 0,
			"removable": false,
			"durability": 0
		},
		"heart diaper": {
			"name": "heart diaper",
			"description": "very thick and soft pink plastic diaper, with a large fade-when-wet heart on the front",
			"absorbency": 3000.0,
			"containment": 1600.0,
			"spriteIndex": 11,
			"price": 150,
			"washable": false,
			"plural": false,
			"dryingTime": 0,
			"removable": false,
			"durability": 0
		},
		"lil swabbies": {
			"name": "lil swabbies",
			"description": "puffy light-blue diaper, sporting a fashionable sea-faring design",
			"absorbency": 2300.0,
			"containment": 1100.0,
			"spriteIndex": 12,
			"price": 150,
			"washable": false,
			"plural": false,
			"removable": false,
			"durability": 0
		}
	}
}